jojo/jojo.org
#+html_head: <link rel="stylesheet" href="css/org-page.css"/>
#+property: tangle jojo.py
#+title: jojo's programming adventure in python

* [todo-stack]

*** to make Stack different from Vect

*** fix problem calling python funtion with kwargs

*** (+actor)

