jojo/jojo.org
*** (+generator) -- python like generator and yield

    - for scrapy

    - (+generator k1 1 give k1)
      k1 next

*** parse_sexp_vect -- error handling

    - to be able to use it in jojo

*** inline module_debug_one_step and module_repl_one_step

    - to avoid the use of 'try & except'

* prolog

*** import

    #+begin_src python
    import inspect
    import types
    import importlib
    import sys
    import os
    import itertools
    import collections
    import operator
    import traceback
    import pprint
    #+end_src

*** utility

***** get_signature

      #+begin_src python
      def get_signature(fun):
          try:
              return inspect.signature(fun)
          except ValueError:
              return None
      #+end_src

***** fun_p

      #+begin_src python
      def fun_p(x):
          if (isinstance(x, types.LambdaType) or
              isinstance(x, types.MethodType)):
              return True
          elif (isinstance(x, types.BuiltinFunctionType) or
                isinstance(x, types.BuiltinMethodType)):
              if get_signature(x) == None:
                  return False
              else:
                  return True
          else:
              return False
      #+end_src

***** method_p

      #+begin_src python
      def method_p(x):
          if isinstance(x, types.MethodType):
              return True
          elif isinstance(x, types.BuiltinMethodType):
              if get_signature(x) == None:
                  return False
              else:
                  return True
          else:
              return False
      #+end_src

***** class_p

      #+begin_src python
      def class_p(x):
          if not inspect.isclass(x):
              return False
          elif x == type:
              return False
          else:
              return True
      #+end_src

***** Vect

      #+begin_src python
      Vect = list
      #+end_src

***** vect_p

      #+begin_src python
      def vect_p(x):
          return type(x) == Vect
      #+end_src

***** string_p

      #+begin_src python
      def string_p(x):
          return type(x) == str
      #+end_src

***** fill_vect

      #+begin_src python
      def fill_vect(value, length):
          vect = []
          i = 0
          while i < length:
              vect.append(value)
              i = i + 1
          return vect
      #+end_src

***** fill_tuple

      #+begin_src python
      def fill_tuple(value, length):
          return tuple(fill_vect(value, length))
      #+end_src

*** error handling

***** JOJO_ERROR

      #+begin_src python
      class JOJO_ERROR(Exception):
          pass
      #+end_src

***** error

      #+begin_src python
      def error():
          raise JOJO_ERROR()
      #+end_src

* vm

*** RP

    #+begin_src python
    class RP:
        def __init__(self, jojo):
            self.cursor = 0
            self.length = jojo.length
            self.body = jojo.body
            self.lr = jojo.lr.copy()
    #+end_src

*** VM

    #+begin_src python
    class VM:
        def __init__(self, ds, rs):
            self.ds = ds
            self.rs = rs

        def exe(self):
            return exe(self)
    #+end_src

