docs/jojo.html

<div id="outline-container-org7853c2d" class="outline-3">
<h3 id="org7853c2d">(+generator) &#x2013; python like generator and yield</h3>
<div class="outline-text-3" id="text-org7853c2d">
<ul class="org-ul">
<li><p>for scrapy</p></li>

<li><p>(+generator k1 1 give k1)</p><p>k1 next</p></li></ul>
</div>
</div>

<div id="outline-container-orgc259989" class="outline-3">
<h3 id="orgc259989">parse_sexp_vect &#x2013; error handling</h3>
<div class="outline-text-3" id="text-orgc259989">
<ul class="org-ul">
<li><p>to be able to use it in jojo</p></li></ul>
</div>
</div>

<div id="outline-container-orge542de4" class="outline-3">
<h3 id="orge542de4">inline module_debug_one_step and module_repl_one_step</h3>
<div class="outline-text-3" id="text-orge542de4">
<ul class="org-ul">
<li><p>to avoid the use of 'try &amp; except'</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org8f6e5a3" class="outline-2">
<h2 id="org8f6e5a3">prolog</h2>
<div class="outline-text-2" id="text-org8f6e5a3">
</div><div id="outline-container-orga0a4e86" class="outline-3">
<h3 id="orga0a4e86">import</h3>
<div class="outline-text-3" id="text-orga0a4e86">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">import</span> inspect
<span style="color: #f92672; font-weight: bold;">import</span> types
<span style="color: #f92672; font-weight: bold;">import</span> importlib
<span style="color: #f92672; font-weight: bold;">import</span> sys
<span style="color: #f92672; font-weight: bold;">import</span> os
<span style="color: #f92672; font-weight: bold;">import</span> itertools
<span style="color: #f92672; font-weight: bold;">import</span> collections
<span style="color: #f92672; font-weight: bold;">import</span> operator
<span style="color: #f92672; font-weight: bold;">import</span> traceback
<span style="color: #f92672; font-weight: bold;">import</span> pprint
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe14a71" class="outline-3">
<h3 id="orgbe14a71">utility</h3>
<div class="outline-text-3" id="text-orgbe14a71">
</div><div id="outline-container-org6f777b8" class="outline-4">
<h4 id="org6f777b8">get_signature</h4>
<div class="outline-text-4" id="text-org6f777b8">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">get_signature</span>(fun):
    <span style="color: #f92672; font-weight: bold;">try</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> inspect.signature(fun)
    <span style="color: #f92672; font-weight: bold;">except</span> <span style="color: #66d9ef; font-weight: bold;">ValueError</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">None</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1fe1ab1" class="outline-4">
<h4 id="org1fe1ab1">fun_p</h4>
<div class="outline-text-4" id="text-org1fe1ab1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">fun_p</span>(x):
    <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #a6e22e;">isinstance</span>(x, types.LambdaType) <span style="color: #f92672; font-weight: bold;">or</span>
        <span style="color: #a6e22e;">isinstance</span>(x, types.MethodType)):
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> (<span style="color: #a6e22e;">isinstance</span>(x, types.BuiltinFunctionType) <span style="color: #f92672; font-weight: bold;">or</span>
          <span style="color: #a6e22e;">isinstance</span>(x, types.BuiltinMethodType)):
        <span style="color: #f92672; font-weight: bold;">if</span> get_signature(x) == <span style="color: #ae81ff;">None</span>:
            <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
        <span style="color: #f92672; font-weight: bold;">else</span>:
            <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ac0248" class="outline-4">
<h4 id="org7ac0248">method_p</h4>
<div class="outline-text-4" id="text-org7ac0248">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">method_p</span>(x):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">isinstance</span>(x, types.MethodType):
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> <span style="color: #a6e22e;">isinstance</span>(x, types.BuiltinMethodType):
        <span style="color: #f92672; font-weight: bold;">if</span> get_signature(x) == <span style="color: #ae81ff;">None</span>:
            <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
        <span style="color: #f92672; font-weight: bold;">else</span>:
            <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad28fab" class="outline-4">
<h4 id="orgad28fab">class_p</h4>
<div class="outline-text-4" id="text-orgad28fab">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">class_p</span>(x):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> inspect.isclass(x):
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> x == <span style="color: #a6e22e;">type</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org975e629" class="outline-4">
<h4 id="org975e629">Vect</h4>
<div class="outline-text-4" id="text-org975e629">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fd971f;">Vect</span> = <span style="color: #a6e22e;">list</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5bd96c" class="outline-4">
<h4 id="orgb5bd96c">vect_p</h4>
<div class="outline-text-4" id="text-orgb5bd96c">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">vect_p</span>(x):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">type</span>(x) == Vect
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e5ac51" class="outline-4">
<h4 id="org8e5ac51">string_p</h4>
<div class="outline-text-4" id="text-org8e5ac51">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">string_p</span>(x):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">type</span>(x) == <span style="color: #a6e22e;">str</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org395a130" class="outline-4">
<h4 id="org395a130">fill_vect</h4>
<div class="outline-text-4" id="text-org395a130">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">fill_vect</span>(value, length):
    <span style="color: #fd971f;">vect</span> = []
    <span style="color: #fd971f;">i</span> = 0
    <span style="color: #f92672; font-weight: bold;">while</span> i &lt; length:
        vect.append(value)
        <span style="color: #fd971f;">i</span> = i + 1
    <span style="color: #f92672; font-weight: bold;">return</span> vect
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f89fd" class="outline-4">
<h4 id="org5f89fd">fill_tuple</h4>
<div class="outline-text-4" id="text-org5f89fd">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">fill_tuple</span>(value, length):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">tuple</span>(fill_vect(value, length))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9cc6e63" class="outline-3">
<h3 id="org9cc6e63">error handling</h3>
<div class="outline-text-3" id="text-org9cc6e63">
</div><div id="outline-container-org7c1a9a9" class="outline-4">
<h4 id="org7c1a9a9">JOJO_ERROR</h4>
<div class="outline-text-4" id="text-org7c1a9a9">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">JOJO_ERROR</span>(<span style="color: #66d9ef; font-weight: bold;">Exception</span>):
    <span style="color: #f92672; font-weight: bold;">pass</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b1460b" class="outline-4">
<h4 id="org6b1460b">error</h4>
<div class="outline-text-4" id="text-org6b1460b">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">error</span>():
    <span style="color: #f92672; font-weight: bold;">raise</span> JOJO_ERROR()
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org2f20edb" class="outline-2">
<h2 id="org2f20edb">vm</h2>
<div class="outline-text-2" id="text-org2f20edb">
</div><div id="outline-container-org92d1245" class="outline-3">
<h3 id="org92d1245">RP</h3>
<div class="outline-text-3" id="text-org92d1245">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">RP</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, jojo):
        <span style="color: #f92672; font-weight: bold;">self</span>.cursor = 0
        <span style="color: #f92672; font-weight: bold;">self</span>.length = jojo.length
        <span style="color: #f92672; font-weight: bold;">self</span>.body = jojo.body
        <span style="color: #f92672; font-weight: bold;">self</span>.lr = jojo.lr.copy()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf24d31a" class="outline-3">
<h3 id="orgf24d31a">VM</h3>
<div class="outline-text-3" id="text-orgf24d31a">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">VM</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, ds, rs):
        <span style="color: #f92672; font-weight: bold;">self</span>.ds = ds
        <span style="color: #f92672; font-weight: bold;">self</span>.rs = rs

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        <span style="color: #f92672; font-weight: bold;">return</span> exe(<span style="color: #f92672; font-weight: bold;">self</span>)
</pre>
</div>
</div>
</div>
