jojo/jojo.org
*** exe

    #+begin_src python
    def exe(vm):
        length = len(vm.rs)
        while len(vm.rs) >= length:
            exe_one_step(vm)
        return vm
    #+end_src

*** exe_one_step

    #+begin_src python
    def exe_one_step(vm):
        rp = vm.rs.pop()
        if rp.length == 0:
            return

        # get current jo
        jo = rp.body[rp.cursor]

        # handle tail call
        if rp.cursor >= rp.length - 1:
           pass
        else:
           rp.cursor = rp.cursor + 1
           vm.rs.append(rp)

        # dispatching
        exe_jo(jo, rp, vm)
    #+end_src

*** VALUES

    #+begin_src python
    class VALUES:
        def __init__(self, *values):
            self.values = values
    #+end_src

*** exe_jo

    #+begin_src python
    def exe_jo(jo, rp, vm):
        if fun_p(jo):
            exe_fun(jo, vm)
        elif hasattr(jo, "jo_exe"):
            jo.jo_exe(rp, vm)
        else:
            vm.ds.append(jo)
    #+end_src

*** exe_fun

***** [note] python funtion arguments

      - normal arguments are called positional arguments.

      - there are also keyword-only arguments,
        because after *args,
        the information about position will be lost.

      - before *args
        each positional arguments took one position
        do not respect default arguments

        - to respect default arguments
          one has to use (call)

      - if *args is used in a function signature
        pass it as a vect

      - if **kwargs is used in a function signature
        pass it as a dict

***** exe_fun

      #+begin_src python
      def exe_fun(fun, vm):
          signature = get_signature(fun)

          if signature == None:
              print("- exe_fun fail to get signature")
              print("  fun : {}".format(fun))
              error()

          parameters = signature.parameters

          if has_para_dict(parameters):
              arg_dict = get_default_arg_dict(parameters)
              top_of_ds = vm.ds.pop()
              if not isinstance(top_of_ds, dict):
                  print("- exe_fun fail")
                  print("  when fun require a arg_dict")
                  print("  the top of data stack is not a dict")
                  print("  fun : {}".format(fun))
                  print("  top of data stack : {}".format(top_of_ds))
                  error()
              arg_dict.update(top_of_ds)
          else:
              arg_dict = None

          if has_para_vect(parameters):
              top_of_ds = vm.ds.pop()
              if not vect_p(top_of_ds):
                  print("- exe_fun fail")
                  print("  when fun require a arg_vect")
                  print("  the top of data stack is not a vect")
                  print("  fun : {}".format(fun))
                  print("  top of data stack : {}".format(top_of_ds))
                  error()
              arg_vect = top_of_ds
          else:
              arg_vect = []

          positional_para_length = get_positional_para_length(parameters)
          args = []
          i = 0
          while i < positional_para_length:
              args.append(vm.ds.pop())
              i = i + 1
          args.reverse()
          args.extend(arg_vect)

          if arg_dict == None:
              result = fun(*args)
          else:
              result = fun(*args, **arg_dict)

          push_result_to_vm(result, vm)
      #+end_src

***** push_result_to_vm

      #+begin_src python
      def push_result_to_vm(result, vm):
          if type(result) == VALUES:
              vm.ds.extend(result.values)
          elif result == None:
              return
          else:
              vm.ds.append(result)
      #+end_src

***** get_positional_para_length

      #+begin_src python
      def get_positional_para_length(parameters):
          n = 0
          for v in parameters.values():
              if (v.kind == inspect.Parameter.POSITIONAL_ONLY or
                  v.kind == inspect.Parameter.POSITIONAL_OR_KEYWORD):
                  n = n + 1
          return n
      #+end_src

***** has_para_vect

      #+begin_src python
      def has_para_vect(parameters):
          for v in parameters.values():
              if (v.kind == inspect.Parameter.VAR_POSITIONAL):
                  return True
          return False
      #+end_src

