docs/jojo.html

<div id="outline-container-orgfc6e0e" class="outline-3">
<h3 id="orgfc6e0e">exe</h3>
<div class="outline-text-3" id="text-orgfc6e0e">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">exe</span>(vm):
    <span style="color: #fd971f;">length</span> = <span style="color: #a6e22e;">len</span>(vm.rs)
    <span style="color: #f92672; font-weight: bold;">while</span> <span style="color: #a6e22e;">len</span>(vm.rs) &gt;= length:
        exe_one_step(vm)
    <span style="color: #f92672; font-weight: bold;">return</span> vm
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f133b1" class="outline-3">
<h3 id="org4f133b1">exe_one_step</h3>
<div class="outline-text-3" id="text-org4f133b1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">exe_one_step</span>(vm):
    <span style="color: #fd971f;">rp</span> = vm.rs.pop()
    <span style="color: #f92672; font-weight: bold;">if</span> rp.length == 0:
        <span style="color: #f92672; font-weight: bold;">return</span>

    <span style="color: #FF8888;"># </span><span style="color: #FF8888;">get current jo</span>
    <span style="color: #fd971f;">jo</span> = rp.body[rp.cursor]

    <span style="color: #FF8888;"># </span><span style="color: #FF8888;">handle tail call</span>
    <span style="color: #f92672; font-weight: bold;">if</span> rp.cursor &gt;= rp.length - 1:
       <span style="color: #f92672; font-weight: bold;">pass</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
       <span style="color: #fd971f;">rp.cursor</span> = rp.cursor + 1
       vm.rs.append(rp)

    <span style="color: #FF8888;"># </span><span style="color: #FF8888;">dispatching</span>
    exe_jo(jo, rp, vm)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb1290a1" class="outline-3">
<h3 id="orgb1290a1">VALUES</h3>
<div class="outline-text-3" id="text-orgb1290a1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">VALUES</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, *values):
        <span style="color: #f92672; font-weight: bold;">self</span>.values = values
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf6669ab" class="outline-3">
<h3 id="orgf6669ab">exe_jo</h3>
<div class="outline-text-3" id="text-orgf6669ab">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">exe_jo</span>(jo, rp, vm):
    <span style="color: #f92672; font-weight: bold;">if</span> fun_p(jo):
        exe_fun(jo, vm)
    <span style="color: #f92672; font-weight: bold;">elif</span> <span style="color: #a6e22e;">hasattr</span>(jo, <span style="color: #e6db74;">"jo_exe"</span>):
        jo.jo_exe(rp, vm)
    <span style="color: #f92672; font-weight: bold;">else</span>:
        vm.ds.append(jo)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae2eb82" class="outline-3">
<h3 id="orgae2eb82">exe_fun</h3>
<div class="outline-text-3" id="text-orgae2eb82">
</div><div id="outline-container-orgea93bd3" class="outline-4">
<h4 id="orgea93bd3"><span class="todo _note_">[note]</span> python funtion arguments</h4>
<div class="outline-text-4" id="text-orgea93bd3">
<ul class="org-ul">
<li><p>normal arguments are called positional arguments.</p></li>

<li><p>there are also keyword-only arguments,</p><p>because after *args,</p><p>the information about position will be lost.</p></li>

<li><p>before *args</p><p>each positional arguments took one position</p><p>do not respect default arguments</p><p></p><p><ul class="org-ul"></p><p><li><p>to respect default arguments</p><p>one has to use (call)</p></li></ul></p></li>

<li><p>if *args is used in a function signature</p><p>pass it as a vect</p></li>

<li><p>if **kwargs is used in a function signature</p><p>pass it as a dict</p></li></ul>
</div>
</div>

<div id="outline-container-orge4df074" class="outline-4">
<h4 id="orge4df074">exe_fun</h4>
<div class="outline-text-4" id="text-orge4df074">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">exe_fun</span>(fun, vm):
    <span style="color: #fd971f;">signature</span> = get_signature(fun)

    <span style="color: #f92672; font-weight: bold;">if</span> signature == <span style="color: #ae81ff;">None</span>:
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- exe_fun fail to get signature"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  fun : {}"</span>.<span style="color: #a6e22e;">format</span>(fun))
        error()

    <span style="color: #fd971f;">parameters</span> = signature.parameters

    <span style="color: #f92672; font-weight: bold;">if</span> has_para_dict(parameters):
        <span style="color: #fd971f;">arg_dict</span> = get_default_arg_dict(parameters)
        <span style="color: #fd971f;">top_of_ds</span> = vm.ds.pop()
        <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> <span style="color: #a6e22e;">isinstance</span>(top_of_ds, <span style="color: #a6e22e;">dict</span>):
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- exe_fun fail"</span>)
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  when fun require a arg_dict"</span>)
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  the top of data stack is not a dict"</span>)
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  fun : {}"</span>.<span style="color: #a6e22e;">format</span>(fun))
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  top of data stack : {}"</span>.<span style="color: #a6e22e;">format</span>(top_of_ds))
            error()
        arg_dict.update(top_of_ds)
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #fd971f;">arg_dict</span> = <span style="color: #ae81ff;">None</span>

    <span style="color: #f92672; font-weight: bold;">if</span> has_para_vect(parameters):
        <span style="color: #fd971f;">top_of_ds</span> = vm.ds.pop()
        <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> vect_p(top_of_ds):
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- exe_fun fail"</span>)
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  when fun require a arg_vect"</span>)
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  the top of data stack is not a vect"</span>)
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  fun : {}"</span>.<span style="color: #a6e22e;">format</span>(fun))
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  top of data stack : {}"</span>.<span style="color: #a6e22e;">format</span>(top_of_ds))
            error()
        <span style="color: #fd971f;">arg_vect</span> = top_of_ds
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #fd971f;">arg_vect</span> = []

    <span style="color: #fd971f;">positional_para_length</span> = get_positional_para_length(parameters)
    <span style="color: #fd971f;">args</span> = []
    <span style="color: #fd971f;">i</span> = 0
    <span style="color: #f92672; font-weight: bold;">while</span> i &lt; positional_para_length:
        args.append(vm.ds.pop())
        <span style="color: #fd971f;">i</span> = i + 1
    args.reverse()
    args.extend(arg_vect)

    <span style="color: #f92672; font-weight: bold;">if</span> arg_dict == <span style="color: #ae81ff;">None</span>:
        <span style="color: #fd971f;">result</span> = fun(*args)
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #fd971f;">result</span> = fun(*args, **arg_dict)

    push_result_to_vm(result, vm)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1cc3524" class="outline-4">
<h4 id="org1cc3524">push_result_to_vm</h4>
<div class="outline-text-4" id="text-org1cc3524">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">push_result_to_vm</span>(result, vm):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">type</span>(result) == VALUES:
        vm.ds.extend(result.values)
    <span style="color: #f92672; font-weight: bold;">elif</span> result == <span style="color: #ae81ff;">None</span>:
        <span style="color: #f92672; font-weight: bold;">return</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
        vm.ds.append(result)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d1664f" class="outline-4">
<h4 id="org2d1664f">get_positional_para_length</h4>
<div class="outline-text-4" id="text-org2d1664f">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">get_positional_para_length</span>(parameters):
    <span style="color: #fd971f;">n</span> = 0
    <span style="color: #f92672; font-weight: bold;">for</span> v <span style="color: #f92672; font-weight: bold;">in</span> parameters.values():
        <span style="color: #f92672; font-weight: bold;">if</span> (v.kind == inspect.Parameter.POSITIONAL_ONLY <span style="color: #f92672; font-weight: bold;">or</span>
            v.kind == inspect.Parameter.POSITIONAL_OR_KEYWORD):
            <span style="color: #fd971f;">n</span> = n + 1
    <span style="color: #f92672; font-weight: bold;">return</span> n
</pre>
</div>
</div>
</div>

<div id="outline-container-org8300e93" class="outline-4">
<h4 id="org8300e93">has_para_vect</h4>
<div class="outline-text-4" id="text-org8300e93">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">has_para_vect</span>(parameters):
    <span style="color: #f92672; font-weight: bold;">for</span> v <span style="color: #f92672; font-weight: bold;">in</span> parameters.values():
        <span style="color: #f92672; font-weight: bold;">if</span> (v.kind == inspect.Parameter.VAR_POSITIONAL):
            <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
</pre>
</div>
</div>
</div>
