jojo/jojo.org
***** has_para_dict

      #+begin_src python
      def has_para_dict(parameters):
          for v in parameters.values():
              if (v.kind == inspect.Parameter.KEYWORD_ONLY or
                  v.kind == inspect.Parameter.VAR_KEYWORD):
                  return True
          return False
      #+end_src

***** get_default_arg_dict

      #+begin_src python
      def get_default_arg_dict(parameters):
          default_dict = {}
          for v in parameters.values():
              if (v.kind == inspect.Parameter.KEYWORD_ONLY and
                  v.default != inspect.Parameter.empty):
                  default_dict[v.name] = v.default
          return default_dict
      #+end_src

***** get_positional_default_arg_dict

      #+begin_src python
      def get_positional_default_arg_dict(parameters):
          default_dict = {}
          for v in parameters.values():
              if ((v.kind == inspect.Parameter.POSITIONAL_ONLY or
                   v.kind == inspect.Parameter.POSITIONAL_OR_KEYWORD)
                  and v.default != inspect.Parameter.empty):
                  default_dict[v.name] = v.default
          return default_dict
      #+end_src

*** jo

***** JOJO

      #+begin_src python
      class JOJO:
          def __init__(self, body):
              self.length = len(body)
              self.body = Vect(body)
              self.lr = {}

          def jo_exe(self, rp, vm):
              vm.rs.append(RP(self))
      #+end_src

***** CLO

      #+begin_src python
      class CLO:
          def __init__(self, jojo):
              self.jojo = jojo

          def jo_exe(self, rp, vm):
              new_jojo = JOJO(self.jojo)
              new_jojo.lr = rp.lr
              vm.ds.append(new_jojo)

          def jo_print(self):
              p_print("(clo ")
              for jo in self.jojo[:-1]:
                  jo_print(jo)
                  space()
              jo_print(self.jojo[-1])
              p_print(")")
      #+end_src

***** APPLY

      #+begin_src python
      class APPLY:
          @classmethod
          def jo_exe(self, rp, vm):
              clo = vm.ds.pop()
              clo.jo_exe(rp, vm)

          def jo_print(self):
              p_print("apply")
      #+end_src

***** IFTE

      #+begin_src python
      class IFTE:
          @classmethod
          def jo_exe(self, rp, vm):
              clo2 = vm.ds.pop()
              clo1 = vm.ds.pop()
              test = vm.ds.pop()
              if test:
                  vm.rs.append(RP(clo1))
              else:
                  vm.rs.append(RP(clo2))

          def jo_print(self):
              p_print("ifte")
      #+end_src

***** CALL_FROM_MODULE

      #+begin_src python
      class CALL_FROM_MODULE:
          def __init__(self, module, name):
              self.module = module
              self.name = name

          def jo_exe(self, rp, vm):
              jo = getattr(self.module, self.name)
              exe_jo(jo, rp, vm)

          def jo_print(self):
              # p_print("(call {} from {})".format(self.name, self.module.__name__))
              p_print(self.name)
      #+end_src

***** GET

      #+begin_src python
      class GET:
          def __init__(self, name):
              self.name = name

          def jo_exe(self, rp, vm):
              jo = rp.lr[self.name]
              exe_jo(jo, rp, vm)

          def jo_print(self):
              p_print(self.name)
      #+end_src

***** SET

      #+begin_src python
      class SET:
          def __init__(self, name):
              self.name = name

          def jo_exe(self, rp, vm):
              value = vm.ds.pop()
              rp.lr[self.name] = value

          def jo_print(self):
              p_print(self.name)
              p_print('!')
      #+end_src

