docs/jojo.html

<div id="outline-container-org6d474ad" class="outline-4">
<h4 id="org6d474ad">has_para_dict</h4>
<div class="outline-text-4" id="text-org6d474ad">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">has_para_dict</span>(parameters):
    <span style="color: #f92672; font-weight: bold;">for</span> v <span style="color: #f92672; font-weight: bold;">in</span> parameters.values():
        <span style="color: #f92672; font-weight: bold;">if</span> (v.kind == inspect.Parameter.KEYWORD_ONLY <span style="color: #f92672; font-weight: bold;">or</span>
            v.kind == inspect.Parameter.VAR_KEYWORD):
            <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc505823" class="outline-4">
<h4 id="orgc505823">get_default_arg_dict</h4>
<div class="outline-text-4" id="text-orgc505823">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">get_default_arg_dict</span>(parameters):
    <span style="color: #fd971f;">default_dict</span> = {}
    <span style="color: #f92672; font-weight: bold;">for</span> v <span style="color: #f92672; font-weight: bold;">in</span> parameters.values():
        <span style="color: #f92672; font-weight: bold;">if</span> (v.kind == inspect.Parameter.KEYWORD_ONLY <span style="color: #f92672; font-weight: bold;">and</span>
            v.default != inspect.Parameter.empty):
            <span style="color: #fd971f;">default_dict</span>[v.name] = v.default
    <span style="color: #f92672; font-weight: bold;">return</span> default_dict
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3d0716" class="outline-4">
<h4 id="orgf3d0716">get_positional_default_arg_dict</h4>
<div class="outline-text-4" id="text-orgf3d0716">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">get_positional_default_arg_dict</span>(parameters):
    <span style="color: #fd971f;">default_dict</span> = {}
    <span style="color: #f92672; font-weight: bold;">for</span> v <span style="color: #f92672; font-weight: bold;">in</span> parameters.values():
        <span style="color: #f92672; font-weight: bold;">if</span> ((v.kind == inspect.Parameter.POSITIONAL_ONLY <span style="color: #f92672; font-weight: bold;">or</span>
             v.kind == inspect.Parameter.POSITIONAL_OR_KEYWORD)
            <span style="color: #f92672; font-weight: bold;">and</span> v.default != inspect.Parameter.empty):
            <span style="color: #fd971f;">default_dict</span>[v.name] = v.default
    <span style="color: #f92672; font-weight: bold;">return</span> default_dict
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd10af75" class="outline-3">
<h3 id="orgd10af75">jo</h3>
<div class="outline-text-3" id="text-orgd10af75">
</div><div id="outline-container-orgfa1c9c2" class="outline-4">
<h4 id="orgfa1c9c2">JOJO</h4>
<div class="outline-text-4" id="text-orgfa1c9c2">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">JOJO</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, body):
        <span style="color: #f92672; font-weight: bold;">self</span>.length = <span style="color: #a6e22e;">len</span>(body)
        <span style="color: #f92672; font-weight: bold;">self</span>.body = Vect(body)
        <span style="color: #f92672; font-weight: bold;">self</span>.lr = {}

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        vm.rs.append(RP(<span style="color: #f92672; font-weight: bold;">self</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfbb1ad7" class="outline-4">
<h4 id="orgfbb1ad7">CLO</h4>
<div class="outline-text-4" id="text-orgfbb1ad7">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">CLO</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, jojo):
        <span style="color: #f92672; font-weight: bold;">self</span>.jojo = jojo

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">new_jojo</span> = JOJO(<span style="color: #f92672; font-weight: bold;">self</span>.jojo)
        <span style="color: #fd971f;">new_jojo.lr</span> = rp.lr
        vm.ds.append(new_jojo)

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #e6db74;">"(clo "</span>)
        <span style="color: #f92672; font-weight: bold;">for</span> jo <span style="color: #f92672; font-weight: bold;">in</span> <span style="color: #f92672; font-weight: bold;">self</span>.jojo[:-1]:
            jo_print(jo)
            space()
        jo_print(<span style="color: #f92672; font-weight: bold;">self</span>.jojo[-1])
        p_print(<span style="color: #e6db74;">")"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a07464" class="outline-4">
<h4 id="org5a07464">APPLY</h4>
<div class="outline-text-4" id="text-org5a07464">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">APPLY</span>:
    <span style="color: #66d9ef; font-weight: bold;">@classmethod</span>
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">clo</span> = vm.ds.pop()
        clo.jo_exe(rp, vm)

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #e6db74;">"apply"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgacc93fe" class="outline-4">
<h4 id="orgacc93fe">IFTE</h4>
<div class="outline-text-4" id="text-orgacc93fe">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">IFTE</span>:
    <span style="color: #66d9ef; font-weight: bold;">@classmethod</span>
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">clo2</span> = vm.ds.pop()
        <span style="color: #fd971f;">clo1</span> = vm.ds.pop()
        <span style="color: #fd971f;">test</span> = vm.ds.pop()
        <span style="color: #f92672; font-weight: bold;">if</span> test:
            vm.rs.append(RP(clo1))
        <span style="color: #f92672; font-weight: bold;">else</span>:
            vm.rs.append(RP(clo2))

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #e6db74;">"ifte"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org17cbd7c" class="outline-4">
<h4 id="org17cbd7c">CALL_FROM_MODULE</h4>
<div class="outline-text-4" id="text-org17cbd7c">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">CALL_FROM_MODULE</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, module, name):
        <span style="color: #f92672; font-weight: bold;">self</span>.module = module
        <span style="color: #f92672; font-weight: bold;">self</span>.name = name

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">jo</span> = <span style="color: #a6e22e;">getattr</span>(<span style="color: #f92672; font-weight: bold;">self</span>.module, <span style="color: #f92672; font-weight: bold;">self</span>.name)
        exe_jo(jo, rp, vm)

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        <span style="color: #FF8888;"># </span><span style="color: #FF8888;">p_print("(call {} from {})".format(self.name, self.module.__name__))</span>
        p_print(<span style="color: #f92672; font-weight: bold;">self</span>.name)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc748437" class="outline-4">
<h4 id="orgc748437">GET</h4>
<div class="outline-text-4" id="text-orgc748437">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">GET</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, name):
        <span style="color: #f92672; font-weight: bold;">self</span>.name = name

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">jo</span> = rp.lr[<span style="color: #f92672; font-weight: bold;">self</span>.name]
        exe_jo(jo, rp, vm)

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #f92672; font-weight: bold;">self</span>.name)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d3b45" class="outline-4">
<h4 id="org7d3b45">SET</h4>
<div class="outline-text-4" id="text-org7d3b45">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">SET</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, name):
        <span style="color: #f92672; font-weight: bold;">self</span>.name = name

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">value</span> = vm.ds.pop()
        <span style="color: #fd971f;">rp.lr</span>[<span style="color: #f92672; font-weight: bold;">self</span>.name] = value

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #f92672; font-weight: bold;">self</span>.name)
        p_print(<span style="color: #e6db74;">'!'</span>)
</pre>
</div>
</div>
</div>
