jojo/jojo.org
***** MARK -- for collectors

      #+begin_src python
      class MARK:
          @classmethod
          def jo_exe(self, rp, vm):
              vm.ds.append(self)

          def jo_print(self):
              p_print("mark")
      #+end_src

***** COLLECT_VECT -- collect values before mark to vect

      #+begin_src python
      class COLLECT_VECT:
          @classmethod
          def jo_exe(self, rp, vm):
              vect = []
              while True:
                  value = vm.ds.pop()
                  if value == MARK:
                      break
                  else:
                      vect.append(value)
              vect.reverse()
              vm.ds.append(vect)

          def jo_print(self):
              p_print("collect-vect")
      #+end_src

***** VECT_SPREAD -- spread values to data stack

      #+begin_src python
      class VECT_SPREAD:
          @classmethod
          def jo_exe(self, rp, vm):
              vect = vm.ds.pop()
              for value in vect:
                  vm.ds.append(value)

          def jo_print(self):
              p_print("vect-spread")
      #+end_src

***** COLLECT_LIST -- collect values before mark to list

      #+begin_src python
      class COLLECT_LIST:
          @classmethod
          def jo_exe(self, rp, vm):
              def recur(rest):
                  value = vm.ds.pop()
                  if value == MARK:
                      return rest
                  else:
                      return recur(cons(value, rest))
              vm.ds.append(recur(null))

          def jo_print(self):
              p_print("collect-list")
      #+end_src

***** LIST_SPREAD -- spread values to data stack

      #+begin_src python
      class LIST_SPREAD:
          @classmethod
          def jo_exe(self, rp, vm):
              def recur(l):
                  if null_p(l):
                      pass
                  else:
                      vm.ds.append(car(l))
                      recur(cdr(l))
              recur(vm.ds.pop())

          def jo_print(self):
              p_print("list-spread")
      #+end_src

***** DATA_PRED -- for data predicate

      #+begin_src python
      class DATA_PRED:
          def __init__(self, data_class):
              self.data_class = data_class

          def jo_exe(self, rp, vm):
              x = vm.ds.pop()
              vm.ds.append(type(x) == self.data_class)

          def jo_print(self):
              p_print(data_class.__name__)
              p_print('?')
      #+end_src

***** NEW -- create object from data and class

      #+begin_src python
      class NEW:
          @classmethod
          def jo_exe(self, rp, vm):
              x = vm.ds.pop()
              if not class_p(x):
                  print("- NEW.jo_exe fail")
                  print("  argument is not a class : {}".format(x))
                  error()
              else:
                  exe_fun(x, vm)

          def jo_print(self):
              p_print("new")
      #+end_src

***** MSG -- message to object

      #+begin_src python
      class MSG:
          def __init__(self, message):
              self.message = message

          def jo_exe(self, rp, vm):
              o = vm.ds.pop()
              v = getattr(o, self.message)
              if method_p(v):
                  exe_fun(v, vm)
              else:
                  exe_jo(v, rp, vm)

          def jo_print(self):
              p_print(".")
              p_print(self.message)
      #+end_src

