docs/jojo.html

<div id="outline-container-org5b5b759" class="outline-4">
<h4 id="org5b5b759">MARK &#x2013; for collectors</h4>
<div class="outline-text-4" id="text-org5b5b759">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">MARK</span>:
    <span style="color: #66d9ef; font-weight: bold;">@classmethod</span>
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        vm.ds.append(<span style="color: #f92672; font-weight: bold;">self</span>)

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #e6db74;">"mark"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org823f246" class="outline-4">
<h4 id="org823f246">COLLECT_VECT &#x2013; collect values before mark to vect</h4>
<div class="outline-text-4" id="text-org823f246">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">COLLECT_VECT</span>:
    <span style="color: #66d9ef; font-weight: bold;">@classmethod</span>
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">vect</span> = []
        <span style="color: #f92672; font-weight: bold;">while</span> <span style="color: #ae81ff;">True</span>:
            <span style="color: #fd971f;">value</span> = vm.ds.pop()
            <span style="color: #f92672; font-weight: bold;">if</span> value == MARK:
                <span style="color: #f92672; font-weight: bold;">break</span>
            <span style="color: #f92672; font-weight: bold;">else</span>:
                vect.append(value)
        vect.reverse()
        vm.ds.append(vect)

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #e6db74;">"collect-vect"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge50bc8b" class="outline-4">
<h4 id="orge50bc8b">VECT_SPREAD &#x2013; spread values to data stack</h4>
<div class="outline-text-4" id="text-orge50bc8b">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">VECT_SPREAD</span>:
    <span style="color: #66d9ef; font-weight: bold;">@classmethod</span>
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">vect</span> = vm.ds.pop()
        <span style="color: #f92672; font-weight: bold;">for</span> value <span style="color: #f92672; font-weight: bold;">in</span> vect:
            vm.ds.append(value)

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #e6db74;">"vect-spread"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f769af" class="outline-4">
<h4 id="org1f769af">COLLECT_LIST &#x2013; collect values before mark to list</h4>
<div class="outline-text-4" id="text-org1f769af">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">COLLECT_LIST</span>:
    <span style="color: #66d9ef; font-weight: bold;">@classmethod</span>
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">recur</span>(rest):
            <span style="color: #fd971f;">value</span> = vm.ds.pop()
            <span style="color: #f92672; font-weight: bold;">if</span> value == MARK:
                <span style="color: #f92672; font-weight: bold;">return</span> rest
            <span style="color: #f92672; font-weight: bold;">else</span>:
                <span style="color: #f92672; font-weight: bold;">return</span> recur(cons(value, rest))
        vm.ds.append(recur(null))

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #e6db74;">"collect-list"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6afb860" class="outline-4">
<h4 id="org6afb860">LIST_SPREAD &#x2013; spread values to data stack</h4>
<div class="outline-text-4" id="text-org6afb860">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">LIST_SPREAD</span>:
    <span style="color: #66d9ef; font-weight: bold;">@classmethod</span>
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">recur</span>(l):
            <span style="color: #f92672; font-weight: bold;">if</span> null_p(l):
                <span style="color: #f92672; font-weight: bold;">pass</span>
            <span style="color: #f92672; font-weight: bold;">else</span>:
                vm.ds.append(car(l))
                recur(cdr(l))
        recur(vm.ds.pop())

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #e6db74;">"list-spread"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7663cd" class="outline-4">
<h4 id="org7663cd">DATA_PRED &#x2013; for data predicate</h4>
<div class="outline-text-4" id="text-org7663cd">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">DATA_PRED</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, data_class):
        <span style="color: #f92672; font-weight: bold;">self</span>.data_class = data_class

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">x</span> = vm.ds.pop()
        vm.ds.append(<span style="color: #a6e22e;">type</span>(x) == <span style="color: #f92672; font-weight: bold;">self</span>.data_class)

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(data_class.<span style="color: #a6e22e;">__name__</span>)
        p_print(<span style="color: #e6db74;">'?'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ebc65f" class="outline-4">
<h4 id="org6ebc65f">NEW &#x2013; create object from data and class</h4>
<div class="outline-text-4" id="text-org6ebc65f">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">NEW</span>:
    <span style="color: #66d9ef; font-weight: bold;">@classmethod</span>
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">x</span> = vm.ds.pop()
        <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> class_p(x):
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- NEW.jo_exe fail"</span>)
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  argument is not a class : {}"</span>.<span style="color: #a6e22e;">format</span>(x))
            error()
        <span style="color: #f92672; font-weight: bold;">else</span>:
            exe_fun(x, vm)

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #e6db74;">"new"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7c9620f" class="outline-4">
<h4 id="org7c9620f">MSG &#x2013; message to object</h4>
<div class="outline-text-4" id="text-org7c9620f">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">MSG</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, message):
        <span style="color: #f92672; font-weight: bold;">self</span>.message = message

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">o</span> = vm.ds.pop()
        <span style="color: #fd971f;">v</span> = <span style="color: #a6e22e;">getattr</span>(o, <span style="color: #f92672; font-weight: bold;">self</span>.message)
        <span style="color: #f92672; font-weight: bold;">if</span> method_p(v):
            exe_fun(v, vm)
        <span style="color: #f92672; font-weight: bold;">else</span>:
            exe_jo(v, rp, vm)

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #e6db74;">"."</span>)
        p_print(<span style="color: #f92672; font-weight: bold;">self</span>.message)
</pre>
</div>
</div>
</div>
