jojo/jojo.org
***** SET_FIELD

       #+begin_src python
       class SET_FIELD:
           def __init__(self, field_name):
               self.field_name = field_name

           def jo_exe(self, rp, vm):
               o = vm.ds.pop()
               v = vm.ds.pop()
               setattr(o, self.field_name, v)

           def jo_print(self):
               p_print(".")
               p_print(self.field_name)
               p_print("!")
       #+end_src

***** GENE

      #+begin_src python
      class GENE:
          def __init__(self, arity, default_jojo):
              self.arity = arity
              self.default_jojo = default_jojo
              self.disp_dict = {}

          def jo_exe(self, rp, vm):
              value_vect = vm.ds[(- self.arity):]
              type_vect = []
              for value in value_vect:
                  type_vect.append(type(value))

              type_tuple = tuple(type_vect)
              if type_tuple in self.disp_dict:
                  jojo = self.disp_dict[type_tuple]
                  jojo.jo_exe(rp, vm)
              else:
                  self.default_jojo.jo_exe(rp, vm)
      #+end_src

***** CLEAR

      #+begin_src python
      class CLEAR:
          @classmethod
          def jo_exe(self, rp, vm):
              vm.ds = []

          def jo_print(self):
              p_print("clear")
      #+end_src

***** PRIMITIVE

      #+begin_src python
      class PRIMITIVE:
          def __init__(self, fun):
              self.fun = fun

          def jo_exe(self, rp, vm):
              vm.ds.append(self.fun)

          def jo_print(self):
              p_print(self.fun)
      #+end_src

* sexp -- string expression

*** scan -- lexer for sexp

***** code_scan

      #+begin_src python
      def code_scan(string):
          string_vect = []
          i = 0
          length = len(string)
          while i < length:
              char = string[i]

              if space_p(char):
                  i = i + 1

              elif delimiter_p(char):
                  string_vect.append(char)
                  i = i + 1

              elif doublequote_p(char):
                  doublequote_end_index = string.find('"', i+1)
                  if doublequote_end_index == -1:
                      print("- code_scan (fail")
                      print("  doublequote mismatch")
                      print("  string : {}".format(string))
                      error()
                  end = doublequote_end_index + 1
                  string_vect.append(string[i:end])
                  i = end

              else:
                  end = find_end(string, i+1)
                  string_vect.append(string[i:end])
                  i = end

          return string_vect
      #+end_src

***** find_end

      #+begin_src python
      def find_end(string, begin):
          length = len(string)
          i = begin
          while True:
             if i == length:
                 return i
             char = string[i]
             if (space_p(char) or
                 delimiter_p(char) or
                 doublequote_p(char)):
                 return i
             i = i + 1
      #+end_src

***** space_p

      #+begin_src python
      def space_p(char):
          return char.isspace()
      #+end_src

***** delimiter_p

      #+begin_src python
      def delimiter_p(char):
          return (char == '(' or
                  char == ')' or
                  char == '[' or
                  char == ']' or
                  char == '{' or
                  char == '}' or
                  char == ',' or
                  char == '`' or
                  char == "'")
      #+end_src

***** doublequote_p

      #+begin_src python
      def doublequote_p(char):
          return char == '"'
      #+end_src

*** null & cons

***** Null

      #+begin_src python
      class Null:
          pass
      #+end_src

***** null

      #+begin_src python
      null = Null()
      #+end_src

***** null_p

      #+begin_src python
      def null_p(x):
          return x == null
      #+end_src

