docs/jojo.html

<div id="outline-container-org2ca157c" class="outline-4">
<h4 id="org2ca157c">SET_FIELD</h4>
<div class="outline-text-4" id="text-org2ca157c">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">SET_FIELD</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, field_name):
        <span style="color: #f92672; font-weight: bold;">self</span>.field_name = field_name

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">o</span> = vm.ds.pop()
        <span style="color: #fd971f;">v</span> = vm.ds.pop()
        <span style="color: #a6e22e;">setattr</span>(o, <span style="color: #f92672; font-weight: bold;">self</span>.field_name, v)

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #e6db74;">"."</span>)
        p_print(<span style="color: #f92672; font-weight: bold;">self</span>.field_name)
        p_print(<span style="color: #e6db74;">"!"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8837b74" class="outline-4">
<h4 id="org8837b74">GENE</h4>
<div class="outline-text-4" id="text-org8837b74">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">GENE</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, arity, default_jojo):
        <span style="color: #f92672; font-weight: bold;">self</span>.arity = arity
        <span style="color: #f92672; font-weight: bold;">self</span>.default_jojo = default_jojo
        <span style="color: #f92672; font-weight: bold;">self</span>.disp_dict = {}

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">value_vect</span> = vm.ds[(- <span style="color: #f92672; font-weight: bold;">self</span>.arity):]
        <span style="color: #fd971f;">type_vect</span> = []
        <span style="color: #f92672; font-weight: bold;">for</span> value <span style="color: #f92672; font-weight: bold;">in</span> value_vect:
            type_vect.append(<span style="color: #a6e22e;">type</span>(value))

        <span style="color: #fd971f;">type_tuple</span> = <span style="color: #a6e22e;">tuple</span>(type_vect)
        <span style="color: #f92672; font-weight: bold;">if</span> type_tuple <span style="color: #f92672; font-weight: bold;">in</span> <span style="color: #f92672; font-weight: bold;">self</span>.disp_dict:
            <span style="color: #fd971f;">jojo</span> = <span style="color: #f92672; font-weight: bold;">self</span>.disp_dict[type_tuple]
            jojo.jo_exe(rp, vm)
        <span style="color: #f92672; font-weight: bold;">else</span>:
            <span style="color: #f92672; font-weight: bold;">self</span>.default_jojo.jo_exe(rp, vm)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ba838d" class="outline-4">
<h4 id="org7ba838d">CLEAR</h4>
<div class="outline-text-4" id="text-org7ba838d">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">CLEAR</span>:
    <span style="color: #66d9ef; font-weight: bold;">@classmethod</span>
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        <span style="color: #fd971f;">vm.ds</span> = []

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #e6db74;">"clear"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8685add" class="outline-4">
<h4 id="org8685add">PRIMITIVE</h4>
<div class="outline-text-4" id="text-org8685add">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">PRIMITIVE</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, fun):
        <span style="color: #f92672; font-weight: bold;">self</span>.fun = fun

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_exe</span>(<span style="color: #f92672; font-weight: bold;">self</span>, rp, vm):
        vm.ds.append(<span style="color: #f92672; font-weight: bold;">self</span>.fun)

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        p_print(<span style="color: #f92672; font-weight: bold;">self</span>.fun)
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org398421b" class="outline-2">
<h2 id="org398421b">sexp &#x2013; string expression</h2>
<div class="outline-text-2" id="text-org398421b">
</div><div id="outline-container-orgf0f4a9d" class="outline-3">
<h3 id="orgf0f4a9d">scan &#x2013; lexer for sexp</h3>
<div class="outline-text-3" id="text-orgf0f4a9d">
</div><div id="outline-container-orgefe583c" class="outline-4">
<h4 id="orgefe583c">code_scan</h4>
<div class="outline-text-4" id="text-orgefe583c">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">code_scan</span>(string):
    <span style="color: #fd971f;">string_vect</span> = []
    <span style="color: #fd971f;">i</span> = 0
    <span style="color: #fd971f;">length</span> = <span style="color: #a6e22e;">len</span>(string)
    <span style="color: #f92672; font-weight: bold;">while</span> i &lt; length:
        <span style="color: #fd971f;">char</span> = string[i]

        <span style="color: #f92672; font-weight: bold;">if</span> space_p(char):
            <span style="color: #fd971f;">i</span> = i + 1

        <span style="color: #f92672; font-weight: bold;">elif</span> delimiter_p(char):
            string_vect.append(char)
            <span style="color: #fd971f;">i</span> = i + 1

        <span style="color: #f92672; font-weight: bold;">elif</span> doublequote_p(char):
            <span style="color: #fd971f;">doublequote_end_index</span> = string.find(<span style="color: #e6db74;">'"'</span>, i+1)
            <span style="color: #f92672; font-weight: bold;">if</span> doublequote_end_index == -1:
                <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- code_scan (fail"</span>)
                <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  doublequote mismatch"</span>)
                <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  string : {}"</span>.<span style="color: #a6e22e;">format</span>(string))
                error()
            <span style="color: #fd971f;">end</span> = doublequote_end_index + 1
            string_vect.append(string[i:end])
            <span style="color: #fd971f;">i</span> = end

        <span style="color: #f92672; font-weight: bold;">else</span>:
            <span style="color: #fd971f;">end</span> = find_end(string, i+1)
            string_vect.append(string[i:end])
            <span style="color: #fd971f;">i</span> = end

    <span style="color: #f92672; font-weight: bold;">return</span> string_vect
</pre>
</div>
</div>
</div>

<div id="outline-container-org772840e" class="outline-4">
<h4 id="org772840e">find_end</h4>
<div class="outline-text-4" id="text-org772840e">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">find_end</span>(string, begin):
    <span style="color: #fd971f;">length</span> = <span style="color: #a6e22e;">len</span>(string)
    <span style="color: #fd971f;">i</span> = begin
    <span style="color: #f92672; font-weight: bold;">while</span> <span style="color: #ae81ff;">True</span>:
       <span style="color: #f92672; font-weight: bold;">if</span> i == length:
           <span style="color: #f92672; font-weight: bold;">return</span> i
       <span style="color: #fd971f;">char</span> = string[i]
       <span style="color: #f92672; font-weight: bold;">if</span> (space_p(char) <span style="color: #f92672; font-weight: bold;">or</span>
           delimiter_p(char) <span style="color: #f92672; font-weight: bold;">or</span>
           doublequote_p(char)):
           <span style="color: #f92672; font-weight: bold;">return</span> i
       <span style="color: #fd971f;">i</span> = i + 1
</pre>
</div>
</div>
</div>

<div id="outline-container-org17470e1" class="outline-4">
<h4 id="org17470e1">space_p</h4>
<div class="outline-text-4" id="text-org17470e1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">space_p</span>(char):
    <span style="color: #f92672; font-weight: bold;">return</span> char.isspace()
</pre>
</div>
</div>
</div>

<div id="outline-container-org51cc0b4" class="outline-4">
<h4 id="org51cc0b4">delimiter_p</h4>
<div class="outline-text-4" id="text-org51cc0b4">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">delimiter_p</span>(char):
    <span style="color: #f92672; font-weight: bold;">return</span> (char == <span style="color: #e6db74;">'('</span> <span style="color: #f92672; font-weight: bold;">or</span>
            char == <span style="color: #e6db74;">')'</span> <span style="color: #f92672; font-weight: bold;">or</span>
            char == <span style="color: #e6db74;">'['</span> <span style="color: #f92672; font-weight: bold;">or</span>
            char == <span style="color: #e6db74;">']'</span> <span style="color: #f92672; font-weight: bold;">or</span>
            char == <span style="color: #e6db74;">'{'</span> <span style="color: #f92672; font-weight: bold;">or</span>
            char == <span style="color: #e6db74;">'}'</span> <span style="color: #f92672; font-weight: bold;">or</span>
            char == <span style="color: #e6db74;">','</span> <span style="color: #f92672; font-weight: bold;">or</span>
            char == <span style="color: #e6db74;">'`'</span> <span style="color: #f92672; font-weight: bold;">or</span>
            char == <span style="color: #e6db74;">"'"</span>)
</pre>
</div>
</div>
</div>
