jojo/jojo.org
***** Cons

      #+begin_src python
      class Cons:
          def __init__(self, car, cdr):
              self.car = car
              self.cdr = cdr
      #+end_src

***** cons

      #+begin_src python
      def cons(car, cdr):
          if null_p(cdr) or cons_p(cdr):
              return Cons(car, cdr)
          else:
              print("- cons fail")
              print("  cdr of cons must be a cons or null")
              print("  cdr : {}".format(cdr))
              error()
      #+end_src

***** cons_p

      #+begin_src python
      def cons_p(x):
          return isinstance(x, Cons)
      #+end_src

***** cdr

      #+begin_src python
      def cdr(x):
          return x.cdr
      #+end_src

***** car

      #+begin_src python
      def car(x):
          return x.car
      #+end_src

*** [note] syntax sugar

    - [...] -> (begin ...)
    - {...} -> (clo ...)
    - ' ... -> (quote ...)
    - ` ... -> (partquote ...)

*** parse_sexp_vect -- string vect to sexp vect

    - sexp := Null | Cons(sexp, sexp_list) | string

    #+begin_src python
    def parse_sexp_vect(string_vect):
        length = len(string_vect)
        i = 0
        sexp_vect = []
        while i < length:
           s, i = parse_sexp(string_vect, i)
           sexp_vect.append(s)
        return sexp_vect
    #+end_src

*** parse_sexp

    #+begin_src python
    def parse_sexp(string_vect, i):
        string = string_vect[i]
        if string == '(':
            return parse_sexp_cons_until_ket(string_vect, i+1, ')')
        elif string == '[':
            s_cons, i1 = parse_sexp_cons_until_ket(string_vect, i+1, ']')
            return (cons('begin', s_cons), i1)
        elif string == '{':
            s_cons, i1 = parse_sexp_cons_until_ket(string_vect, i+1, '}')
            return (cons('clo', s_cons), i1)
        elif string == "'":
            s, i1 = parse_sexp(string_vect, i+1)
            return (cons('quote', cons(s, null)), i1)
        elif string == "`":
            s, i1 = parse_sexp(string_vect, i+1)
            return (cons('partquote', cons(s, null)), i1)
        else:
            return (string, i+1)
    #+end_src

*** parse_sexp_cons_until_ket

    #+begin_src python
    def parse_sexp_cons_until_ket(string_vect, i, ket):
        string = string_vect[i]
        if string == ket:
            return (null, i+1)
        else:
            s, i1 = parse_sexp(string_vect, i)
            s_cons, i2 = \
                parse_sexp_cons_until_ket(string_vect, i1, ket)
            return (cons(s, s_cons), i2)
    #+end_src

*** p_print

    #+begin_src python
    def p_print(x):
        print(x, end="")
    #+end_src

*** sexp_print

    #+begin_src python
    def sexp_print(s):
        if null_p(s):
            p_print("null")
        elif cons_p(s):
            p_print("(")
            sexp_list_print(s)
            p_print(")")
        else:
            p_print(s)
    #+end_src

*** sexp_list_print

    #+begin_src python
    def sexp_list_print(s_cons):
        if null_p(s_cons):
            pass
        elif null_p(cdr(s_cons)):
            sexp_print(car(s_cons))
        else:
            sexp_print(car(s_cons))
            p_print(" ")
            sexp_list_print(cdr(s_cons))
    #+end_src

* compiler

