docs/jojo.html

<div id="outline-container-orge41ed1" class="outline-4">
<h4 id="orge41ed1">doublequote_p</h4>
<div class="outline-text-4" id="text-orge41ed1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">doublequote_p</span>(char):
    <span style="color: #f92672; font-weight: bold;">return</span> char == <span style="color: #e6db74;">'"'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfa71389" class="outline-3">
<h3 id="orgfa71389">null &amp; cons</h3>
<div class="outline-text-3" id="text-orgfa71389">
</div><div id="outline-container-org51a0463" class="outline-4">
<h4 id="org51a0463">Null</h4>
<div class="outline-text-4" id="text-org51a0463">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">Null</span>:
    <span style="color: #f92672; font-weight: bold;">pass</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3dd83f0" class="outline-4">
<h4 id="org3dd83f0">null</h4>
<div class="outline-text-4" id="text-org3dd83f0">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fd971f;">null</span> = Null()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc0505" class="outline-4">
<h4 id="orgdc0505">null_p</h4>
<div class="outline-text-4" id="text-orgdc0505">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">null_p</span>(x):
    <span style="color: #f92672; font-weight: bold;">return</span> x == null
</pre>
</div>
</div>
</div>

<div id="outline-container-org2063d86" class="outline-4">
<h4 id="org2063d86">Cons</h4>
<div class="outline-text-4" id="text-org2063d86">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">Cons</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, car, cdr):
        <span style="color: #f92672; font-weight: bold;">self</span>.car = car
        <span style="color: #f92672; font-weight: bold;">self</span>.cdr = cdr
</pre>
</div>
</div>
</div>

<div id="outline-container-org396b87f" class="outline-4">
<h4 id="org396b87f">cons</h4>
<div class="outline-text-4" id="text-org396b87f">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">cons</span>(car, cdr):
    <span style="color: #f92672; font-weight: bold;">if</span> null_p(cdr) <span style="color: #f92672; font-weight: bold;">or</span> cons_p(cdr):
        <span style="color: #f92672; font-weight: bold;">return</span> Cons(car, cdr)
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- cons fail"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  cdr of cons must be a cons or null"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  cdr : {}"</span>.<span style="color: #a6e22e;">format</span>(cdr))
        error()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf9207d" class="outline-4">
<h4 id="orgaf9207d">cons_p</h4>
<div class="outline-text-4" id="text-orgaf9207d">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">cons_p</span>(x):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">isinstance</span>(x, Cons)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ac01d2" class="outline-4">
<h4 id="org6ac01d2">cdr</h4>
<div class="outline-text-4" id="text-org6ac01d2">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">cdr</span>(x):
    <span style="color: #f92672; font-weight: bold;">return</span> x.cdr
</pre>
</div>
</div>
</div>

<div id="outline-container-org7741c5b" class="outline-4">
<h4 id="org7741c5b">car</h4>
<div class="outline-text-4" id="text-org7741c5b">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">car</span>(x):
    <span style="color: #f92672; font-weight: bold;">return</span> x.car
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfe8c6bb" class="outline-3">
<h3 id="orgfe8c6bb"><span class="todo _note_">[note]</span> syntax sugar</h3>
<div class="outline-text-3" id="text-orgfe8c6bb">
<ul class="org-ul">
<li><p>[&#x2026;] -&gt; (begin &#x2026;)</p></li>
<li><p>{&#x2026;} -&gt; (clo &#x2026;)</p></li>
<li><p>' &#x2026; -&gt; (quote &#x2026;)</p></li>
<li><p>` &#x2026; -&gt; (partquote &#x2026;)</p></li></ul>
</div>
</div>

<div id="outline-container-org7f324bd" class="outline-3">
<h3 id="org7f324bd">parse_sexp_vect &#x2013; string vect to sexp vect</h3>
<div class="outline-text-3" id="text-org7f324bd">
<ul class="org-ul">
<li><p>sexp := Null | Cons(sexp, sexp_list) | string</p></li></ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">parse_sexp_vect</span>(string_vect):
    <span style="color: #fd971f;">length</span> = <span style="color: #a6e22e;">len</span>(string_vect)
    <span style="color: #fd971f;">i</span> = 0
    <span style="color: #fd971f;">sexp_vect</span> = []
    <span style="color: #f92672; font-weight: bold;">while</span> i &lt; length:
       <span style="color: #fd971f;">s</span>, <span style="color: #fd971f;">i</span> = parse_sexp(string_vect, i)
       sexp_vect.append(s)
    <span style="color: #f92672; font-weight: bold;">return</span> sexp_vect
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a1d31c" class="outline-3">
<h3 id="org8a1d31c">parse_sexp</h3>
<div class="outline-text-3" id="text-org8a1d31c">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">parse_sexp</span>(string_vect, i):
    <span style="color: #fd971f;">string</span> = string_vect[i]
    <span style="color: #f92672; font-weight: bold;">if</span> string == <span style="color: #e6db74;">'('</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> parse_sexp_cons_until_ket(string_vect, i+1, <span style="color: #e6db74;">')'</span>)
    <span style="color: #f92672; font-weight: bold;">elif</span> string == <span style="color: #e6db74;">'['</span>:
        <span style="color: #fd971f;">s_cons</span>, <span style="color: #fd971f;">i1</span> = parse_sexp_cons_until_ket(string_vect, i+1, <span style="color: #e6db74;">']'</span>)
        <span style="color: #f92672; font-weight: bold;">return</span> (cons(<span style="color: #e6db74;">'begin'</span>, s_cons), i1)
    <span style="color: #f92672; font-weight: bold;">elif</span> string == <span style="color: #e6db74;">'{'</span>:
        <span style="color: #fd971f;">s_cons</span>, <span style="color: #fd971f;">i1</span> = parse_sexp_cons_until_ket(string_vect, i+1, <span style="color: #e6db74;">'}'</span>)
        <span style="color: #f92672; font-weight: bold;">return</span> (cons(<span style="color: #e6db74;">'clo'</span>, s_cons), i1)
    <span style="color: #f92672; font-weight: bold;">elif</span> string == <span style="color: #e6db74;">"'"</span>:
        <span style="color: #fd971f;">s</span>, <span style="color: #fd971f;">i1</span> = parse_sexp(string_vect, i+1)
        <span style="color: #f92672; font-weight: bold;">return</span> (cons(<span style="color: #e6db74;">'quote'</span>, cons(s, null)), i1)
    <span style="color: #f92672; font-weight: bold;">elif</span> string == <span style="color: #e6db74;">"`"</span>:
        <span style="color: #fd971f;">s</span>, <span style="color: #fd971f;">i1</span> = parse_sexp(string_vect, i+1)
        <span style="color: #f92672; font-weight: bold;">return</span> (cons(<span style="color: #e6db74;">'partquote'</span>, cons(s, null)), i1)
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> (string, i+1)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ac8c0b" class="outline-3">
<h3 id="org8ac8c0b">parse_sexp_cons_until_ket</h3>
<div class="outline-text-3" id="text-org8ac8c0b">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">parse_sexp_cons_until_ket</span>(string_vect, i, ket):
    <span style="color: #fd971f;">string</span> = string_vect[i]
    <span style="color: #f92672; font-weight: bold;">if</span> string == ket:
        <span style="color: #f92672; font-weight: bold;">return</span> (null, i+1)
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #fd971f;">s</span>, <span style="color: #fd971f;">i1</span> = parse_sexp(string_vect, i)
        <span style="color: #fd971f;">s_cons</span>, <span style="color: #fd971f;">i2</span> = \
            parse_sexp_cons_until_ket(string_vect, i1, ket)
        <span style="color: #f92672; font-weight: bold;">return</span> (cons(s, s_cons), i2)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb2c7049" class="outline-3">
<h3 id="orgb2c7049">p_print</h3>
<div class="outline-text-3" id="text-orgb2c7049">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">p_print</span>(x):
    <span style="color: #f92672; font-weight: bold;">print</span>(x, end=<span style="color: #e6db74;">""</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1ef3db7" class="outline-3">
<h3 id="org1ef3db7">sexp_print</h3>
<div class="outline-text-3" id="text-org1ef3db7">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">sexp_print</span>(s):
    <span style="color: #f92672; font-weight: bold;">if</span> null_p(s):
        p_print(<span style="color: #e6db74;">"null"</span>)
    <span style="color: #f92672; font-weight: bold;">elif</span> cons_p(s):
        p_print(<span style="color: #e6db74;">"("</span>)
        sexp_list_print(s)
        p_print(<span style="color: #e6db74;">")"</span>)
    <span style="color: #f92672; font-weight: bold;">else</span>:
        p_print(s)
</pre>
</div>
</div>
</div>

<div id="outline-container-org72f30c9" class="outline-3">
<h3 id="org72f30c9">sexp_list_print</h3>
<div class="outline-text-3" id="text-org72f30c9">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">sexp_list_print</span>(s_cons):
    <span style="color: #f92672; font-weight: bold;">if</span> null_p(s_cons):
        <span style="color: #f92672; font-weight: bold;">pass</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> null_p(cdr(s_cons)):
        sexp_print(car(s_cons))
    <span style="color: #f92672; font-weight: bold;">else</span>:
        sexp_print(car(s_cons))
        p_print(<span style="color: #e6db74;">" "</span>)
        sexp_list_print(cdr(s_cons))
</pre>
</div>
</div>
</div>
</div>
