jojo/jojo.org
*** new_module

    #+begin_src python
    def new_module(name):
        module = types.ModuleType(name)
        # for top level sexp
        module.vm = VM([], [])
        # for name can occur before been defined
        module.defined_name_set = set()
        return module
    #+end_src

*** jojo_define

    #+begin_src python
    def jojo_define(module, name, value):
        module.defined_name_set.add(name)
        setattr(module, name, value)
    #+end_src

*** merge_prim_dict

    #+begin_src python
    def merge_prim_dict(module):
        for name, value in prim_dict.items():
            jojo_define(module, name, value)
    #+end_src

*** merge_module

    #+begin_src python
    def merge_module(module, src_module):
        for name in src_module.defined_name_set:
            jojo = getattr(src_module, name)
            jojo_define(module, name, jojo)
    #+end_src

*** merge_sexp_vect

    #+begin_src python
    def merge_sexp_vect(module, sexp_vect):
        for sexp in sexp_vect:
            jo_vect = sexp_emit(module, sexp)
            module.vm.rs.append(RP(JOJO(jo_vect)))
            module.vm.exe()
        return module
    #+end_src

*** compile_module

    #+begin_src python
    def compile_module(name, sexp_vect):
        module = new_module(name)
        merge_prim_dict(module)
        merge_module(module, core_module)
        merge_sexp_vect(module, sexp_vect)
        return module
    #+end_src

*** compile_core_module

    - compile the core_module itself
      without merging core_module

    #+begin_src python
    def compile_core_module(name, sexp_vect):
        module = new_module(name)
        merge_prim_dict(module)
        merge_sexp_vect(module, sexp_vect)
        return module
    #+end_src

*** sexp_list_emit

    #+begin_src python
    def sexp_list_emit(module, sexp_list):
        jo_vect = []
        while not null_p(sexp_list):
            sexp = car(sexp_list)
            jo_vect.extend(sexp_emit(module, sexp))
            sexp_list = cdr(sexp_list)
        return jo_vect
    #+end_src

*** sexp_emit

***** sexp_emit

      #+begin_src python
      def sexp_emit(module, sexp):
          if null_p(sexp):
              return null_emit(module, sexp)
          elif cons_p(sexp):
              return cons_emit(module, sexp)
          else:
              return string_emit(module, sexp)
      #+end_src

***** null_emit

      #+begin_src python
      def null_emit(module, sexp):
          return [null]
      #+end_src

***** cons_emit

      #+begin_src python
      def cons_emit(module, cons):
          keyword = car(cons)
          # keyword can not have dot-in-name
          if keyword in keyword_dict.keys():
              fun = keyword_dict[keyword]
              return fun(module, cdr(cons))
          elif keyword in macro_dict.keys():
              fun = macro_dict[keyword]
              new_sexp = fun(cdr(cons))
              return sexp_emit(module, new_sexp)
          else:
              # a call to string_emit
              # handles dot-in-name in head of sexp
              vm = VM([cdr(cons)],
                      [RP(JOJO(string_emit(module, keyword)))])
              vm.exe()
              new_sexp = vm.ds[0]
              return sexp_emit(module, new_sexp)
      #+end_src

***** string_emit

      #+begin_src python
      def string_emit(module, string):
          # special strings
          for p, e in string_emitter_vect:
              if p(string):
                  return e(module, string)

          # dot in string
          if '.' in string:
              return dot_in_string_emit(module, string)

          # built-in keyword
          if string in key_jo_dict.keys():
              return key_jo_dict[string]

          # normal function call
          return [CALL_FROM_MODULE(module, string)]
      #+end_src

