docs/jojo.html

<div id="outline-container-org62c1694" class="outline-2">
<h2 id="org62c1694">compiler</h2>
<div class="outline-text-2" id="text-org62c1694">
</div><div id="outline-container-org9361b5f" class="outline-3">
<h3 id="org9361b5f">new_module</h3>
<div class="outline-text-3" id="text-org9361b5f">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">new_module</span>(name):
    <span style="color: #fd971f;">module</span> = types.ModuleType(name)
    <span style="color: #FF8888;"># </span><span style="color: #FF8888;">for top level sexp</span>
    <span style="color: #fd971f;">module.vm</span> = VM([], [])
    <span style="color: #FF8888;"># </span><span style="color: #FF8888;">for name can occur before been defined</span>
    <span style="color: #fd971f;">module.defined_name_set</span> = <span style="color: #a6e22e;">set</span>()
    <span style="color: #f92672; font-weight: bold;">return</span> module
</pre>
</div>
</div>
</div>

<div id="outline-container-org7c555ff" class="outline-3">
<h3 id="org7c555ff">jojo_define</h3>
<div class="outline-text-3" id="text-org7c555ff">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jojo_define</span>(module, name, value):
    module.defined_name_set.add(name)
    <span style="color: #a6e22e;">setattr</span>(module, name, value)
</pre>
</div>
</div>
</div>

<div id="outline-container-org31edba9" class="outline-3">
<h3 id="org31edba9">merge_prim_dict</h3>
<div class="outline-text-3" id="text-org31edba9">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">merge_prim_dict</span>(module):
    <span style="color: #f92672; font-weight: bold;">for</span> name, value <span style="color: #f92672; font-weight: bold;">in</span> prim_dict.items():
        jojo_define(module, name, value)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdccd4e8" class="outline-3">
<h3 id="orgdccd4e8">merge_module</h3>
<div class="outline-text-3" id="text-orgdccd4e8">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">merge_module</span>(module, src_module):
    <span style="color: #f92672; font-weight: bold;">for</span> name <span style="color: #f92672; font-weight: bold;">in</span> src_module.defined_name_set:
        <span style="color: #fd971f;">jojo</span> = <span style="color: #a6e22e;">getattr</span>(src_module, name)
        jojo_define(module, name, jojo)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b1a68d" class="outline-3">
<h3 id="org7b1a68d">merge_sexp_vect</h3>
<div class="outline-text-3" id="text-org7b1a68d">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">merge_sexp_vect</span>(module, sexp_vect):
    <span style="color: #f92672; font-weight: bold;">for</span> sexp <span style="color: #f92672; font-weight: bold;">in</span> sexp_vect:
        <span style="color: #fd971f;">jo_vect</span> = sexp_emit(module, sexp)
        module.vm.rs.append(RP(JOJO(jo_vect)))
        module.vm.exe()
    <span style="color: #f92672; font-weight: bold;">return</span> module
</pre>
</div>
</div>
</div>

<div id="outline-container-org6cc7769" class="outline-3">
<h3 id="org6cc7769">compile_module</h3>
<div class="outline-text-3" id="text-org6cc7769">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">compile_module</span>(name, sexp_vect):
    <span style="color: #fd971f;">module</span> = new_module(name)
    merge_prim_dict(module)
    merge_module(module, core_module)
    merge_sexp_vect(module, sexp_vect)
    <span style="color: #f92672; font-weight: bold;">return</span> module
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd93192f" class="outline-3">
<h3 id="orgd93192f">compile_core_module</h3>
<div class="outline-text-3" id="text-orgd93192f">
<ul class="org-ul">
<li><p>compile the core_module itself</p><p>without merging core_module</p></li></ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">compile_core_module</span>(name, sexp_vect):
    <span style="color: #fd971f;">module</span> = new_module(name)
    merge_prim_dict(module)
    merge_sexp_vect(module, sexp_vect)
    <span style="color: #f92672; font-weight: bold;">return</span> module
</pre>
</div>
</div>
</div>

<div id="outline-container-org5dd7b34" class="outline-3">
<h3 id="org5dd7b34">sexp_list_emit</h3>
<div class="outline-text-3" id="text-org5dd7b34">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">sexp_list_emit</span>(module, sexp_list):
    <span style="color: #fd971f;">jo_vect</span> = []
    <span style="color: #f92672; font-weight: bold;">while</span> <span style="color: #f92672; font-weight: bold;">not</span> null_p(sexp_list):
        <span style="color: #fd971f;">sexp</span> = car(sexp_list)
        jo_vect.extend(sexp_emit(module, sexp))
        <span style="color: #fd971f;">sexp_list</span> = cdr(sexp_list)
    <span style="color: #f92672; font-weight: bold;">return</span> jo_vect
</pre>
</div>
</div>
</div>

<div id="outline-container-org4c5f548" class="outline-3">
<h3 id="org4c5f548">sexp_emit</h3>
<div class="outline-text-3" id="text-org4c5f548">
</div><div id="outline-container-org77cf493" class="outline-4">
<h4 id="org77cf493">sexp_emit</h4>
<div class="outline-text-4" id="text-org77cf493">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">sexp_emit</span>(module, sexp):
    <span style="color: #f92672; font-weight: bold;">if</span> null_p(sexp):
        <span style="color: #f92672; font-weight: bold;">return</span> null_emit(module, sexp)
    <span style="color: #f92672; font-weight: bold;">elif</span> cons_p(sexp):
        <span style="color: #f92672; font-weight: bold;">return</span> cons_emit(module, sexp)
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> string_emit(module, sexp)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9942096" class="outline-4">
<h4 id="org9942096">null_emit</h4>
<div class="outline-text-4" id="text-org9942096">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">null_emit</span>(module, sexp):
    <span style="color: #f92672; font-weight: bold;">return</span> [null]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb8374a4" class="outline-4">
<h4 id="orgb8374a4">cons_emit</h4>
<div class="outline-text-4" id="text-orgb8374a4">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">cons_emit</span>(module, cons):
    <span style="color: #fd971f;">keyword</span> = car(cons)
    <span style="color: #FF8888;"># </span><span style="color: #FF8888;">keyword can not have dot-in-name</span>
    <span style="color: #f92672; font-weight: bold;">if</span> keyword <span style="color: #f92672; font-weight: bold;">in</span> keyword_dict.keys():
        <span style="color: #fd971f;">fun</span> = keyword_dict[keyword]
        <span style="color: #f92672; font-weight: bold;">return</span> fun(module, cdr(cons))
    <span style="color: #f92672; font-weight: bold;">elif</span> keyword <span style="color: #f92672; font-weight: bold;">in</span> macro_dict.keys():
        <span style="color: #fd971f;">fun</span> = macro_dict[keyword]
        <span style="color: #fd971f;">new_sexp</span> = fun(cdr(cons))
        <span style="color: #f92672; font-weight: bold;">return</span> sexp_emit(module, new_sexp)
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #FF8888;"># </span><span style="color: #FF8888;">a call to string_emit</span>
        <span style="color: #FF8888;"># </span><span style="color: #FF8888;">handles dot-in-name in head of sexp</span>
        <span style="color: #fd971f;">vm</span> = VM([cdr(cons)],
                [RP(JOJO(string_emit(module, keyword)))])
        vm.exe()
        <span style="color: #fd971f;">new_sexp</span> = vm.ds[0]
        <span style="color: #f92672; font-weight: bold;">return</span> sexp_emit(module, new_sexp)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf69de6c" class="outline-4">
<h4 id="orgf69de6c">string_emit</h4>
<div class="outline-text-4" id="text-orgf69de6c">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">string_emit</span>(module, string):
    <span style="color: #FF8888;"># </span><span style="color: #FF8888;">special strings</span>
    <span style="color: #f92672; font-weight: bold;">for</span> p, e <span style="color: #f92672; font-weight: bold;">in</span> string_emitter_vect:
        <span style="color: #f92672; font-weight: bold;">if</span> p(string):
            <span style="color: #f92672; font-weight: bold;">return</span> e(module, string)

    <span style="color: #FF8888;"># </span><span style="color: #FF8888;">dot in string</span>
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #e6db74;">'.'</span> <span style="color: #f92672; font-weight: bold;">in</span> string:
        <span style="color: #f92672; font-weight: bold;">return</span> dot_in_string_emit(module, string)

    <span style="color: #FF8888;"># </span><span style="color: #FF8888;">built-in keyword</span>
    <span style="color: #f92672; font-weight: bold;">if</span> string <span style="color: #f92672; font-weight: bold;">in</span> key_jo_dict.keys():
        <span style="color: #f92672; font-weight: bold;">return</span> key_jo_dict[string]

    <span style="color: #FF8888;"># </span><span style="color: #FF8888;">normal function call</span>
    <span style="color: #f92672; font-weight: bold;">return</span> [CALL_FROM_MODULE(module, string)]
</pre>
</div>
</div>
</div>
