jojo/jojo.org
***** dot_in_string_emit

      #+begin_src python
      def dot_in_string_emit(module, string):
          jo_vect = []
          string_vect = string.split('.')
          head_string = string_vect[0]
          if head_string == '':
              pass
          else:
              jo_vect.extend(string_emit(module, head_string))

          tail_string_vect = string_vect[1:]
          for s in tail_string_vect:
              s1 = '.' + s
              jo_vect.extend(string_emit(module, s1))

          return jo_vect
      #+end_src

***** string_emitter_vect & @string_emitter

******* string_emitter_vect

        - vect is used,
          for the order matters.

        #+begin_src python
        string_emitter_vect = []
        #+end_src

******* @string_emitter

        #+begin_src python
        def string_emitter(p):
            def decorator(emitter):
                string_emitter_vect.append((p, emitter))
                return emitter
            return decorator
        #+end_src

******* int_string_p

        #+begin_src python
        def int_string_p(string):
            if not string_p(string):
                return False
            length = len(string)
            if length == 0:
                return False
            elif string[0] == '-':
                return nat_string_p(string[1:])
            else:
                return nat_string_p(string)
        #+end_src

******* nat_string_p

        #+begin_src python
        def nat_string_p(string):
            if not string_p(string):
                return False
            return string.isdecimal()
        #+end_src

******* int_string_emitter

        #+begin_src python
        @string_emitter(int_string_p)
        def int_string_emitter(module, string):
            return [int(string)]
        #+end_src

******* doublequoted_string_p

        - "doublequoted"

        #+begin_src python
        def doublequoted_string_p(string):
            if not string_p(string):
                return False
            if len(string) < 3:
                return False
            elif string[0] != '"':
                return False
            elif string[-1] != '"':
                return False
            else:
                return True
        #+end_src

******* doublequoted_string_emitter

        #+begin_src python
        @string_emitter(doublequoted_string_p)
        def doublequoted_string_emitter(module, string):
            string = string[1:-1]
            return [string]
        #+end_src

******* local_string_p

        - :local

        #+begin_src python
        def local_string_p(string):
            if not string_p(string):
                return False
            if len(string) < 2:
                return False
            elif string.count('.') != 0:
                return False
            elif string.count(':') != 1:
                return False
            elif string[0] != ':':
                return False
            elif string[-1] == '!':
                return False
            else:
                return True
        #+end_src

******* local_string_emitter

        #+begin_src python
        @string_emitter(local_string_p)
        def local_string_emitter(module, string):
            return [GET(string)]
        #+end_src

******* set_local_string_p

        - :local!

        #+begin_src python
        def set_local_string_p(string):
            if not string_p(string):
                return False
            if len(string) < 3:
                return False
            elif string.count('.') != 0:
                return False
            elif string[0] != ':':
                return False
            elif string[-1] != '!':
                return False
            else:
                return True
        #+end_src

