docs/jojo.html

<div id="outline-container-org6b72ecd" class="outline-4">
<h4 id="org6b72ecd">dot_in_string_emit</h4>
<div class="outline-text-4" id="text-org6b72ecd">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">dot_in_string_emit</span>(module, string):
    <span style="color: #fd971f;">jo_vect</span> = []
    <span style="color: #fd971f;">string_vect</span> = string.split(<span style="color: #e6db74;">'.'</span>)
    <span style="color: #fd971f;">head_string</span> = string_vect[0]
    <span style="color: #f92672; font-weight: bold;">if</span> head_string == <span style="color: #e6db74;">''</span>:
        <span style="color: #f92672; font-weight: bold;">pass</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
        jo_vect.extend(string_emit(module, head_string))

    <span style="color: #fd971f;">tail_string_vect</span> = string_vect[1:]
    <span style="color: #f92672; font-weight: bold;">for</span> s <span style="color: #f92672; font-weight: bold;">in</span> tail_string_vect:
        <span style="color: #fd971f;">s1</span> = <span style="color: #e6db74;">'.'</span> + s
        jo_vect.extend(string_emit(module, s1))

    <span style="color: #f92672; font-weight: bold;">return</span> jo_vect
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcca88fc" class="outline-4">
<h4 id="orgcca88fc">string_emitter_vect &amp; @string_emitter</h4>
<div class="outline-text-4" id="text-orgcca88fc">
</div><div id="outline-container-org2d69f8e" class="outline-5">
<h5 id="org2d69f8e">string_emitter_vect</h5>
<div class="outline-text-5" id="text-org2d69f8e">
<ul class="org-ul">
<li><p>vect is used,</p><p>for the order matters.</p></li></ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #fd971f;">string_emitter_vect</span> = []
</pre>
</div>
</div>
</div>

<div id="outline-container-orge1bf490" class="outline-5">
<h5 id="orge1bf490">@string_emitter</h5>
<div class="outline-text-5" id="text-orge1bf490">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">string_emitter</span>(p):
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">decorator</span>(emitter):
        string_emitter_vect.append((p, emitter))
        <span style="color: #f92672; font-weight: bold;">return</span> emitter
    <span style="color: #f92672; font-weight: bold;">return</span> decorator
</pre>
</div>
</div>
</div>

<div id="outline-container-org1bb099f" class="outline-5">
<h5 id="org1bb099f">int_string_p</h5>
<div class="outline-text-5" id="text-org1bb099f">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">int_string_p</span>(string):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> string_p(string):
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #fd971f;">length</span> = <span style="color: #a6e22e;">len</span>(string)
    <span style="color: #f92672; font-weight: bold;">if</span> length == 0:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string[0] == <span style="color: #e6db74;">'-'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> nat_string_p(string[1:])
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> nat_string_p(string)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f71eef" class="outline-5">
<h5 id="org2f71eef">nat_string_p</h5>
<div class="outline-text-5" id="text-org2f71eef">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">nat_string_p</span>(string):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> string_p(string):
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">return</span> string.isdecimal()
</pre>
</div>
</div>
</div>

<div id="outline-container-org64d909b" class="outline-5">
<h5 id="org64d909b">int_string_emitter</h5>
<div class="outline-text-5" id="text-org64d909b">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@string_emitter</span>(int_string_p)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">int_string_emitter</span>(module, string):
    <span style="color: #f92672; font-weight: bold;">return</span> [<span style="color: #a6e22e;">int</span>(string)]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda8269f" class="outline-5">
<h5 id="orgda8269f">doublequoted_string_p</h5>
<div class="outline-text-5" id="text-orgda8269f">
<ul class="org-ul">
<li><p>"doublequoted"</p></li></ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">doublequoted_string_p</span>(string):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> string_p(string):
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">len</span>(string) &lt; 3:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string[0] != <span style="color: #e6db74;">'"'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string[-1] != <span style="color: #e6db74;">'"'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge34e7c7" class="outline-5">
<h5 id="orge34e7c7">doublequoted_string_emitter</h5>
<div class="outline-text-5" id="text-orge34e7c7">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@string_emitter</span>(doublequoted_string_p)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">doublequoted_string_emitter</span>(module, string):
    <span style="color: #fd971f;">string</span> = string[1:-1]
    <span style="color: #f92672; font-weight: bold;">return</span> [string]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc123894" class="outline-5">
<h5 id="orgc123894">local_string_p</h5>
<div class="outline-text-5" id="text-orgc123894">
<ul class="org-ul">
<li><p>:local</p></li></ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">local_string_p</span>(string):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> string_p(string):
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">len</span>(string) &lt; 2:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string.count(<span style="color: #e6db74;">'.'</span>) != 0:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string.count(<span style="color: #e6db74;">':'</span>) != 1:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string[0] != <span style="color: #e6db74;">':'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string[-1] == <span style="color: #e6db74;">'!'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd1f7aa" class="outline-5">
<h5 id="orgd1f7aa">local_string_emitter</h5>
<div class="outline-text-5" id="text-orgd1f7aa">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@string_emitter</span>(local_string_p)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">local_string_emitter</span>(module, string):
    <span style="color: #f92672; font-weight: bold;">return</span> [GET(string)]
</pre>
</div>
</div>
</div>
