jojo/jojo.org
******* set_local_string_emitter

        #+begin_src python
        @string_emitter(set_local_string_p)
        def set_local_string_emitter(module, string):
            string = string[:-1]
            return [SET(string)]
        #+end_src

******* message_string_p

        - .message

        #+begin_src python
        def message_string_p(string):
            if not string_p(string):
                return False
            if len(string) < 2:
                return False
            elif string[0] != '.':
                return False
            elif string.count('.') != 1:
                return False
            elif string[-1] == '!':
                return False
            else:
                return True
        #+end_src

******* message_string_emitter

        #+begin_src python
        @string_emitter(message_string_p)
        def message_string_emitter(module, string):
            string = string[1:]
            return [MSG(string)]
        #+end_src

******* set_message_string_p

        - .message!

        #+begin_src python
        def set_message_string_p(string):
            if not string_p(string):
                return False
            if len(string) < 2:
                return False
            elif string[0] != '.':
                return False
            elif string.count('.') != 1:
                return False
            elif string[-1] != '!':
                return False
            else:
                return True
        #+end_src

******* set_message_string_emitter

        #+begin_src python
        @string_emitter(set_message_string_p)
        def set_message_string_emitter(module, string):
            string = string[1:-1]
            return [SET_FIELD(string)]
        #+end_src

* prim_dict

*** prim_dict & @prim

    #+begin_src python
    prim_dict = {}

    def prim(name):
        def decorator(fun):
            prim_dict[name] = fun
            return fun
        return decorator
    #+end_src

*** *stack operation*

    #+begin_src python
    @prim('drop')
    def drop(a):
        return None

    @prim('dup')
    def dup(a):
        return VALUES(a, a)

    @prim('over')
    def over(a, b):
        return VALUES(a, b, a)

    @prim('tuck')
    def tuck(a, b):
        return VALUES(b, a, b)

    @prim('swap')
    def swap(a, b):
        return VALUES(b, a)
    #+end_src

*** *int*

***** Int

      #+begin_src python
      prim('Int')(int)
      #+end_src

***** int_p

      #+begin_src python
      @prim('int?')
      def int_p(x):
          return type(x) == int
      #+end_src

