docs/jojo.html

<div id="outline-container-orgcc672b5" class="outline-5">
<h5 id="orgcc672b5">set_local_string_p</h5>
<div class="outline-text-5" id="text-orgcc672b5">
<ul class="org-ul">
<li><p>:local!</p></li></ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_local_string_p</span>(string):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> string_p(string):
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">len</span>(string) &lt; 3:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string.count(<span style="color: #e6db74;">'.'</span>) != 0:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string[0] != <span style="color: #e6db74;">':'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string[-1] != <span style="color: #e6db74;">'!'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org804d9cf" class="outline-5">
<h5 id="org804d9cf">set_local_string_emitter</h5>
<div class="outline-text-5" id="text-org804d9cf">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@string_emitter</span>(set_local_string_p)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_local_string_emitter</span>(module, string):
    <span style="color: #fd971f;">string</span> = string[:-1]
    <span style="color: #f92672; font-weight: bold;">return</span> [SET(string)]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf59c585" class="outline-5">
<h5 id="orgf59c585">message_string_p</h5>
<div class="outline-text-5" id="text-orgf59c585">
<ul class="org-ul">
<li><p>.message</p></li></ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">message_string_p</span>(string):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> string_p(string):
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">len</span>(string) &lt; 2:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string[0] != <span style="color: #e6db74;">'.'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string.count(<span style="color: #e6db74;">'.'</span>) != 1:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string[-1] == <span style="color: #e6db74;">'!'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org26e3658" class="outline-5">
<h5 id="org26e3658">message_string_emitter</h5>
<div class="outline-text-5" id="text-org26e3658">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@string_emitter</span>(message_string_p)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">message_string_emitter</span>(module, string):
    <span style="color: #fd971f;">string</span> = string[1:]
    <span style="color: #f92672; font-weight: bold;">return</span> [MSG(string)]
</pre>
</div>
</div>
</div>

<div id="outline-container-org57305eb" class="outline-5">
<h5 id="org57305eb">set_message_string_p</h5>
<div class="outline-text-5" id="text-org57305eb">
<ul class="org-ul">
<li><p>.message!</p></li></ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_message_string_p</span>(string):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> string_p(string):
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">len</span>(string) &lt; 2:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string[0] != <span style="color: #e6db74;">'.'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string.count(<span style="color: #e6db74;">'.'</span>) != 1:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string[-1] != <span style="color: #e6db74;">'!'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3736b97" class="outline-5">
<h5 id="org3736b97">set_message_string_emitter</h5>
<div class="outline-text-5" id="text-org3736b97">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@string_emitter</span>(set_message_string_p)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_message_string_emitter</span>(module, string):
    <span style="color: #fd971f;">string</span> = string[1:-1]
    <span style="color: #f92672; font-weight: bold;">return</span> [SET_FIELD(string)]
</pre>
</div>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org5e25feb" class="outline-2">
<h2 id="org5e25feb">prim_dict</h2>
<div class="outline-text-2" id="text-org5e25feb">
</div><div id="outline-container-org7c6fd16" class="outline-3">
<h3 id="org7c6fd16">prim_dict &amp; @prim</h3>
<div class="outline-text-3" id="text-org7c6fd16">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fd971f;">prim_dict</span> = {}

<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">prim</span>(name):
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">decorator</span>(fun):
        <span style="color: #fd971f;">prim_dict</span>[name] = fun
        <span style="color: #f92672; font-weight: bold;">return</span> fun
    <span style="color: #f92672; font-weight: bold;">return</span> decorator
</pre>
</div>
</div>
</div>

<div id="outline-container-org4fd3408" class="outline-3">
<h3 id="org4fd3408"><b>stack operation</b></h3>
<div class="outline-text-3" id="text-org4fd3408">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'drop'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">drop</span>(a):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">None</span>

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'dup'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">dup</span>(a):
    <span style="color: #f92672; font-weight: bold;">return</span> VALUES(a, a)

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'over'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">over</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> VALUES(a, b, a)

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'tuck'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">tuck</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> VALUES(b, a, b)

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'swap'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">swap</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> VALUES(b, a)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ca7e41" class="outline-3">
<h3 id="org2ca7e41"><b>int</b></h3>
<div class="outline-text-3" id="text-org2ca7e41">
</div><div id="outline-container-orgbbc7958" class="outline-4">
<h4 id="orgbbc7958">Int</h4>
<div class="outline-text-4" id="text-orgbbc7958">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'Int'</span>)(<span style="color: #a6e22e;">int</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org28509a0" class="outline-4">
<h4 id="org28509a0">int_p</h4>
<div class="outline-text-4" id="text-org28509a0">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'int?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">int_p</span>(x):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">type</span>(x) == <span style="color: #a6e22e;">int</span>
</pre>
</div>
</div>
</div>
