jojo/jojo.org
***** primary school

      #+begin_src python
      @prim('inc')
      def inc(a):
          return a + 1

      @prim('dec')
      def dec(a):
          return a - 1

      @prim('add')
      def add(a, b):
          return a + b

      @prim('sub')
      def sub(a, b):
          return a - b

      @prim('mul')
      def mul(a, b):
          return a * b

      @prim('div')
      def div(a, b):
          return a // b

      @prim('mod')
      def mod(a, b):
          return a % b

      @prim('divmod')
      def p_divmod(a, b):
          return VALUES(*divmod(a, b))
      #+end_src

***** compare

******* lt_p -- less then

        #+begin_src python
        @prim('lt?')
        def lt_p(a, b):
            return a < b
        #+end_src

******* gt_p -- greater then

        #+begin_src python
        @prim('gt?')
        def gt_p(a, b):
            return a > b
        #+end_src

******* lteq_p -- less then or equal to

        #+begin_src python
        @prim('lteq?')
        def lteq_p(a, b):
            return a <= b
        #+end_src

******* gteq_p -- greater then or equal to

        #+begin_src python
        @prim('gteq?')
        def gteq_p(a, b):
            return a >= b
        #+end_src

***** int_print

      #+begin_src python
      @prim('int-print')
      def int_print(i):
          p_print(i)
      #+end_src

*** *bool*

***** Bool

      #+begin_src python
      prim('Bool')(bool)
      #+end_src

***** basic

      #+begin_src python
      @prim('true')
      def true():
          return True

      @prim('false')
      def false():
          return False

      @prim('not')
      def p_not(b):
          return not b

      @prim('and')
      def p_and(a, b):
          return (a and b)

      @prim('or')
      def p_or(a, b):
          return (a or b)
      #+end_src

*** *equivalence*

    #+begin_src python
    @prim('eq?')
    def eq_p(a, b):
        if string_p(a):
            return a == b
        else:
            return a is b
    #+end_src

*** *sexp*

    #+begin_src python
    prim('null')(null)
    prim('null?')(null_p)

    prim('cons')(cons)
    prim('cons?')(cons_p)

    prim('car')(car)
    prim('cdr')(cdr)

    prim('sexp-print')(sexp_print)
    prim('sexp-list-print')(sexp_list_print)

    prim('code-scan')(code_scan)
    #+end_src

*** *string*

***** String

      #+begin_src python
      prim('String')(str)
      #+end_src

***** string_p

      #+begin_src python
      prim('string?')(string_p)
      #+end_src

***** string_print

      #+begin_src python
      @prim('string-print')
      def string_print(string):
          p_print(string)
      #+end_src

***** string_length

      #+begin_src python
      @prim('string_length')
      def string_length(string):
          return len(string)
      #+end_src

***** string_ref

      #+begin_src python
      @prim('string-ref')
      def string_ref(string, index):
          return string[index]
      #+end_src

