docs/jojo.html

<div id="outline-container-org1d4c192" class="outline-4">
<h4 id="org1d4c192">primary school</h4>
<div class="outline-text-4" id="text-org1d4c192">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'inc'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">inc</span>(a):
    <span style="color: #f92672; font-weight: bold;">return</span> a + 1

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'dec'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">dec</span>(a):
    <span style="color: #f92672; font-weight: bold;">return</span> a - 1

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'add'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">add</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> a + b

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'sub'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">sub</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> a - b

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'mul'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">mul</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> a * b

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'div'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">div</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> a // b

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'mod'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">mod</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> a % b

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'divmod'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">p_divmod</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> VALUES(*<span style="color: #a6e22e;">divmod</span>(a, b))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9589261" class="outline-4">
<h4 id="org9589261">compare</h4>
<div class="outline-text-4" id="text-org9589261">
</div><div id="outline-container-org407e9ba" class="outline-5">
<h5 id="org407e9ba">lt_p &#x2013; less then</h5>
<div class="outline-text-5" id="text-org407e9ba">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'lt?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">lt_p</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> a &lt; b
</pre>
</div>
</div>
</div>

<div id="outline-container-org6fcc1a3" class="outline-5">
<h5 id="org6fcc1a3">gt_p &#x2013; greater then</h5>
<div class="outline-text-5" id="text-org6fcc1a3">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'gt?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">gt_p</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> a &gt; b
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdaeb455" class="outline-5">
<h5 id="orgdaeb455">lteq_p &#x2013; less then or equal to</h5>
<div class="outline-text-5" id="text-orgdaeb455">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'lteq?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">lteq_p</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> a &lt;= b
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbde813" class="outline-5">
<h5 id="orgbde813">gteq_p &#x2013; greater then or equal to</h5>
<div class="outline-text-5" id="text-orgbde813">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'gteq?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">gteq_p</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> a &gt;= b
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1859f36" class="outline-4">
<h4 id="org1859f36">int_print</h4>
<div class="outline-text-4" id="text-org1859f36">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'int-print'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">int_print</span>(i):
    p_print(i)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga45c51f" class="outline-3">
<h3 id="orga45c51f"><b>bool</b></h3>
<div class="outline-text-3" id="text-orga45c51f">
</div><div id="outline-container-org8dcb765" class="outline-4">
<h4 id="org8dcb765">Bool</h4>
<div class="outline-text-4" id="text-org8dcb765">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'Bool'</span>)(<span style="color: #a6e22e;">bool</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org835d87a" class="outline-4">
<h4 id="org835d87a">basic</h4>
<div class="outline-text-4" id="text-org835d87a">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'true'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">true</span>():
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'false'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">false</span>():
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'not'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">p_not</span>(b):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #f92672; font-weight: bold;">not</span> b

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'and'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">p_and</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> (a <span style="color: #f92672; font-weight: bold;">and</span> b)

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'or'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">p_or</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> (a <span style="color: #f92672; font-weight: bold;">or</span> b)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf158587" class="outline-3">
<h3 id="orgf158587"><b>equivalence</b></h3>
<div class="outline-text-3" id="text-orgf158587">
</div><div id="outline-container-orge3a4cb" class="outline-4">
<h4 id="orge3a4cb">eq_p</h4>
<div class="outline-text-4" id="text-orge3a4cb">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'eq?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">eq_p</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">if</span> string_p(a):
        <span style="color: #f92672; font-weight: bold;">return</span> a == b
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> a <span style="color: #f92672; font-weight: bold;">is</span> b
</pre>
</div>
</div>
</div>

<div id="outline-container-orgecb8390" class="outline-4">
<h4 id="orgecb8390">eqv_p</h4>
<div class="outline-text-4" id="text-orgecb8390">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'eqv?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">eqv_p</span>(a, b):
    <span style="color: #f92672; font-weight: bold;">return</span> a == b
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org414ef7f" class="outline-3">
<h3 id="org414ef7f"><b>sexp</b></h3>
<div class="outline-text-3" id="text-org414ef7f">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'null'</span>)(null)
prim(<span style="color: #e6db74;">'null?'</span>)(null_p)

prim(<span style="color: #e6db74;">'cons'</span>)(cons)
prim(<span style="color: #e6db74;">'cons?'</span>)(cons_p)

prim(<span style="color: #e6db74;">'car'</span>)(car)
prim(<span style="color: #e6db74;">'cdr'</span>)(cdr)

prim(<span style="color: #e6db74;">'sexp-print'</span>)(sexp_print)
prim(<span style="color: #e6db74;">'sexp-list-print'</span>)(sexp_list_print)

prim(<span style="color: #e6db74;">'code-scan'</span>)(code_scan)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9113d0" class="outline-3">
<h3 id="orgf9113d0"><b>string</b></h3>
<div class="outline-text-3" id="text-orgf9113d0">
</div><div id="outline-container-org733b0aa" class="outline-4">
<h4 id="org733b0aa">String</h4>
<div class="outline-text-4" id="text-org733b0aa">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'String'</span>)(<span style="color: #a6e22e;">str</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org23c485b" class="outline-4">
<h4 id="org23c485b">string_p</h4>
<div class="outline-text-4" id="text-org23c485b">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'string?'</span>)(string_p)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3c6b45" class="outline-4">
<h4 id="orgf3c6b45">string_print</h4>
<div class="outline-text-4" id="text-orgf3c6b45">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'string-print'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">string_print</span>(string):
    p_print(string)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8551cea" class="outline-4">
<h4 id="org8551cea">string_length</h4>
<div class="outline-text-4" id="text-org8551cea">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'string_length'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">string_length</span>(string):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">len</span>(string)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb012de" class="outline-4">
<h4 id="orgbb012de">string_ref</h4>
<div class="outline-text-4" id="text-orgbb012de">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'string-ref'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">string_ref</span>(string, index):
    <span style="color: #f92672; font-weight: bold;">return</span> string[index]
</pre>
</div>
</div>
</div>
