jojo/jojo.org
***** string_append

      #+begin_src python
      @prim('string-append')
      def string_append(string1, string2):
          return "".join([string1, string2])
      #+end_src

***** string_slice

      #+begin_src python
      @prim('string-slice')
      def string_slice(string, begin, end):
          return string[begin:end]
      #+end_src

***** string_empty_p

      #+begin_src python
      @prim('string-empty?')
      def string_empty_p(string):
          return len(string) == 0
      #+end_src

***** string_eq_p

      #+begin_src python
      @prim('string-eq?')
      def string_eq_p(string1, string2):
          return string1 == string2
      #+end_src

***** string_to_int

      #+begin_src python
      @prim('string->int')
      def string_to_int(string):
          return int(string)
      #+end_src

***** string predicates

      #+begin_src python
      prim('int-string?')(int_string_p)
      prim('local-string?')(local_string_p)
      #+end_src

*** *vect*

***** [note]

      - vect is the pivot among :
        - list
        - dict
        - tuple
        - set

***** Vect

      #+begin_src python
      prim('Vect')(Vect)
      #+end_src

***** vect_p

      #+begin_src python
      prim('vect?')(vect_p)
      #+end_src

***** vect_copy

      #+begin_src python
      @prim('vect-copy')
      def vect_copy(vect):
          return vect[:]
      #+end_src

***** vect_member_p

      #+begin_src python
      @prim('vect-member?')
      def vect_member_p(x, vect):
          return x in vect
      #+end_src

***** vect_length

      #+begin_src python
      @prim('vect-length')
      def vect_length(vect):
          return len(vect)
      #+end_src

***** vect_ref

      #+begin_src python
      @prim('vect-ref')
      def vect_ref(vect, index):
          return vect[index]
      #+end_src

***** vect_append -- no-side-effect

      #+begin_src python
      @prim('vect-append')
      def vect_append(vect1, vect2):
          vect1_copy = vect_copy(vect1)
          vect1_copy.extend(vect2)
          return vect1_copy
      #+end_src

***** vect_zip_dict

      #+begin_src python
      @prim('vect-zip-dict')
      def vect_zip_dict(v1, v2):
          if len(v1) != len(v2):
              print("- vect_zip_dict fail")
              print("  length of vect1")
              print("    is not equal to length of vect2")
              print("  length of vect1 : {}".format(len(v1)))
              print("  length of vect2 : {}".format(len(v2)))
              print("  vect1 : {}".format(v1))
              print("  vect2 : {}".format(v2))
              error()
          d = {}
          for k, v in zip(v1, v2):
             d[k] = v
          return d
      #+end_src

***** vect_to_sexp

      #+begin_src python
      @prim('vect->sexp')
      def vect_to_sexp(vect):
          if vect == []:
              return null
          elif not vect_p(vect):
              return vect
          else:
              return cons(vect_to_sexp(vect[0]),
                          vect_to_sexp(vect[1:]))
      #+end_src

***** sexp_to_vect

      #+begin_src python
      @prim('sexp->vect')
      def sexp_to_vect(sexp):
          if string_p(sexp):
              return sexp
          sexp_vect = list_to_vect(sexp)
          result_vect = []
          for s in sexp_vect:
              result_vect.append(sexp_to_vect(s))
          return result_vect
      #+end_src

*** *stack*

***** stack

      #+begin_src python
      Stack = Vect

      prim('Stack')(Stack)
      #+end_src

