docs/jojo.html

<div id="outline-container-org3b8c36a" class="outline-4">
<h4 id="org3b8c36a">string_append</h4>
<div class="outline-text-4" id="text-org3b8c36a">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'string-append'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">string_append</span>(string1, string2):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #e6db74;">""</span>.join([string1, string2])
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdbd4a4d" class="outline-4">
<h4 id="orgdbd4a4d">string_slice</h4>
<div class="outline-text-4" id="text-orgdbd4a4d">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'string-slice'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">string_slice</span>(string, begin, end):
    <span style="color: #f92672; font-weight: bold;">return</span> string[begin:end]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf6726e" class="outline-4">
<h4 id="orgbf6726e">string_empty_p</h4>
<div class="outline-text-4" id="text-orgbf6726e">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'string-empty?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">string_empty_p</span>(string):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">len</span>(string) == 0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab3d9df" class="outline-4">
<h4 id="orgab3d9df">string_eq_p</h4>
<div class="outline-text-4" id="text-orgab3d9df">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'string-eq?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">string_eq_p</span>(string1, string2):
    <span style="color: #f92672; font-weight: bold;">return</span> string1 == string2
</pre>
</div>
</div>
</div>

<div id="outline-container-org9890cee" class="outline-4">
<h4 id="org9890cee">string_to_int</h4>
<div class="outline-text-4" id="text-org9890cee">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'string-&gt;int'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">string_to_int</span>(string):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">int</span>(string)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb0685d0" class="outline-4">
<h4 id="orgb0685d0">string predicates</h4>
<div class="outline-text-4" id="text-orgb0685d0">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'int-string?'</span>)(int_string_p)
prim(<span style="color: #e6db74;">'local-string?'</span>)(local_string_p)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf8795c8" class="outline-3">
<h3 id="orgf8795c8"><b>vect</b></h3>
<div class="outline-text-3" id="text-orgf8795c8">
</div><div id="outline-container-org4f93aa3" class="outline-4">
<h4 id="org4f93aa3"><span class="todo _note_">[note]</span> </h4>
<div class="outline-text-4" id="text-org4f93aa3">
<ul class="org-ul">
<li><p>vect is the pivot among :</p><p><ul class="org-ul"></p><p><li><p>list</p></li></p><p><li><p>dict</p></li></p><p><li><p>tuple</p></li></p><p><li><p>set</p></li></ul></p></li></ul>
</div>
</div>

<div id="outline-container-org1bdb24e" class="outline-4">
<h4 id="org1bdb24e">Vect</h4>
<div class="outline-text-4" id="text-org1bdb24e">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'Vect'</span>)(Vect)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5be39c9" class="outline-4">
<h4 id="org5be39c9">vect_p</h4>
<div class="outline-text-4" id="text-org5be39c9">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'vect?'</span>)(vect_p)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5331b48" class="outline-4">
<h4 id="org5331b48">vect_copy</h4>
<div class="outline-text-4" id="text-org5331b48">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'vect-copy'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">vect_copy</span>(vect):
    <span style="color: #f92672; font-weight: bold;">return</span> vect[:]
</pre>
</div>
</div>
</div>

<div id="outline-container-org910e3ce" class="outline-4">
<h4 id="org910e3ce">vect_member_p</h4>
<div class="outline-text-4" id="text-org910e3ce">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'vect-member?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">vect_member_p</span>(x, vect):
    <span style="color: #f92672; font-weight: bold;">return</span> x <span style="color: #f92672; font-weight: bold;">in</span> vect
</pre>
</div>
</div>
</div>

<div id="outline-container-org9eb0d0" class="outline-4">
<h4 id="org9eb0d0">vect_length</h4>
<div class="outline-text-4" id="text-org9eb0d0">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'vect-length'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">vect_length</span>(vect):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">len</span>(vect)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d14a75" class="outline-4">
<h4 id="org7d14a75">vect_ref</h4>
<div class="outline-text-4" id="text-org7d14a75">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'vect-ref'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">vect_ref</span>(vect, index):
    <span style="color: #f92672; font-weight: bold;">return</span> vect[index]
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b6eca4" class="outline-4">
<h4 id="org9b6eca4">vect_append &#x2013; no-side-effect</h4>
<div class="outline-text-4" id="text-org9b6eca4">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'vect-append'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">vect_append</span>(vect1, vect2):
    <span style="color: #fd971f;">vect1_copy</span> = vect_copy(vect1)
    vect1_copy.extend(vect2)
    <span style="color: #f92672; font-weight: bold;">return</span> vect1_copy
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b10110" class="outline-4">
<h4 id="org1b10110">vect_zip_dict</h4>
<div class="outline-text-4" id="text-org1b10110">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'vect-zip-dict'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">vect_zip_dict</span>(v1, v2):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">len</span>(v1) != <span style="color: #a6e22e;">len</span>(v2):
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- vect_zip_dict fail"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  length of vect1"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"    is not equal to length of vect2"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  length of vect1 : {}"</span>.<span style="color: #a6e22e;">format</span>(<span style="color: #a6e22e;">len</span>(v1)))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  length of vect2 : {}"</span>.<span style="color: #a6e22e;">format</span>(<span style="color: #a6e22e;">len</span>(v2)))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  vect1 : {}"</span>.<span style="color: #a6e22e;">format</span>(v1))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  vect2 : {}"</span>.<span style="color: #a6e22e;">format</span>(v2))
        error()
    <span style="color: #fd971f;">d</span> = {}
    <span style="color: #f92672; font-weight: bold;">for</span> k, v <span style="color: #f92672; font-weight: bold;">in</span> <span style="color: #a6e22e;">zip</span>(v1, v2):
       <span style="color: #fd971f;">d</span>[k] = v
    <span style="color: #f92672; font-weight: bold;">return</span> d
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf58cda8" class="outline-4">
<h4 id="orgf58cda8">vect_to_sexp</h4>
<div class="outline-text-4" id="text-orgf58cda8">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'vect-&gt;sexp'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">vect_to_sexp</span>(vect):
    <span style="color: #f92672; font-weight: bold;">if</span> vect == []:
        <span style="color: #f92672; font-weight: bold;">return</span> null
    <span style="color: #f92672; font-weight: bold;">elif</span> <span style="color: #f92672; font-weight: bold;">not</span> vect_p(vect):
        <span style="color: #f92672; font-weight: bold;">return</span> vect
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> cons(vect_to_sexp(vect[0]),
                    vect_to_sexp(vect[1:]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a1268a" class="outline-4">
<h4 id="org7a1268a">sexp_to_vect</h4>
<div class="outline-text-4" id="text-org7a1268a">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'sexp-&gt;vect'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">sexp_to_vect</span>(sexp):
    <span style="color: #f92672; font-weight: bold;">if</span> string_p(sexp):
        <span style="color: #f92672; font-weight: bold;">return</span> sexp
    <span style="color: #fd971f;">sexp_vect</span> = list_to_vect(sexp)
    <span style="color: #fd971f;">result_vect</span> = []
    <span style="color: #f92672; font-weight: bold;">for</span> s <span style="color: #f92672; font-weight: bold;">in</span> sexp_vect:
        result_vect.append(sexp_to_vect(s))
    <span style="color: #f92672; font-weight: bold;">return</span> result_vect
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org22fefac" class="outline-3">
<h3 id="org22fefac"><b>stack</b></h3>
<div class="outline-text-3" id="text-org22fefac">
</div><div id="outline-container-org3a952d0" class="outline-4">
<h4 id="org3a952d0">stack</h4>
<div class="outline-text-4" id="text-org3a952d0">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fd971f;">Stack</span> = Vect

prim(<span style="color: #e6db74;">'Stack'</span>)(Stack)
</pre>
</div>
</div>
</div>
