jojo/jojo.org
***** stack_p

      #+begin_src python
      @prim('stack?')
      def stack_p(x):
          return type(x) == Stack
      #+end_src

***** stack_pop

      #+begin_src python
      @prim('stack-pop')
      def stack_pop(stack):
          return stack.pop()
      #+end_src

***** stack_push

      #+begin_src python
      @prim('stack-push')
      def stack_push(value, stack):
          stack.append(value)
          return stack
      #+end_src

***** stack_drop

      #+begin_src python
      @prim('stack-drop')
      def stack_drop(stack):
          stack.pop()
          return stack
      #+end_src

***** stack_dup

      #+begin_src python
      @prim('stack-dup')
      def stack_dup(stack):
          a = stack.pop()
          stack.append(a)
          return stack
      #+end_src

***** stack_over

      #+begin_src python
      @prim('stack-over')
      def stack_over(stack):
          a = stack.pop()
          b = stack.pop()
          stack.append(b)
          stack.append(a)
          stack.append(b)
          return stack
      #+end_src

***** stack_tuck

      #+begin_src python
      @prim('stack-tuck')
      def stack_tuck(stack):
          a = stack.pop()
          b = stack.pop()
          stack.append(a)
          stack.append(b)
          stack.append(a)
          return stack
      #+end_src

***** stack_swap

      #+begin_src python
      @prim('stack-swap')
      def stack_swap(stack):
          a = stack.pop()
          b = stack.pop()
          stack.append(a)
          stack.append(b)
          return stack
      #+end_src

***** stack_length

      #+begin_src python
      @prim('stack-length')
      def stack_length(stack):
          return len(stack)
      #+end_src

***** stack_empty_p

      #+begin_src python
      @prim('stack-empty?')
      def stack_empty_p(stack):
          return len(stack) == 0
      #+end_src

*** *list*

***** Null & Cons

      #+begin_src python
      prim('<null>')(Null)
      prim('<cons>')(Cons)
      #+end_src

***** list_p

      #+begin_src python
      @prim('list?')
      def list_p(x):
          return null_p(x) or cons_p(x)
      #+end_src

***** vect_to_list

      #+begin_src python
      @prim('vect->list')
      def vect_to_list(vect):
          if vect == []:
              return null
          else:
              return cons(vect[0], vect_to_list(vect[1:]))
      #+end_src

***** list_to_vect

      #+begin_src python
      @prim('list->vect')
      def list_to_vect(l):
          vect = []
          while not null_p(l):
              vect.append(car(l))
              l = cdr(l)
          return vect
      #+end_src

***** list_length

      #+begin_src python
      def list_length(l):
          if null_p(l):
              return 0
          else:
              return list_length(cdr(l)) + 1
      #+end_src

***** list_ref

      #+begin_src python
      def list_ref(l, i):
          if null_p(l):
              print("- list_ref fail")
              print("  index greater then length of list")
              error()
          elif i == 0:
              return car(l)
          else:
              return list_ref(cdr(l), i-1)
      #+end_src

***** list_append

      #+begin_src python
      def list_append(ante, succ):
          if null_p(ante):
              return succ
          else:
              return cons(car(ante),
                          list_append(cdr (ante), succ))
      #+end_src

***** tail_cons

      #+begin_src python
      def tail_cons(ante, value):
          return list_append(ante, cons(value, null))
      #+end_src

