docs/jojo.html

<div id="outline-container-orgf0e8a7" class="outline-4">
<h4 id="orgf0e8a7">stack_p</h4>
<div class="outline-text-4" id="text-orgf0e8a7">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'stack?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">stack_p</span>(x):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">type</span>(x) == Stack
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e5587" class="outline-4">
<h4 id="org6e5587">stack_pop</h4>
<div class="outline-text-4" id="text-org6e5587">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'stack-pop'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">stack_pop</span>(stack):
    <span style="color: #f92672; font-weight: bold;">return</span> stack.pop()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc80b1bd" class="outline-4">
<h4 id="orgc80b1bd">stack_push</h4>
<div class="outline-text-4" id="text-orgc80b1bd">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'stack-push'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">stack_push</span>(value, stack):
    stack.append(value)
    <span style="color: #f92672; font-weight: bold;">return</span> stack
</pre>
</div>
</div>
</div>

<div id="outline-container-org11cf8b3" class="outline-4">
<h4 id="org11cf8b3">stack_drop</h4>
<div class="outline-text-4" id="text-org11cf8b3">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'stack-drop'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">stack_drop</span>(stack):
    stack.pop()
    <span style="color: #f92672; font-weight: bold;">return</span> stack
</pre>
</div>
</div>
</div>

<div id="outline-container-orgde4f849" class="outline-4">
<h4 id="orgde4f849">stack_dup</h4>
<div class="outline-text-4" id="text-orgde4f849">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'stack-dup'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">stack_dup</span>(stack):
    <span style="color: #fd971f;">a</span> = stack.pop()
    stack.append(a)
    <span style="color: #f92672; font-weight: bold;">return</span> stack
</pre>
</div>
</div>
</div>

<div id="outline-container-orga63cdde" class="outline-4">
<h4 id="orga63cdde">stack_over</h4>
<div class="outline-text-4" id="text-orga63cdde">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'stack-over'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">stack_over</span>(stack):
    <span style="color: #fd971f;">a</span> = stack.pop()
    <span style="color: #fd971f;">b</span> = stack.pop()
    stack.append(b)
    stack.append(a)
    stack.append(b)
    <span style="color: #f92672; font-weight: bold;">return</span> stack
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad0abfb" class="outline-4">
<h4 id="orgad0abfb">stack_tuck</h4>
<div class="outline-text-4" id="text-orgad0abfb">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'stack-tuck'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">stack_tuck</span>(stack):
    <span style="color: #fd971f;">a</span> = stack.pop()
    <span style="color: #fd971f;">b</span> = stack.pop()
    stack.append(a)
    stack.append(b)
    stack.append(a)
    <span style="color: #f92672; font-weight: bold;">return</span> stack
</pre>
</div>
</div>
</div>

<div id="outline-container-org572b73f" class="outline-4">
<h4 id="org572b73f">stack_swap</h4>
<div class="outline-text-4" id="text-org572b73f">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'stack-swap'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">stack_swap</span>(stack):
    <span style="color: #fd971f;">a</span> = stack.pop()
    <span style="color: #fd971f;">b</span> = stack.pop()
    stack.append(a)
    stack.append(b)
    <span style="color: #f92672; font-weight: bold;">return</span> stack
</pre>
</div>
</div>
</div>

<div id="outline-container-org88e5da4" class="outline-4">
<h4 id="org88e5da4">stack_length</h4>
<div class="outline-text-4" id="text-org88e5da4">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'stack-length'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">stack_length</span>(stack):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">len</span>(stack)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge91e831" class="outline-4">
<h4 id="orge91e831">stack_empty_p</h4>
<div class="outline-text-4" id="text-orge91e831">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'stack-empty?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">stack_empty_p</span>(stack):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">len</span>(stack) == 0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc241e16" class="outline-3">
<h3 id="orgc241e16"><b>list</b></h3>
<div class="outline-text-3" id="text-orgc241e16">
</div><div id="outline-container-orgada9b75" class="outline-4">
<h4 id="orgada9b75">Null &amp; Cons</h4>
<div class="outline-text-4" id="text-orgada9b75">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'&lt;null&gt;'</span>)(Null)
prim(<span style="color: #e6db74;">'&lt;cons&gt;'</span>)(Cons)
</pre>
</div>
</div>
</div>

<div id="outline-container-org93c302c" class="outline-4">
<h4 id="org93c302c">list_p</h4>
<div class="outline-text-4" id="text-org93c302c">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'list?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">list_p</span>(x):
    <span style="color: #f92672; font-weight: bold;">return</span> null_p(x) <span style="color: #f92672; font-weight: bold;">or</span> cons_p(x)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae27e63" class="outline-4">
<h4 id="orgae27e63">vect_to_list</h4>
<div class="outline-text-4" id="text-orgae27e63">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'vect-&gt;list'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">vect_to_list</span>(vect):
    <span style="color: #f92672; font-weight: bold;">if</span> vect == []:
        <span style="color: #f92672; font-weight: bold;">return</span> null
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> cons(vect[0], vect_to_list(vect[1:]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaab0ab9" class="outline-4">
<h4 id="orgaab0ab9">list_to_vect</h4>
<div class="outline-text-4" id="text-orgaab0ab9">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'list-&gt;vect'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">list_to_vect</span>(l):
    <span style="color: #fd971f;">vect</span> = []
    <span style="color: #f92672; font-weight: bold;">while</span> <span style="color: #f92672; font-weight: bold;">not</span> null_p(l):
        vect.append(car(l))
        <span style="color: #fd971f;">l</span> = cdr(l)
    <span style="color: #f92672; font-weight: bold;">return</span> vect
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef86525" class="outline-4">
<h4 id="orgef86525">list_length</h4>
<div class="outline-text-4" id="text-orgef86525">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">list_length</span>(l):
    <span style="color: #f92672; font-weight: bold;">if</span> null_p(l):
        <span style="color: #f92672; font-weight: bold;">return</span> 0
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> list_length(cdr(l)) + 1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc9e32b4" class="outline-4">
<h4 id="orgc9e32b4">list_ref</h4>
<div class="outline-text-4" id="text-orgc9e32b4">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">list_ref</span>(l, i):
    <span style="color: #f92672; font-weight: bold;">if</span> null_p(l):
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- list_ref fail"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  index greater then length of list"</span>)
        error()
    <span style="color: #f92672; font-weight: bold;">elif</span> i == 0:
        <span style="color: #f92672; font-weight: bold;">return</span> car(l)
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> list_ref(cdr(l), i-1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfbaaa7b" class="outline-4">
<h4 id="orgfbaaa7b">list_append</h4>
<div class="outline-text-4" id="text-orgfbaaa7b">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">list_append</span>(ante, succ):
    <span style="color: #f92672; font-weight: bold;">if</span> null_p(ante):
        <span style="color: #f92672; font-weight: bold;">return</span> succ
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> cons(car(ante),
                    list_append(cdr (ante), succ))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1168c5d" class="outline-4">
<h4 id="org1168c5d">tail_cons</h4>
<div class="outline-text-4" id="text-org1168c5d">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">tail_cons</span>(ante, value):
    <span style="color: #f92672; font-weight: bold;">return</span> list_append(ante, cons(value, null))
</pre>
</div>
</div>
</div>
