jojo/jojo.org
***** list_zip_dict

      #+begin_src python
      @prim('list-zip-dict')
      def list_zip_dict(l1, l2):
          v1 = list_to_vect(l1)
          v2 = list_to_vect(l2)
          return vect_zip_dict(v1, v2)
      #+end_src

*** *dict*

***** Dict

      #+begin_src python
      Dict = dict

      prim('Dict')(Dict)
      #+end_src

***** dict_p

      #+begin_src python
      @prim('dict?')
      def dict_p(x):
          return type(x) == Dict
      #+end_src

***** dict_copy

      #+begin_src python
      @prim('dict-copy')
      def dict_copy(d):
          return d.copy()
      #+end_src

***** vect_to_dict

      #+begin_src python
      @prim('vect->dict')
      def vect_to_dict(vect):
          length = len(vect)
          if length % 2 != 0:
              print("- vect->dict fail")
              print("  length of vect must be even")
              print("  length : {}".format(length))
              print("  vect : {}".format(vect))
              error()

          d = {}
          i = 0
          while i < length:
              k = vect[i]
              v = vect[i+1]
              d[k] = v
              i = i + 2

          return d
      #+end_src

***** dict_length

      #+begin_src python
      @prim('dict-length')
      def dict_length(d):
          return len(d)
      #+end_src

***** dict_find

      #+begin_src python
      @prim('dict-find')
      def dict_find(d, k):
          try:
              return VALUES(d[k], True)
          except KeyError:
              return False
      #+end_src

***** dict_update -- no-side-effect

      #+begin_src python
      @prim('dict-update')
      def dict_update(d1, d2):
          d1 = dict_copy(d1)
          return d1.update(d2)
      #+end_src

***** dict_delete -- no-side-effect

      #+begin_src python
      @prim('dict-delete')
      def dict_delete(d, k):
          d = dict_copy(d)
          del d[k]
          return d
      #+end_src

*** *tuple*

***** Tuple

      #+begin_src python
      prim('Tuple')(tuple)
      #+end_src

***** tuple_p

      #+begin_src python
      @prim('tuple?')
      def tuple_p(x):
          return type(x) == tuple
      #+end_src

***** vect_to_tuple

      #+begin_src python
      @prim('vect->tuple')
      def vect_to_tuple(vect):
          return tuple(vect)
      #+end_src

***** tuple_to_vect

      #+begin_src python
      @prim('tuple->vect')
      def tuple_to_vect(tu):
          return Vect(tu)
      #+end_src

***** tuple_length

      #+begin_src python
      @prim('tuple-length')
      def tuple_length(tu):
          return len(tu)
      #+end_src

***** tuple_ref

      #+begin_src python
      @prim('tuple-ref')
      def tuple_ref(tu, index):
          return tu[index]
      #+end_src

***** tuple_append

      #+begin_src python
      @prim('tuple-append')
      def tuple_append(tu1, tu2):
          vect1 = Vect(tu1)
          vect1.extend(tu2)
          return tuple(vect1)
      #+end_src

*** *set*

***** Set

      #+begin_src python
      prim('Set')(set)
      #+end_src

***** set_p

      #+begin_src python
      @prim('set?')
      def set_p(x):
          return type(x) == set
      #+end_src

***** vect_to_set

      #+begin_src python
      @prim('vect->set')
      def vect_to_set(vect):
          return set(vect)
      #+end_src

***** set_to_vect

      #+begin_src python
      @prim('set->vect')
      def set_to_vect(s):
          return Vect(s)
      #+end_src

