docs/jojo.html

<div id="outline-container-org525473b" class="outline-4">
<h4 id="org525473b">list_zip_dict</h4>
<div class="outline-text-4" id="text-org525473b">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'list-zip-dict'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">list_zip_dict</span>(l1, l2):
    <span style="color: #fd971f;">v1</span> = list_to_vect(l1)
    <span style="color: #fd971f;">v2</span> = list_to_vect(l2)
    <span style="color: #f92672; font-weight: bold;">return</span> vect_zip_dict(v1, v2)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9b5ccc1" class="outline-3">
<h3 id="org9b5ccc1"><b>dict</b></h3>
<div class="outline-text-3" id="text-org9b5ccc1">
</div><div id="outline-container-org81257fe" class="outline-4">
<h4 id="org81257fe">Dict</h4>
<div class="outline-text-4" id="text-org81257fe">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fd971f;">Dict</span> = <span style="color: #a6e22e;">dict</span>

prim(<span style="color: #e6db74;">'Dict'</span>)(Dict)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf7754b4" class="outline-4">
<h4 id="orgf7754b4">dict_p</h4>
<div class="outline-text-4" id="text-orgf7754b4">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'dict?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">dict_p</span>(x):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">type</span>(x) == Dict
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ce98b0" class="outline-4">
<h4 id="org8ce98b0">dict_copy</h4>
<div class="outline-text-4" id="text-org8ce98b0">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'dict-copy'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">dict_copy</span>(d):
    <span style="color: #f92672; font-weight: bold;">return</span> d.copy()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4a7206" class="outline-4">
<h4 id="orgf4a7206">vect_to_dict</h4>
<div class="outline-text-4" id="text-orgf4a7206">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'vect-&gt;dict'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">vect_to_dict</span>(vect):
    <span style="color: #fd971f;">length</span> = <span style="color: #a6e22e;">len</span>(vect)
    <span style="color: #f92672; font-weight: bold;">if</span> length % 2 != 0:
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- vect-&gt;dict fail"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  length of vect must be even"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  length : {}"</span>.<span style="color: #a6e22e;">format</span>(length))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  vect : {}"</span>.<span style="color: #a6e22e;">format</span>(vect))
        error()

    <span style="color: #fd971f;">d</span> = {}
    <span style="color: #fd971f;">i</span> = 0
    <span style="color: #f92672; font-weight: bold;">while</span> i &lt; length:
        <span style="color: #fd971f;">k</span> = vect[i]
        <span style="color: #fd971f;">v</span> = vect[i+1]
        <span style="color: #fd971f;">d</span>[k] = v
        <span style="color: #fd971f;">i</span> = i + 2

    <span style="color: #f92672; font-weight: bold;">return</span> d
</pre>
</div>
</div>
</div>

<div id="outline-container-org7dd6082" class="outline-4">
<h4 id="org7dd6082">dict_length</h4>
<div class="outline-text-4" id="text-org7dd6082">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'dict-length'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">dict_length</span>(d):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">len</span>(d)
</pre>
</div>
</div>
</div>

<div id="outline-container-org50b78a7" class="outline-4">
<h4 id="org50b78a7">dict_find</h4>
<div class="outline-text-4" id="text-org50b78a7">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'dict-find'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">dict_find</span>(d, k):
    <span style="color: #f92672; font-weight: bold;">try</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> VALUES(d[k], <span style="color: #ae81ff;">True</span>)
    <span style="color: #f92672; font-weight: bold;">except</span> <span style="color: #66d9ef; font-weight: bold;">KeyError</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org36d6cdc" class="outline-4">
<h4 id="org36d6cdc">dict_update &#x2013; no-side-effect</h4>
<div class="outline-text-4" id="text-org36d6cdc">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'dict-update'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">dict_update</span>(d1, d2):
    <span style="color: #fd971f;">d1</span> = dict_copy(d1)
    <span style="color: #f92672; font-weight: bold;">return</span> d1.update(d2)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e1a8b1" class="outline-4">
<h4 id="org5e1a8b1">dict_delete &#x2013; no-side-effect</h4>
<div class="outline-text-4" id="text-org5e1a8b1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'dict-delete'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">dict_delete</span>(d, k):
    <span style="color: #fd971f;">d</span> = dict_copy(d)
    <span style="color: #f92672; font-weight: bold;">del</span> d[k]
    <span style="color: #f92672; font-weight: bold;">return</span> d
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc9efe3" class="outline-3">
<h3 id="orgc9efe3"><b>tuple</b></h3>
<div class="outline-text-3" id="text-orgc9efe3">
</div><div id="outline-container-org807117e" class="outline-4">
<h4 id="org807117e">Tuple</h4>
<div class="outline-text-4" id="text-org807117e">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'Tuple'</span>)(<span style="color: #a6e22e;">tuple</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a75563" class="outline-4">
<h4 id="org9a75563">tuple_p</h4>
<div class="outline-text-4" id="text-org9a75563">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'tuple?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">tuple_p</span>(x):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">type</span>(x) == <span style="color: #a6e22e;">tuple</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org22b5184" class="outline-4">
<h4 id="org22b5184">vect_to_tuple</h4>
<div class="outline-text-4" id="text-org22b5184">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'vect-&gt;tuple'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">vect_to_tuple</span>(vect):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">tuple</span>(vect)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc63262b" class="outline-4">
<h4 id="orgc63262b">tuple_to_vect</h4>
<div class="outline-text-4" id="text-orgc63262b">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'tuple-&gt;vect'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">tuple_to_vect</span>(tu):
    <span style="color: #f92672; font-weight: bold;">return</span> Vect(tu)
</pre>
</div>
</div>
</div>

<div id="outline-container-org320e7e8" class="outline-4">
<h4 id="org320e7e8">tuple_length</h4>
<div class="outline-text-4" id="text-org320e7e8">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'tuple-length'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">tuple_length</span>(tu):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">len</span>(tu)
</pre>
</div>
</div>
</div>

<div id="outline-container-org91031d5" class="outline-4">
<h4 id="org91031d5">tuple_ref</h4>
<div class="outline-text-4" id="text-org91031d5">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'tuple-ref'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">tuple_ref</span>(tu, index):
    <span style="color: #f92672; font-weight: bold;">return</span> tu[index]
</pre>
</div>
</div>
</div>

<div id="outline-container-org381b714" class="outline-4">
<h4 id="org381b714">tuple_append</h4>
<div class="outline-text-4" id="text-org381b714">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'tuple-append'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">tuple_append</span>(tu1, tu2):
    <span style="color: #fd971f;">vect1</span> = Vect(tu1)
    vect1.extend(tu2)
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">tuple</span>(vect1)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbb165ee" class="outline-3">
<h3 id="orgbb165ee"><b>set</b></h3>
<div class="outline-text-3" id="text-orgbb165ee">
</div><div id="outline-container-orge0a2195" class="outline-4">
<h4 id="orge0a2195">Set</h4>
<div class="outline-text-4" id="text-orge0a2195">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'Set'</span>)(<span style="color: #a6e22e;">set</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6fbc302" class="outline-4">
<h4 id="org6fbc302">set_p</h4>
<div class="outline-text-4" id="text-org6fbc302">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'set?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_p</span>(x):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">type</span>(x) == <span style="color: #a6e22e;">set</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org23cd41f" class="outline-4">
<h4 id="org23cd41f">vect_to_set</h4>
<div class="outline-text-4" id="text-org23cd41f">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'vect-&gt;set'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">vect_to_set</span>(vect):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">set</span>(vect)
</pre>
</div>
</div>
</div>
