jojo/jojo.org
***** set_length

      #+begin_src python
      @prim('set-length')
      def set_length(s):
          return len(s)
      #+end_src

***** set_member_p

      #+begin_src python
      @prim('set-member?')
      def set_member_p(x, s):
          return x in s
      #+end_src

***** high school

      #+begin_src python
      @prim('set-disjoint?')
      def set_disjoint_p(s1, s2):
          return s1.isdisjoint(s2)

      @prim('set-subset?')
      def set_subset_p(s1, s2):
          return s1.issubset(s2)

      @prim('set-superset?')
      def set_superset_p(s1, s2):
          return s1.issuperset(s2)

      @prim('set-union')
      def set_union(s1, s2):
          return s1.union(s2)

      @prim('set-intersection')
      def set_intersection(s1, s2):
          return s1.intersection(s2)

      @prim('set-difference')
      def set_difference(s1, s2):
          return s1.difference(s2)

      @prim('set-symmetric-difference')
      def set_symmetric_difference(s1, s2):
          return s1.symmetric_difference(s2)
      #+end_src

*** *io*

***** print

      #+begin_src python
      prim('print')(p_print)
      #+end_src

***** nl -- newline

      #+begin_src python
      @prim('newline')
      def newline():
          print("")

      prim('nl')(newline)
      #+end_src

***** space

      #+begin_src python
      @prim('space')
      def space():
          p_print(" ")
      #+end_src

*** *sys*

***** bye

      #+begin_src python
      @prim('bye')
      def bye():
          print("bye bye ^-^/")
          sys.exit()
      #+end_src

*** *repl*

***** read_sexp

******* read_char

        #+begin_src python
        def read_char(char_stack):
            if len(char_stack) == 0:
                return sys.stdin.read(1)
            else:
                return char_stack.pop()
        #+end_src

******* read_string

        #+begin_src python
        def read_string(char_stack):
            char_vect = []
            collecting_bytes_p = False

            while True:
                char = read_char(char_stack)
                if not collecting_bytes_p:
                    if space_p(char):
                        pass
                    elif doublequote_p(char):
                        return read_doublequoted_string(char_stack)
                    elif delimiter_p(char):
                        char_vect.append(char)
                        break
                    else:
                        char_vect.append(char)
                        collecting_bytes_p = True

                else:
                    if (doublequote_p(char) or
                        delimiter_p(char) or
                        space_p(char)):
                        char_stack.append(char)
                        break
                    else:
                        char_vect.append(char)

            return "".join(char_vect)
        #+end_src

******* read_doublequoted_string

        #+begin_src python
        def read_doublequoted_string(char_stack):
            char_vect = []
            char_vect.append('"')
            while True:
                char = read_char(char_stack)
                if char == '"':
                    break
                else:
                    char_vect.append(char)
            char_vect.append('"')
            return "".join(char_vect)
        #+end_src

