docs/jojo.html

<div id="outline-container-org2962c05" class="outline-4">
<h4 id="org2962c05">set_to_vect</h4>
<div class="outline-text-4" id="text-org2962c05">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'set-&gt;vect'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_to_vect</span>(s):
    <span style="color: #f92672; font-weight: bold;">return</span> Vect(s)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda9f568" class="outline-4">
<h4 id="orgda9f568">set_length</h4>
<div class="outline-text-4" id="text-orgda9f568">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'set-length'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_length</span>(s):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">len</span>(s)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6a8cc0" class="outline-4">
<h4 id="orgd6a8cc0">set_member_p</h4>
<div class="outline-text-4" id="text-orgd6a8cc0">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'set-member?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_member_p</span>(x, s):
    <span style="color: #f92672; font-weight: bold;">return</span> x <span style="color: #f92672; font-weight: bold;">in</span> s
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf41d128" class="outline-4">
<h4 id="orgf41d128">high school</h4>
<div class="outline-text-4" id="text-orgf41d128">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'set-disjoint?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_disjoint_p</span>(s1, s2):
    <span style="color: #f92672; font-weight: bold;">return</span> s1.isdisjoint(s2)

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'set-subset?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_subset_p</span>(s1, s2):
    <span style="color: #f92672; font-weight: bold;">return</span> s1.issubset(s2)

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'set-superset?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_superset_p</span>(s1, s2):
    <span style="color: #f92672; font-weight: bold;">return</span> s1.issuperset(s2)

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'set-union'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_union</span>(s1, s2):
    <span style="color: #f92672; font-weight: bold;">return</span> s1.union(s2)

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'set-intersection'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_intersection</span>(s1, s2):
    <span style="color: #f92672; font-weight: bold;">return</span> s1.intersection(s2)

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'set-difference'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_difference</span>(s1, s2):
    <span style="color: #f92672; font-weight: bold;">return</span> s1.difference(s2)

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'set-symmetric-difference'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">set_symmetric_difference</span>(s1, s2):
    <span style="color: #f92672; font-weight: bold;">return</span> s1.symmetric_difference(s2)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org43b25a8" class="outline-3">
<h3 id="org43b25a8"><b>io</b></h3>
<div class="outline-text-3" id="text-org43b25a8">
</div><div id="outline-container-org8fbf06b" class="outline-4">
<h4 id="org8fbf06b">print</h4>
<div class="outline-text-4" id="text-org8fbf06b">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'print'</span>)(p_print)
</pre>
</div>
</div>
</div>

<div id="outline-container-org151c3f6" class="outline-4">
<h4 id="org151c3f6">nl &#x2013; newline</h4>
<div class="outline-text-4" id="text-org151c3f6">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'newline'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">newline</span>():
    <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">""</span>)

prim(<span style="color: #e6db74;">'nl'</span>)(newline)
</pre>
</div>
</div>
</div>

<div id="outline-container-orged6552" class="outline-4">
<h4 id="orged6552">space</h4>
<div class="outline-text-4" id="text-orged6552">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'space'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">space</span>():
    p_print(<span style="color: #e6db74;">" "</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org50bb495" class="outline-3">
<h3 id="org50bb495"><b>sys</b></h3>
<div class="outline-text-3" id="text-org50bb495">
</div><div id="outline-container-orgb51ce5a" class="outline-4">
<h4 id="orgb51ce5a">bye</h4>
<div class="outline-text-4" id="text-orgb51ce5a">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'bye'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">bye</span>():
    <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"bye bye ^-^/"</span>)
    sys.<span style="color: #ae81ff;">exit</span>()
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org78b5c70" class="outline-3">
<h3 id="org78b5c70"><b>repl</b></h3>
<div class="outline-text-3" id="text-org78b5c70">
</div><div id="outline-container-org4b3d313" class="outline-4">
<h4 id="org4b3d313">read_sexp</h4>
<div class="outline-text-4" id="text-org4b3d313">
</div><div id="outline-container-orge7af1fd" class="outline-5">
<h5 id="orge7af1fd">read_char</h5>
<div class="outline-text-5" id="text-orge7af1fd">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">read_char</span>(char_stack):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">len</span>(char_stack) == 0:
        <span style="color: #f92672; font-weight: bold;">return</span> sys.stdin.read(1)
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> char_stack.pop()
</pre>
</div>
</div>
</div>

<div id="outline-container-org380f80a" class="outline-5">
<h5 id="org380f80a">read_string</h5>
<div class="outline-text-5" id="text-org380f80a">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">read_string</span>(char_stack):
    <span style="color: #fd971f;">char_vect</span> = []
    <span style="color: #fd971f;">collecting_bytes_p</span> = <span style="color: #ae81ff;">False</span>

    <span style="color: #f92672; font-weight: bold;">while</span> <span style="color: #ae81ff;">True</span>:
        <span style="color: #fd971f;">char</span> = read_char(char_stack)
        <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> collecting_bytes_p:
            <span style="color: #f92672; font-weight: bold;">if</span> space_p(char):
                <span style="color: #f92672; font-weight: bold;">pass</span>
            <span style="color: #f92672; font-weight: bold;">elif</span> doublequote_p(char):
                <span style="color: #f92672; font-weight: bold;">return</span> read_doublequoted_string(char_stack)
            <span style="color: #f92672; font-weight: bold;">elif</span> delimiter_p(char):
                char_vect.append(char)
                <span style="color: #f92672; font-weight: bold;">break</span>
            <span style="color: #f92672; font-weight: bold;">else</span>:
                char_vect.append(char)
                <span style="color: #fd971f;">collecting_bytes_p</span> = <span style="color: #ae81ff;">True</span>

        <span style="color: #f92672; font-weight: bold;">else</span>:
            <span style="color: #f92672; font-weight: bold;">if</span> (doublequote_p(char) <span style="color: #f92672; font-weight: bold;">or</span>
                delimiter_p(char) <span style="color: #f92672; font-weight: bold;">or</span>
                space_p(char)):
                char_stack.append(char)
                <span style="color: #f92672; font-weight: bold;">break</span>
            <span style="color: #f92672; font-weight: bold;">else</span>:
                char_vect.append(char)

    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #e6db74;">""</span>.join(char_vect)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc410fe8" class="outline-5">
<h5 id="orgc410fe8">read_doublequoted_string</h5>
<div class="outline-text-5" id="text-orgc410fe8">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">read_doublequoted_string</span>(char_stack):
    <span style="color: #fd971f;">char_vect</span> = []
    char_vect.append(<span style="color: #e6db74;">'"'</span>)
    <span style="color: #f92672; font-weight: bold;">while</span> <span style="color: #ae81ff;">True</span>:
        <span style="color: #fd971f;">char</span> = read_char(char_stack)
        <span style="color: #f92672; font-weight: bold;">if</span> char == <span style="color: #e6db74;">'"'</span>:
            <span style="color: #f92672; font-weight: bold;">break</span>
        <span style="color: #f92672; font-weight: bold;">else</span>:
            char_vect.append(char)
    char_vect.append(<span style="color: #e6db74;">'"'</span>)
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #e6db74;">""</span>.join(char_vect)
</pre>
</div>
</div>
</div>
