jojo/jojo.org
******* read_sexp

        - with a char_stack,
          read a sexp from stdin.

        #+begin_src python
        def read_sexp(char_stack):
            string = read_string(char_stack)
            if string == '(':
                sexp_list = read_sexp_list_until_ket(char_stack, ')')
                return sexp_list
            elif string == '[':
                sexp_list = read_sexp_list_until_ket(char_stack, ']')
                return cons('begin', sexp_list)
            elif string == '{':
                sexp_list = read_sexp_list_until_ket(char_stack, '}')
                return cons('clo', sexp_list)
            elif string == '"':
                return read_doublequoted_string(char_stack)
            elif string == "'":
                sexp = read_sexp(char_stack)
                return cons('quote', cons(sexp, null))
            elif string == "`":
                sexp = read_sexp(char_stack)
                return cons('partquote', cons(sexp, null))
            else:
                return string
        #+end_src

******* read_sexp_list_until_ket

        #+begin_src python
        def read_sexp_list_until_ket(char_stack, ket):
            string = read_string(char_stack)
            if string == ket:
                return null
            else:
                char_vect = Vect(string)
                char_vect.reverse()
                char_stack.extend(char_vect)
                sexp = read_sexp(char_stack)
                recur = read_sexp_list_until_ket(char_stack, ket)
                return cons(sexp, recur)
        #+end_src

***** print_data_stack

      #+begin_src python
      def print_data_stack(ds):
          p_print("  * {} *  ".format(len(ds)))
          print(ds)
      #+end_src

***** print_return_stack

******* print_return_stack

        #+begin_src python
        def print_return_stack(rs):
            print("- return-stack * {} *".format(len(rs)))
            for rp in rs:
                return_point_print(rp)
        #+end_src

******* return_point_print

        #+begin_src python
        def return_point_print(rp):
            p_print("  - progress : {} / {}".format(rp.cursor, rp.length))
            newline()

            next_cursor = rp.cursor
            last_cursor = rp.cursor - 1

            if last_cursor == 0:
                pass
            else:
                p_print("    pass : ")
                i = 0
                while i < last_cursor:
                    jo_print(rp.body[i])
                    space()
                    i = i + 1
                newline()

            p_print("    last : ")
            jo_print(rp.body[last_cursor])
            newline()

            if next_cursor == rp.length:
                pass
            else:
                p_print("    next : ")
                i = next_cursor
                while i < rp.length:
                    jo_print(rp.body[i])
                    space()
                    i = i + 1
                newline()

            if len(rp.lr) == 0:
               pass
            else:
               p_print("    where : {}".format(rp.lr))
               newline()
        #+end_src

******* jo_print

        #+begin_src python
        def jo_print(jo):
            if fun_p(jo):
                p_print(jo.__module__)
                p_print(".")
                p_print(jo.__name__)
            elif hasattr(jo, "jo_print"):
                jo.jo_print()
            else:
                p_print(jo)
        #+end_src

***** module_repl

******* [note]

        - a repl_char_stack is added to the module,
          for reading sexp one by one.

******* module_repl

        #+begin_src python
        def module_repl(module):
            module.repl_char_stack = []
            print_data_stack(module.vm.ds)
            try:
                while True:
                    module_repl_one_step(module)
            except KeyboardInterrupt:
                return
            except EXIT_MODULE_REPL:
                return
        #+end_src

******* EXIT_MODULE_REPL

        #+begin_src python
        class EXIT_MODULE_REPL(Exception):
            pass
        #+end_src

