docs/jojo.html

<div id="outline-container-orgc40a2e" class="outline-5">
<h5 id="orgc40a2e">read_sexp</h5>
<div class="outline-text-5" id="text-orgc40a2e">
<ul class="org-ul">
<li><p>with a char_stack,</p><p>read a sexp from stdin.</p></li></ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">read_sexp</span>(char_stack):
    <span style="color: #fd971f;">string</span> = read_string(char_stack)
    <span style="color: #f92672; font-weight: bold;">if</span> string == <span style="color: #e6db74;">'('</span>:
        <span style="color: #fd971f;">sexp_list</span> = read_sexp_list_until_ket(char_stack, <span style="color: #e6db74;">')'</span>)
        <span style="color: #f92672; font-weight: bold;">return</span> sexp_list
    <span style="color: #f92672; font-weight: bold;">elif</span> string == <span style="color: #e6db74;">'['</span>:
        <span style="color: #fd971f;">sexp_list</span> = read_sexp_list_until_ket(char_stack, <span style="color: #e6db74;">']'</span>)
        <span style="color: #f92672; font-weight: bold;">return</span> cons(<span style="color: #e6db74;">'begin'</span>, sexp_list)
    <span style="color: #f92672; font-weight: bold;">elif</span> string == <span style="color: #e6db74;">'{'</span>:
        <span style="color: #fd971f;">sexp_list</span> = read_sexp_list_until_ket(char_stack, <span style="color: #e6db74;">'}'</span>)
        <span style="color: #f92672; font-weight: bold;">return</span> cons(<span style="color: #e6db74;">'clo'</span>, sexp_list)
    <span style="color: #f92672; font-weight: bold;">elif</span> string == <span style="color: #e6db74;">'"'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> read_doublequoted_string(char_stack)
    <span style="color: #f92672; font-weight: bold;">elif</span> string == <span style="color: #e6db74;">"'"</span>:
        <span style="color: #fd971f;">sexp</span> = read_sexp(char_stack)
        <span style="color: #f92672; font-weight: bold;">return</span> cons(<span style="color: #e6db74;">'quote'</span>, cons(sexp, null))
    <span style="color: #f92672; font-weight: bold;">elif</span> string == <span style="color: #e6db74;">"`"</span>:
        <span style="color: #fd971f;">sexp</span> = read_sexp(char_stack)
        <span style="color: #f92672; font-weight: bold;">return</span> cons(<span style="color: #e6db74;">'partquote'</span>, cons(sexp, null))
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> string
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdeabe8d" class="outline-5">
<h5 id="orgdeabe8d">read_sexp_list_until_ket</h5>
<div class="outline-text-5" id="text-orgdeabe8d">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">read_sexp_list_until_ket</span>(char_stack, ket):
    <span style="color: #fd971f;">string</span> = read_string(char_stack)
    <span style="color: #f92672; font-weight: bold;">if</span> string == ket:
        <span style="color: #f92672; font-weight: bold;">return</span> null
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #fd971f;">char_vect</span> = Vect(string)
        char_vect.reverse()
        char_stack.extend(char_vect)
        <span style="color: #fd971f;">sexp</span> = read_sexp(char_stack)
        <span style="color: #fd971f;">recur</span> = read_sexp_list_until_ket(char_stack, ket)
        <span style="color: #f92672; font-weight: bold;">return</span> cons(sexp, recur)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org105a2fc" class="outline-4">
<h4 id="org105a2fc">print_data_stack</h4>
<div class="outline-text-4" id="text-org105a2fc">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">print_data_stack</span>(ds):
    p_print(<span style="color: #e6db74;">"  * {} *  "</span>.<span style="color: #a6e22e;">format</span>(<span style="color: #a6e22e;">len</span>(ds)))
    <span style="color: #f92672; font-weight: bold;">print</span>(ds)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b8e003" class="outline-4">
<h4 id="org5b8e003">print_return_stack</h4>
<div class="outline-text-4" id="text-org5b8e003">
</div><div id="outline-container-org3585476" class="outline-5">
<h5 id="org3585476">print_return_stack</h5>
<div class="outline-text-5" id="text-org3585476">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">print_return_stack</span>(rs):
    <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- return-stack * {} *"</span>.<span style="color: #a6e22e;">format</span>(<span style="color: #a6e22e;">len</span>(rs)))
    <span style="color: #f92672; font-weight: bold;">for</span> rp <span style="color: #f92672; font-weight: bold;">in</span> rs:
        return_point_print(rp)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1da9331" class="outline-5">
<h5 id="org1da9331">return_point_print</h5>
<div class="outline-text-5" id="text-org1da9331">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">return_point_print</span>(rp):
    p_print(<span style="color: #e6db74;">"  - progress : {} / {}"</span>.<span style="color: #a6e22e;">format</span>(rp.cursor, rp.length))
    newline()

    <span style="color: #fd971f;">next_cursor</span> = rp.cursor
    <span style="color: #fd971f;">last_cursor</span> = rp.cursor - 1

    <span style="color: #f92672; font-weight: bold;">if</span> last_cursor == 0:
        <span style="color: #f92672; font-weight: bold;">pass</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
        p_print(<span style="color: #e6db74;">"    pass : "</span>)
        <span style="color: #fd971f;">i</span> = 0
        <span style="color: #f92672; font-weight: bold;">while</span> i &lt; last_cursor:
            jo_print(rp.body[i])
            space()
            <span style="color: #fd971f;">i</span> = i + 1
        newline()

    p_print(<span style="color: #e6db74;">"    last : "</span>)
    jo_print(rp.body[last_cursor])
    newline()

    <span style="color: #f92672; font-weight: bold;">if</span> next_cursor == rp.length:
        <span style="color: #f92672; font-weight: bold;">pass</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
        p_print(<span style="color: #e6db74;">"    next : "</span>)
        <span style="color: #fd971f;">i</span> = next_cursor
        <span style="color: #f92672; font-weight: bold;">while</span> i &lt; rp.length:
            jo_print(rp.body[i])
            space()
            <span style="color: #fd971f;">i</span> = i + 1
        newline()

    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">len</span>(rp.lr) == 0:
       <span style="color: #f92672; font-weight: bold;">pass</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
       p_print(<span style="color: #e6db74;">"    where : {}"</span>.<span style="color: #a6e22e;">format</span>(rp.lr))
       newline()
</pre>
</div>
</div>
</div>

<div id="outline-container-org281ccd3" class="outline-5">
<h5 id="org281ccd3">jo_print</h5>
<div class="outline-text-5" id="text-org281ccd3">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">jo_print</span>(jo):
    <span style="color: #f92672; font-weight: bold;">if</span> fun_p(jo):
        p_print(jo.__module__)
        p_print(<span style="color: #e6db74;">"."</span>)
        p_print(jo.<span style="color: #a6e22e;">__name__</span>)
    <span style="color: #f92672; font-weight: bold;">elif</span> <span style="color: #a6e22e;">hasattr</span>(jo, <span style="color: #e6db74;">"jo_print"</span>):
        jo.jo_print()
    <span style="color: #f92672; font-weight: bold;">else</span>:
        p_print(jo)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8e34742" class="outline-4">
<h4 id="org8e34742">module_repl</h4>
<div class="outline-text-4" id="text-org8e34742">
</div><div id="outline-container-org20665a0" class="outline-5">
<h5 id="org20665a0"><span class="todo _note_">[note]</span> </h5>
<div class="outline-text-5" id="text-org20665a0">
<ul class="org-ul">
<li><p>a repl_char_stack is added to the module,</p><p>for reading sexp one by one.</p></li></ul>
</div>
</div>

<div id="outline-container-org1c02c5e" class="outline-5">
<h5 id="org1c02c5e">module_repl</h5>
<div class="outline-text-5" id="text-org1c02c5e">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">module_repl</span>(module):
    <span style="color: #fd971f;">module.repl_char_stack</span> = []
    print_data_stack(module.vm.ds)
    <span style="color: #f92672; font-weight: bold;">try</span>:
        <span style="color: #f92672; font-weight: bold;">while</span> <span style="color: #ae81ff;">True</span>:
            module_repl_one_step(module)
    <span style="color: #f92672; font-weight: bold;">except</span> <span style="color: #66d9ef; font-weight: bold;">KeyboardInterrupt</span>:
        <span style="color: #f92672; font-weight: bold;">return</span>
    <span style="color: #f92672; font-weight: bold;">except</span> EXIT_MODULE_REPL:
        <span style="color: #f92672; font-weight: bold;">return</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2409838" class="outline-5">
<h5 id="org2409838">EXIT_MODULE_REPL</h5>
<div class="outline-text-5" id="text-org2409838">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">EXIT_MODULE_REPL</span>(<span style="color: #66d9ef; font-weight: bold;">Exception</span>):
    <span style="color: #f92672; font-weight: bold;">pass</span>
</pre>
</div>
</div>
</div>
