jojo/jojo.org
******* module_repl_one_step

        #+begin_src python
        def module_repl_one_step(module):
            sexp = read_sexp(module.repl_char_stack)
            if sexp == 'exit':
                raise EXIT_MODULE_REPL()

            try:
                merge_sexp_vect(module, [sexp])
                print_data_stack(module.vm.ds)
            except SystemExit:
                sys.exit()
            except:
                error_type = sys.exc_info()[0]
                error_name = error_type.__name__
                error_info = sys.exc_info()[1]
                print("- error : {}".format(error_name))
                print("  info : {}".format(error_info))
                print("  traceback : ")
                traceback.print_exc()
                call_module_debug(module, 1)
        #+end_src

*** *error*

***** error

      #+begin_src python
      prim('error')(error)
      #+end_src

***** module_debug

******* module_debug

        #+begin_src python
        @prim('module-debug')
        def module_debug(module, level):
            print("- enter debug-repl [level : {}]".format(level))
            module.debug_repl_char_stack = []
            print_return_stack(module.vm.rs)
            print_data_stack(module.vm.ds)
            try:
                while True:
                    module_debug_one_step(module, level)
            except KeyboardInterrupt:
                module.vm.rs = []
                newline()
                print("- leave debug-repl [level : {}]".format(level))
                print("  return-stack is cleared")
                print("  for module : {}".format(module.__name__))
                print_data_stack(module.vm.ds)
                return
            except EXIT_MODULE_DEBUG_REPL:
                module.vm.ds = []
                module.vm.rs = []
                print("- exit debug-repl [level : {}]".format(level))
                print("  return-stack is cleared")
                print("  data-stack is cleared")
                print("  for module : {}".format(module.__name__))
                print_data_stack(module.vm.ds)
                return
            except LEAVE_MODULE_DEBUG_REPL:
                module.vm.rs = []
                print("- leave debug-repl [level : {}]".format(level))
                print("  return-stack is cleared")
                print("  for module : {}".format(module.__name__))
                print_data_stack(module.vm.ds)
                return
        #+end_src

******* EXIT_MODULE_DEBUG_REPL

        #+begin_src python
        class EXIT_MODULE_DEBUG_REPL(Exception):
            pass
        #+end_src

******* LEAVE_MODULE_DEBUG_REPL

        #+begin_src python
        class LEAVE_MODULE_DEBUG_REPL(Exception):
            pass
        #+end_src

******* module_debug_one_step

        #+begin_src python
        def module_debug_one_step(module, level):
            p_print("debug[{}]> ".format(level))
            sys.stdout.flush()
            sexp = read_sexp(module.debug_repl_char_stack)
            if sexp == 'exit':
                raise EXIT_MODULE_DEBUG_REPL()
            if sexp == 'leave':
                raise LEAVE_MODULE_DEBUG_REPL()

            try:
                merge_sexp_vect(module, [sexp])
                print_data_stack(module.vm.ds)
            except SystemExit:
                sys.exit()
            except:
                error_type = sys.exc_info()[0]
                error_name = error_type.__name__
                error_info = sys.exc_info()[1]
                print("- error : {}".format(error_name))
                print("  info : {}".format(error_info))
                p_print("  traceback : ")
                traceback.print_exc()
                call_module_debug(module, level + 1)
        #+end_src

***** call_module_debug

      #+begin_src python
      def call_module_debug(module, level):
          jojo = JOJO([module, level, module_debug, nop])
          module.vm.rs.append(RP(jojo))
          module.vm.exe()
      #+end_src

*** *object*

***** Object

      #+begin_src python
      prim('Object')(object)
      #+end_src

*** *class*

***** value_to_class

      #+begin_src python
      @prim('value->class')
      def value_to_class(value):
          return type(value)
      #+end_src

