docs/jojo.html

<div id="outline-container-org4c5ff25" class="outline-5">
<h5 id="org4c5ff25">module_repl_one_step</h5>
<div class="outline-text-5" id="text-org4c5ff25">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">module_repl_one_step</span>(module):
    <span style="color: #fd971f;">sexp</span> = read_sexp(module.repl_char_stack)
    <span style="color: #f92672; font-weight: bold;">if</span> sexp == <span style="color: #e6db74;">'exit'</span>:
        <span style="color: #f92672; font-weight: bold;">raise</span> EXIT_MODULE_REPL()

    <span style="color: #f92672; font-weight: bold;">try</span>:
        merge_sexp_vect(module, [sexp])
        print_data_stack(module.vm.ds)
    <span style="color: #f92672; font-weight: bold;">except</span> <span style="color: #66d9ef; font-weight: bold;">SystemExit</span>:
        sys.<span style="color: #ae81ff;">exit</span>()
    <span style="color: #f92672; font-weight: bold;">except</span>:
        <span style="color: #fd971f;">error_type</span> = sys.exc_info()[0]
        <span style="color: #fd971f;">error_name</span> = error_type.<span style="color: #a6e22e;">__name__</span>
        <span style="color: #fd971f;">error_info</span> = sys.exc_info()[1]
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- error : {}"</span>.<span style="color: #a6e22e;">format</span>(error_name))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  info : {}"</span>.<span style="color: #a6e22e;">format</span>(error_info))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  traceback : "</span>)
        traceback.print_exc()
        call_module_debug(module, 1)
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org4c374b3" class="outline-3">
<h3 id="org4c374b3"><b>error</b></h3>
<div class="outline-text-3" id="text-org4c374b3">
</div><div id="outline-container-org6f6e501" class="outline-4">
<h4 id="org6f6e501">error</h4>
<div class="outline-text-4" id="text-org6f6e501">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'error'</span>)(error)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a329f0" class="outline-4">
<h4 id="org4a329f0">module_debug</h4>
<div class="outline-text-4" id="text-org4a329f0">
</div><div id="outline-container-org6483af0" class="outline-5">
<h5 id="org6483af0">module_debug</h5>
<div class="outline-text-5" id="text-org6483af0">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'module-debug'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">module_debug</span>(module, level):
    <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- enter debug-repl [level : {}]"</span>.<span style="color: #a6e22e;">format</span>(level))
    <span style="color: #fd971f;">module.debug_repl_char_stack</span> = []
    print_return_stack(module.vm.rs)
    print_data_stack(module.vm.ds)
    <span style="color: #f92672; font-weight: bold;">try</span>:
        <span style="color: #f92672; font-weight: bold;">while</span> <span style="color: #ae81ff;">True</span>:
            module_debug_one_step(module, level)
    <span style="color: #f92672; font-weight: bold;">except</span> <span style="color: #66d9ef; font-weight: bold;">KeyboardInterrupt</span>:
        <span style="color: #fd971f;">module.vm.rs</span> = []
        newline()
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- leave debug-repl [level : {}]"</span>.<span style="color: #a6e22e;">format</span>(level))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  return-stack is cleared"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  for module : {}"</span>.<span style="color: #a6e22e;">format</span>(module.<span style="color: #a6e22e;">__name__</span>))
        print_data_stack(module.vm.ds)
        <span style="color: #f92672; font-weight: bold;">return</span>
    <span style="color: #f92672; font-weight: bold;">except</span> EXIT_MODULE_DEBUG_REPL:
        <span style="color: #fd971f;">module.vm.ds</span> = []
        <span style="color: #fd971f;">module.vm.rs</span> = []
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- exit debug-repl [level : {}]"</span>.<span style="color: #a6e22e;">format</span>(level))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  return-stack is cleared"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  data-stack is cleared"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  for module : {}"</span>.<span style="color: #a6e22e;">format</span>(module.<span style="color: #a6e22e;">__name__</span>))
        print_data_stack(module.vm.ds)
        <span style="color: #f92672; font-weight: bold;">return</span>
    <span style="color: #f92672; font-weight: bold;">except</span> LEAVE_MODULE_DEBUG_REPL:
        <span style="color: #fd971f;">module.vm.rs</span> = []
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- leave debug-repl [level : {}]"</span>.<span style="color: #a6e22e;">format</span>(level))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  return-stack is cleared"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  for module : {}"</span>.<span style="color: #a6e22e;">format</span>(module.<span style="color: #a6e22e;">__name__</span>))
        print_data_stack(module.vm.ds)
        <span style="color: #f92672; font-weight: bold;">return</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2c6a95" class="outline-5">
<h5 id="orge2c6a95">EXIT_MODULE_DEBUG_REPL</h5>
<div class="outline-text-5" id="text-orge2c6a95">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">EXIT_MODULE_DEBUG_REPL</span>(<span style="color: #66d9ef; font-weight: bold;">Exception</span>):
    <span style="color: #f92672; font-weight: bold;">pass</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6855de8" class="outline-5">
<h5 id="org6855de8">LEAVE_MODULE_DEBUG_REPL</h5>
<div class="outline-text-5" id="text-org6855de8">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">LEAVE_MODULE_DEBUG_REPL</span>(<span style="color: #66d9ef; font-weight: bold;">Exception</span>):
    <span style="color: #f92672; font-weight: bold;">pass</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd852841" class="outline-5">
<h5 id="orgd852841">module_debug_one_step</h5>
<div class="outline-text-5" id="text-orgd852841">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">module_debug_one_step</span>(module, level):
    p_print(<span style="color: #e6db74;">"debug[{}]&gt; "</span>.<span style="color: #a6e22e;">format</span>(level))
    sys.stdout.flush()
    <span style="color: #fd971f;">sexp</span> = read_sexp(module.debug_repl_char_stack)
    <span style="color: #f92672; font-weight: bold;">if</span> sexp == <span style="color: #e6db74;">'exit'</span>:
        <span style="color: #f92672; font-weight: bold;">raise</span> EXIT_MODULE_DEBUG_REPL()
    <span style="color: #f92672; font-weight: bold;">if</span> sexp == <span style="color: #e6db74;">'leave'</span>:
        <span style="color: #f92672; font-weight: bold;">raise</span> LEAVE_MODULE_DEBUG_REPL()

    <span style="color: #f92672; font-weight: bold;">try</span>:
        merge_sexp_vect(module, [sexp])
        print_data_stack(module.vm.ds)
    <span style="color: #f92672; font-weight: bold;">except</span> <span style="color: #66d9ef; font-weight: bold;">SystemExit</span>:
        sys.<span style="color: #ae81ff;">exit</span>()
    <span style="color: #f92672; font-weight: bold;">except</span>:
        <span style="color: #fd971f;">error_type</span> = sys.exc_info()[0]
        <span style="color: #fd971f;">error_name</span> = error_type.<span style="color: #a6e22e;">__name__</span>
        <span style="color: #fd971f;">error_info</span> = sys.exc_info()[1]
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- error : {}"</span>.<span style="color: #a6e22e;">format</span>(error_name))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  info : {}"</span>.<span style="color: #a6e22e;">format</span>(error_info))
        p_print(<span style="color: #e6db74;">"  traceback : "</span>)
        traceback.print_exc()
        call_module_debug(module, level + 1)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2424a39" class="outline-4">
<h4 id="org2424a39">call_module_debug</h4>
<div class="outline-text-4" id="text-org2424a39">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">call_module_debug</span>(module, level):
    <span style="color: #fd971f;">jojo</span> = JOJO([module, level, module_debug, nop])
    module.vm.rs.append(RP(jojo))
    module.vm.exe()
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2b1fc09" class="outline-3">
<h3 id="org2b1fc09"><b>object</b></h3>
<div class="outline-text-3" id="text-org2b1fc09">
</div><div id="outline-container-org265a2f8" class="outline-4">
<h4 id="org265a2f8">Object</h4>
<div class="outline-text-4" id="text-org265a2f8">
<div class="org-src-container">

<pre class="src src-python">prim(<span style="color: #e6db74;">'Object'</span>)(<span style="color: #a6e22e;">object</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc425648" class="outline-3">
<h3 id="orgc425648"><b>class</b></h3>
<div class="outline-text-3" id="text-orgc425648">
</div><div id="outline-container-org837cf4b" class="outline-4">
<h4 id="org837cf4b">value_to_class</h4>
<div class="outline-text-4" id="text-org837cf4b">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'value-&gt;class'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">value_to_class</span>(value):
    <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">type</span>(value)
</pre>
</div>
</div>
</div>
