jojo/jojo.org
***** subclass_p

      - treat UNION specially

      #+begin_src python
      @prim('subclass?')
      def subclass_p(c1, c2):
          if type(c2) == UNION:
             return c1 in c2.get_type_vect()
          else:
             return issubclass(c1, c2)
      #+end_src

*** *misc*

***** nop

      #+begin_src python
      @prim('nop')
      def nop():
          return
      #+end_src

***** none

      #+begin_src python
      @prim('none')
      def none():
          return VALUES(None)
      #+end_src

***** fun_to_positional_default_arg_dict

      #+begin_src python
      def fun_to_positional_default_arg_dict(fun):
          signature = get_signature(fun)
          if signature == None:
              print("- fun_to_positional_default_arg_dict")
              print("  fail to get signature")
              print("  fun : {}".format(fun))
              error()
          parameters = signature.parameters
          return get_positional_default_arg_dict(parameters)
      #+end_src

***** prepare_default_arguments

      #+begin_src python
      @prim('prepare-default-arguments')
      def prepare_default_arguments(field_vect, value_vect, fun):
          default_arg_dict = fun_to_positional_default_arg_dict(fun)
          if len(field_vect) == 0:
              normal_value_vect = value_vect
              field_value_vect = []
          elif len(field_vect) <= len(value_vect):
              normal_value_vect = value_vect[:-len(field_vect)]
              field_value_vect = value_vect[len(value_vect)-len(field_vect):]
          else:
              print("- prepare_default_arguments")
              print("  length of field_vect")
              print("    must be shorter then length of value_vect")
              print("  length of field_vect : {}".format(len(field_vect)))
              print("  length of value_vect : {}".format(len(value_vect)))
              print("  fun : {}".format(fun))
              print("  field_vect : {}".format(field_vect))
              error()

          for k, v in zip(field_vect, field_value_vect):
              if k in default_arg_dict:
                  default_arg_dict[k] = v
              else:
                  print("- prepare_default_arguments")
                  print("  a key used in field_vect")
                  print("    is not in default_arg_dict")
                  print("  key : {}".format(k))
                  print("  fun : {}".format(fun))
                  print("  field_vect : {}".format(field_vect))
                  print("  default_arg_dict : {}".format(default_arg_dict))
                  error()

          result_vect = normal_value_vect + Vect(default_arg_dict.values())
          return VALUES(*result_vect)
      #+end_src

***** prepare_data_arguments

      #+begin_src python
      @prim('prepare-data-arguments')
      def prepare_data_arguments(field_vect, value_vect, data):
          if not class_p(data):
              print("- prepare_data_arguments fail")
              print("  data must be a python class")
              print("  data : {}".format(data))
              error()
          elif not hasattr(data, 'field_name_vect'):
              print("- prepare_data_arguments fail")
              print("  data must has 'field_name_vect' attribute")
              print("  data : {}".format(data))
              error()

          if len(field_vect) == 0:
              normal_value_vect = value_vect
              field_value_vect = []
          elif len(field_vect) <= len(value_vect):
              normal_value_vect = value_vect[:-len(field_vect)]
              field_value_vect = value_vect[len(value_vect)-len(field_vect):]
          else:
              print("- prepare_data_arguments fail")
              print("  length of field_vect")
              print("    must be shorter then length of value_vect")
              print("  length of field_vect : {}".format(len(field_vect)))
              print("  length of value_vect : {}".format(len(value_vect)))
              print("  data : {}".format(data))
              print("  field_vect : {}".format(field_vect))
              error()

          field_dict = dict(zip(field_vect, field_value_vect))
          ordered_vect = []
          for field_name in data.field_name_vect:
              if field_name in field_dict.keys():
                  ordered_vect.append(field_dict[field_name])

          result_vect = normal_value_vect + ordered_vect
          return VALUES(*result_vect)
      #+end_src

* keyword_dict

*** [note] type

    - keyword : (-> module, body -- jo vect)

*** keyword_dict

    #+begin_src python
    keyword_dict = {}
    #+end_src

*** @keyword

    #+begin_src python
    def keyword(name):
        def decorator(fun):
            keyword_dict[name] = fun
            return fun
        return decorator
    #+end_src

*** (note)

    #+begin_src python
    @keyword("note")
    def k_note(module, body):
        return []
    #+end_src

