docs/jojo.html

<div id="outline-container-org18f49e0" class="outline-4">
<h4 id="org18f49e0">subclass_p</h4>
<div class="outline-text-4" id="text-org18f49e0">
<ul class="org-ul">
<li><p>treat UNION specially</p></li></ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'subclass?'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">subclass_p</span>(c1, c2):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">type</span>(c2) == UNION:
       <span style="color: #f92672; font-weight: bold;">return</span> c1 <span style="color: #f92672; font-weight: bold;">in</span> c2.get_type_vect()
    <span style="color: #f92672; font-weight: bold;">else</span>:
       <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #a6e22e;">issubclass</span>(c1, c2)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4524105" class="outline-3">
<h3 id="org4524105"><b>misc</b></h3>
<div class="outline-text-3" id="text-org4524105">
</div><div id="outline-container-orgfa62d47" class="outline-4">
<h4 id="orgfa62d47">nop</h4>
<div class="outline-text-4" id="text-orgfa62d47">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'nop'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">nop</span>():
    <span style="color: #f92672; font-weight: bold;">return</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd69166a" class="outline-4">
<h4 id="orgd69166a">none</h4>
<div class="outline-text-4" id="text-orgd69166a">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'none'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">none</span>():
    <span style="color: #f92672; font-weight: bold;">return</span> VALUES(<span style="color: #ae81ff;">None</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org51c08f7" class="outline-4">
<h4 id="org51c08f7">fun_to_positional_default_arg_dict</h4>
<div class="outline-text-4" id="text-org51c08f7">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">fun_to_positional_default_arg_dict</span>(fun):
    <span style="color: #fd971f;">signature</span> = get_signature(fun)
    <span style="color: #f92672; font-weight: bold;">if</span> signature == <span style="color: #ae81ff;">None</span>:
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- fun_to_positional_default_arg_dict"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  fail to get signature"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  fun : {}"</span>.<span style="color: #a6e22e;">format</span>(fun))
        error()
    <span style="color: #fd971f;">parameters</span> = signature.parameters
    <span style="color: #f92672; font-weight: bold;">return</span> get_positional_default_arg_dict(parameters)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda95f89" class="outline-4">
<h4 id="orgda95f89">prepare_data_arguments</h4>
<div class="outline-text-4" id="text-orgda95f89">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'prepare-data-arguments'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">prepare_data_arguments</span>(field_vect, value_vect, data):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> class_p(data):
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- prepare_data_arguments fail"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  data must be a python class"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  data : {}"</span>.<span style="color: #a6e22e;">format</span>(data))
        error()
    <span style="color: #f92672; font-weight: bold;">elif</span> <span style="color: #f92672; font-weight: bold;">not</span> <span style="color: #a6e22e;">hasattr</span>(data, <span style="color: #e6db74;">'field_name_vect'</span>):
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- prepare_data_arguments fail"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  data must has 'field_name_vect' attribute"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  data : {}"</span>.<span style="color: #a6e22e;">format</span>(data))
        error()

    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">len</span>(field_vect) == 0:
        <span style="color: #fd971f;">normal_value_vect</span> = value_vect
        <span style="color: #fd971f;">field_value_vect</span> = []
    <span style="color: #f92672; font-weight: bold;">elif</span> <span style="color: #a6e22e;">len</span>(field_vect) &lt;= <span style="color: #a6e22e;">len</span>(value_vect):
        <span style="color: #fd971f;">normal_value_vect</span> = value_vect[:-<span style="color: #a6e22e;">len</span>(field_vect)]
        <span style="color: #fd971f;">field_value_vect</span> = value_vect[<span style="color: #a6e22e;">len</span>(value_vect)-<span style="color: #a6e22e;">len</span>(field_vect):]
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- prepare_data_arguments fail"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  length of field_vect"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"    must be shorter then length of value_vect"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  length of field_vect : {}"</span>.<span style="color: #a6e22e;">format</span>(<span style="color: #a6e22e;">len</span>(field_vect)))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  length of value_vect : {}"</span>.<span style="color: #a6e22e;">format</span>(<span style="color: #a6e22e;">len</span>(value_vect)))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  data : {}"</span>.<span style="color: #a6e22e;">format</span>(data))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  field_vect : {}"</span>.<span style="color: #a6e22e;">format</span>(field_vect))
        error()

    <span style="color: #fd971f;">field_dict</span> = <span style="color: #a6e22e;">dict</span>(<span style="color: #a6e22e;">zip</span>(field_vect, field_value_vect))
    <span style="color: #fd971f;">ordered_vect</span> = []
    <span style="color: #f92672; font-weight: bold;">for</span> field_name <span style="color: #f92672; font-weight: bold;">in</span> data.field_name_vect:
        <span style="color: #f92672; font-weight: bold;">if</span> field_name <span style="color: #f92672; font-weight: bold;">in</span> field_dict.keys():
            ordered_vect.append(field_dict[field_name])

    <span style="color: #fd971f;">result_vect</span> = normal_value_vect + ordered_vect
    <span style="color: #f92672; font-weight: bold;">return</span> VALUES(*result_vect)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb40d6b7" class="outline-4">
<h4 id="orgb40d6b7">keyword_apply</h4>
<div class="outline-text-4" id="text-orgb40d6b7">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'keyword-apply'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">keyword_apply</span>(field_vect, value_vect, fun):
    <span style="color: #fd971f;">kwargs</span> = <span style="color: #a6e22e;">dict</span>(<span style="color: #a6e22e;">zip</span>(field_vect, value_vect))
    <span style="color: #f92672; font-weight: bold;">return</span> fun(**kwargs)
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org6322a84" class="outline-2">
<h2 id="org6322a84">keyword_dict</h2>
<div class="outline-text-2" id="text-org6322a84">
</div><div id="outline-container-orgf45f98d" class="outline-3">
<h3 id="orgf45f98d"><span class="todo _note_">[note]</span> type</h3>
<div class="outline-text-3" id="text-orgf45f98d">
<ul class="org-ul">
<li><p>keyword : (-&gt; module, body &#x2013; jo vect)</p></li></ul>
</div>
</div>

<div id="outline-container-orgc04cba6" class="outline-3">
<h3 id="orgc04cba6">keyword_dict</h3>
<div class="outline-text-3" id="text-orgc04cba6">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fd971f;">keyword_dict</span> = {}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaaf8eda" class="outline-3">
<h3 id="orgaaf8eda">@keyword</h3>
<div class="outline-text-3" id="text-orgaaf8eda">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">keyword</span>(name):
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">decorator</span>(fun):
        <span style="color: #fd971f;">keyword_dict</span>[name] = fun
        <span style="color: #f92672; font-weight: bold;">return</span> fun
    <span style="color: #f92672; font-weight: bold;">return</span> decorator
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac7612c" class="outline-3">
<h3 id="orgac7612c">(note)</h3>
<div class="outline-text-3" id="text-orgac7612c">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">"note"</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_note</span>(module, body):
    <span style="color: #f92672; font-weight: bold;">return</span> []
</pre>
</div>
</div>
</div>
