jojo/jojo.org
*** (begin)

    #+begin_src python
    @keyword('begin')
    def k_begin(module, body):
        return sexp_list_emit(module, body)
    #+end_src

*** (clo)

    #+begin_src python
    @keyword('clo')
    def k_clo(module, body):
        return [CLO(sexp_list_emit(module, body))]
    #+end_src

*** (quote)

    #+begin_src python
    @keyword('quote')
    def k_quote(module, body):
        jo_vect = list_to_vect(body)
        return jo_vect
    #+end_src

*** (partquote)

    #+begin_src python
    @keyword('partquote')
    def k_partquote(module, sexp_list):
        jo_vect = []
        while not null_p(sexp_list):
            sexp = car(sexp_list)
            jo_vect.extend(k_partquote_one(module, sexp))
            sexp_list = cdr(sexp_list)
        return jo_vect

    def k_partquote_one(module, sexp):
        if cons_p(sexp):
            if car(sexp) == '@':
                return sexp_list_emit(module, cdr(sexp))
            else:
                jo_vect = []
                jo_vect.extend([MARK])
                jo_vect.extend(k_partquote(module, sexp))
                jo_vect.extend([COLLECT_LIST])
                return jo_vect
        else:
            return [sexp]
    #+end_src

*** (->)

    #+begin_src python
    @keyword('->')
    def k_arrow(module, sexp_list):
        jo_vect = []
        while not null_p(sexp_list):
            sexp = car(sexp_list)
            if not string_p(sexp):
                pass
            elif sexp == '--':
                break
            elif local_string_p(sexp):
                jo_vect.append(SET(sexp))
            else:
                pass
            sexp_list = cdr(sexp_list)
        jo_vect.reverse()
        return jo_vect
    #+end_src

*** (list)

    #+begin_src python
    @keyword('list')
    def k_list(module, sexp_list):
        jo_vect = []
        jo_vect.extend([MARK])
        jo_vect.extend(sexp_list_emit(module, sexp_list))
        jo_vect.extend([COLLECT_LIST])
        return jo_vect
    #+end_src

*** (vect)

    #+begin_src python
    @keyword('vect')
    def k_vect(module, sexp_list):
        jo_vect = []
        jo_vect.extend([MARK])
        jo_vect.extend(sexp_list_emit(module, sexp_list))
        jo_vect.extend([COLLECT_VECT])
        return jo_vect
    #+end_src

*** (stack)

    #+begin_src python
    @keyword('stack')
    def k_stack(module, sexp_list):
        return k_vect(module, sexp_list)
    #+end_src

*** (dict)

    #+begin_src python
    @keyword('dict')
    def k_dict(module, sexp_list):
        jo_vect = []
        jo_vect.extend([MARK])
        jo_vect.extend(sexp_list_emit(module, sexp_list))
        jo_vect.extend([COLLECT_VECT, vect_to_dict])
        return jo_vect
    #+end_src

*** (tuple)

    #+begin_src python
    @keyword('tuple')
    def k_tuple(module, sexp_list):
        jo_vect = []
        jo_vect.extend([MARK])
        jo_vect.extend(sexp_list_emit(module, sexp_list))
        jo_vect.extend([COLLECT_VECT, vect_to_tuple])
        return jo_vect

    keyword('*')(k_tuple)
    #+end_src

*** (set)

    #+begin_src python
    @keyword('set')
    def k_set(module, sexp_list):
        jo_vect = []
        jo_vect.extend([MARK])
        jo_vect.extend(sexp_list_emit(module, sexp_list))
        jo_vect.extend([COLLECT_VECT, vect_to_set])
        return jo_vect
    #+end_src

*** (primitive)

    #+begin_src python
    @keyword('primitive')
    def k_primitive(module, sexp_list):
        jo_vect = []
        sexp_vect = list_to_vect(sexp_list)
        for sexp in sexp_vect:
            if not string_p(sexp):
                print("- (primitive) syntax error")
                print("  body of (primitive) must be names")
                print("  non string sexp : {}".format(sexp))
                print("  body : {}".format(sexp_vect))
                error()
            else:
                jo_vect.extend([PRIMITIVE(operator.attrgetter(sexp)(module))])
        return jo_vect
    #+end_src

* top_level_keyword

*** (import)

