docs/jojo.html

<div id="outline-container-orgb3b42d7" class="outline-3">
<h3 id="orgb3b42d7">(begin)</h3>
<div class="outline-text-3" id="text-orgb3b42d7">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">'begin'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_begin</span>(module, body):
    <span style="color: #f92672; font-weight: bold;">return</span> sexp_list_emit(module, body)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3ce4aa" class="outline-3">
<h3 id="orgb3ce4aa">(clo)</h3>
<div class="outline-text-3" id="text-orgb3ce4aa">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">'clo'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_clo</span>(module, body):
    <span style="color: #f92672; font-weight: bold;">return</span> [CLO(sexp_list_emit(module, body))]
</pre>
</div>
</div>
</div>

<div id="outline-container-org86e5d48" class="outline-3">
<h3 id="org86e5d48">(quote)</h3>
<div class="outline-text-3" id="text-org86e5d48">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">'quote'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_quote</span>(module, body):
    <span style="color: #fd971f;">jo_vect</span> = list_to_vect(body)
    <span style="color: #f92672; font-weight: bold;">return</span> jo_vect
</pre>
</div>
</div>
</div>

<div id="outline-container-org94b7955" class="outline-3">
<h3 id="org94b7955">(partquote)</h3>
<div class="outline-text-3" id="text-org94b7955">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">'partquote'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_partquote</span>(module, sexp_list):
    <span style="color: #fd971f;">jo_vect</span> = []
    <span style="color: #f92672; font-weight: bold;">while</span> <span style="color: #f92672; font-weight: bold;">not</span> null_p(sexp_list):
        <span style="color: #fd971f;">sexp</span> = car(sexp_list)
        jo_vect.extend(k_partquote_one(module, sexp))
        <span style="color: #fd971f;">sexp_list</span> = cdr(sexp_list)
    <span style="color: #f92672; font-weight: bold;">return</span> jo_vect

<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_partquote_one</span>(module, sexp):
    <span style="color: #f92672; font-weight: bold;">if</span> cons_p(sexp):
        <span style="color: #f92672; font-weight: bold;">if</span> car(sexp) == <span style="color: #e6db74;">'@'</span>:
            <span style="color: #f92672; font-weight: bold;">return</span> sexp_list_emit(module, cdr(sexp))
        <span style="color: #f92672; font-weight: bold;">else</span>:
            <span style="color: #fd971f;">jo_vect</span> = []
            jo_vect.extend([MARK])
            jo_vect.extend(k_partquote(module, sexp))
            jo_vect.extend([COLLECT_LIST])
            <span style="color: #f92672; font-weight: bold;">return</span> jo_vect
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> [sexp]
</pre>
</div>
</div>
</div>

<div id="outline-container-org69dcfd8" class="outline-3">
<h3 id="org69dcfd8">(-&gt;)</h3>
<div class="outline-text-3" id="text-org69dcfd8">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">'-&gt;'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_arrow</span>(module, sexp_list):
    <span style="color: #fd971f;">jo_vect</span> = []
    <span style="color: #f92672; font-weight: bold;">while</span> <span style="color: #f92672; font-weight: bold;">not</span> null_p(sexp_list):
        <span style="color: #fd971f;">sexp</span> = car(sexp_list)
        <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> string_p(sexp):
            <span style="color: #f92672; font-weight: bold;">pass</span>
        <span style="color: #f92672; font-weight: bold;">elif</span> sexp == <span style="color: #e6db74;">'--'</span>:
            <span style="color: #f92672; font-weight: bold;">break</span>
        <span style="color: #f92672; font-weight: bold;">elif</span> local_string_p(sexp):
            jo_vect.append(SET(sexp))
        <span style="color: #f92672; font-weight: bold;">else</span>:
            <span style="color: #f92672; font-weight: bold;">pass</span>
        <span style="color: #fd971f;">sexp_list</span> = cdr(sexp_list)
    jo_vect.reverse()
    <span style="color: #f92672; font-weight: bold;">return</span> jo_vect
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf49169b" class="outline-3">
<h3 id="orgf49169b">(list)</h3>
<div class="outline-text-3" id="text-orgf49169b">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">'list'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_list</span>(module, sexp_list):
    <span style="color: #fd971f;">jo_vect</span> = []
    jo_vect.extend([MARK])
    jo_vect.extend(sexp_list_emit(module, sexp_list))
    jo_vect.extend([COLLECT_LIST])
    <span style="color: #f92672; font-weight: bold;">return</span> jo_vect
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ba42c1" class="outline-3">
<h3 id="org6ba42c1">(vect)</h3>
<div class="outline-text-3" id="text-org6ba42c1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">'vect'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_vect</span>(module, sexp_list):
    <span style="color: #fd971f;">jo_vect</span> = []
    jo_vect.extend([MARK])
    jo_vect.extend(sexp_list_emit(module, sexp_list))
    jo_vect.extend([COLLECT_VECT])
    <span style="color: #f92672; font-weight: bold;">return</span> jo_vect
</pre>
</div>
</div>
</div>

<div id="outline-container-org755bd04" class="outline-3">
<h3 id="org755bd04">(stack)</h3>
<div class="outline-text-3" id="text-org755bd04">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">'stack'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_stack</span>(module, sexp_list):
    <span style="color: #f92672; font-weight: bold;">return</span> k_vect(module, sexp_list)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3992405" class="outline-3">
<h3 id="org3992405">(dict)</h3>
<div class="outline-text-3" id="text-org3992405">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">'dict'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_dict</span>(module, sexp_list):
    <span style="color: #fd971f;">jo_vect</span> = []
    jo_vect.extend([MARK])
    jo_vect.extend(sexp_list_emit(module, sexp_list))
    jo_vect.extend([COLLECT_VECT, vect_to_dict])
    <span style="color: #f92672; font-weight: bold;">return</span> jo_vect
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ec9741" class="outline-3">
<h3 id="org3ec9741">(tuple)</h3>
<div class="outline-text-3" id="text-org3ec9741">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">'tuple'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_tuple</span>(module, sexp_list):
    <span style="color: #fd971f;">jo_vect</span> = []
    jo_vect.extend([MARK])
    jo_vect.extend(sexp_list_emit(module, sexp_list))
    jo_vect.extend([COLLECT_VECT, vect_to_tuple])
    <span style="color: #f92672; font-weight: bold;">return</span> jo_vect

keyword(<span style="color: #e6db74;">'*'</span>)(k_tuple)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6515107" class="outline-3">
<h3 id="org6515107">(set)</h3>
<div class="outline-text-3" id="text-org6515107">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">'set'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_set</span>(module, sexp_list):
    <span style="color: #fd971f;">jo_vect</span> = []
    jo_vect.extend([MARK])
    jo_vect.extend(sexp_list_emit(module, sexp_list))
    jo_vect.extend([COLLECT_VECT, vect_to_set])
    <span style="color: #f92672; font-weight: bold;">return</span> jo_vect
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb92f9" class="outline-3">
<h3 id="orgeb92f9">(primitive)</h3>
<div class="outline-text-3" id="text-orgeb92f9">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">'primitive'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_primitive</span>(module, sexp_list):
    <span style="color: #fd971f;">jo_vect</span> = []
    <span style="color: #fd971f;">sexp_vect</span> = list_to_vect(sexp_list)
    <span style="color: #f92672; font-weight: bold;">for</span> sexp <span style="color: #f92672; font-weight: bold;">in</span> sexp_vect:
        <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> string_p(sexp):
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- (primitive) syntax error"</span>)
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  body of (primitive) must be names"</span>)
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  non string sexp : {}"</span>.<span style="color: #a6e22e;">format</span>(sexp))
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  body : {}"</span>.<span style="color: #a6e22e;">format</span>(sexp_vect))
            error()
        <span style="color: #f92672; font-weight: bold;">else</span>:
            jo_vect.extend([PRIMITIVE(operator.attrgetter(sexp)(module))])
    <span style="color: #f92672; font-weight: bold;">return</span> jo_vect
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgef1a66f" class="outline-2">
<h2 id="orgef1a66f">top_level_keyword</h2>
