jojo/jojo.org
***** k_import

      #+begin_src python
      @keyword("import")
      def k_import(module, body):
          name_vect = list_to_vect(body)

          if 'as' in name_vect:
              k_import_as(module, body)
              return []

          if null_p(body):
              return []

          for name in name_vect:
              if '.' in name:
                  print("- (import) syntax error")
                  print("  module name can not contain '.'")
                  print("  module name : {}".format(name))
                  p_print("  import body : ")
                  sexp_list_print(body)
                  newline()
                  error()

          for name in name_vect:
              k_import_one(module, name)

          return []
      #+end_src

***** k_import_one

      #+begin_src python
      def k_import_one(module, name):
          imported_module = importlib.import_module(name)
          jojo_define(module, name, imported_module)
      #+end_src

***** k_import_as

      #+begin_src python
      def k_import_as(module, body):
          name_vect = list_to_vect(body)
          if (len(name_vect) != 3 or
              name_vect[0] == 'as' or
              name_vect[1] != 'as' or
              name_vect[2] == 'as'):
              print("- (import) syntax error")
              print("  syntax for (import as) should be :")
              print("  (import <module-name> as <name>)")
              p_print("  import body : ")
              sexp_list_print(body)
              newline()
              error()
          name = name_vect[0]
          as_name = name_vect[2]
          imported_module = importlib.import_module(name)
          jojo_define(module, as_name, imported_module)
      #+end_src

*** (from)

***** k_from

      #+begin_src python
      @keyword("from")
      def k_from(module, body):
          vect_body = list_to_vect(body)
          if 'as' in vect_body:
              k_from_as(module, body)
              return []

          k_from_syntax_check(body)
          module_name = car(body)
          name_vect = list_to_vect(cdr(cdr(body)))
          imported_module = importlib.import_module(module_name)
          for name in name_vect:
              jojo_define(module, name, getattr(imported_module, name))

          return []
      #+end_src

***** k_from_syntax_check

      #+begin_src python
      def k_from_syntax_check(body):
          vect_body = list_to_vect(body)
          if len(vect_body) > 2:
              pass
          if vect_body[1] == 'import':
              return
          print("- (from) syntax error")
          print("  syntax for (from import) should be :")
          print("  (from <module-name> import <name> ...)")
          p_print("  import body : ")
          sexp_list_print(body)
          newline()
          error()
      #+end_src

***** k_from_as

      #+begin_src python
      def k_from_as(module, body):
          k_from_as_syntax_check(body)
          vect_body = list_to_vect(body)
          module_name = vect_body[0]
          name = vect_body[2]
          as_name = vect_body[4]
          imported_module = importlib.import_module(module_name)
          jojo_define(module, as_name, getattr(imported_module, name))
      #+end_src

***** k_from_as_syntax_check

      #+begin_src python
      def k_from_as_syntax_check(body):
          vect_body = list_to_vect(body)
          if len(vect_body) == 5:
              pass
          if vect_body[1] == 'import':
              pass
          if vect_body[3] == 'as':
              return
          print("- (from) syntax error")
          print("  syntax for (from import as) should be :")
          print("  (from <module-name> import <name> as <name>)")
          p_print("  import body : ")
          sexp_list_print(body)
          newline()
          error()
      #+end_src

*** (+jojo)

    #+begin_src python
    @keyword("+jojo")
    def plus_jojo(module, body):
        if list_length(body) == 0:
            print("- (+jojo) syntax error")
            print("  body of (+jojo) can not be empty")
            error()

        jojo_name = car(body)
        jojo_define(module, jojo_name,
                    JOJO(sexp_list_emit(module, cdr(body))))

        return []
    #+end_src

*** (+data)

