docs/jojo.html
<div class="outline-text-2" id="text-orgef1a66f">
</div><div id="outline-container-org5839830" class="outline-3">
<h3 id="org5839830">(import)</h3>
<div class="outline-text-3" id="text-org5839830">
</div><div id="outline-container-org2b58e30" class="outline-4">
<h4 id="org2b58e30">k_import</h4>
<div class="outline-text-4" id="text-org2b58e30">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">"import"</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_import</span>(module, body):
    <span style="color: #fd971f;">name_vect</span> = list_to_vect(body)

    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #e6db74;">'as'</span> <span style="color: #f92672; font-weight: bold;">in</span> name_vect:
        k_import_as(module, body)
        <span style="color: #f92672; font-weight: bold;">return</span> []

    <span style="color: #f92672; font-weight: bold;">if</span> null_p(body):
        <span style="color: #f92672; font-weight: bold;">return</span> []

    <span style="color: #f92672; font-weight: bold;">for</span> name <span style="color: #f92672; font-weight: bold;">in</span> name_vect:
        <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #e6db74;">'.'</span> <span style="color: #f92672; font-weight: bold;">in</span> name:
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- (import) syntax error"</span>)
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  module name can not contain '.'"</span>)
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  module name : {}"</span>.<span style="color: #a6e22e;">format</span>(name))
            p_print(<span style="color: #e6db74;">"  import body : "</span>)
            sexp_list_print(body)
            newline()
            error()

    <span style="color: #f92672; font-weight: bold;">for</span> name <span style="color: #f92672; font-weight: bold;">in</span> name_vect:
        k_import_one(module, name)

    <span style="color: #f92672; font-weight: bold;">return</span> []
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc204695" class="outline-4">
<h4 id="orgc204695">k_import_one</h4>
<div class="outline-text-4" id="text-orgc204695">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_import_one</span>(module, name):
    <span style="color: #fd971f;">imported_module</span> = importlib.import_module(name)
    jojo_define(module, name, imported_module)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf2783a3" class="outline-4">
<h4 id="orgf2783a3">k_import_as</h4>
<div class="outline-text-4" id="text-orgf2783a3">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_import_as</span>(module, body):
    <span style="color: #fd971f;">name_vect</span> = list_to_vect(body)
    <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #a6e22e;">len</span>(name_vect) != 3 <span style="color: #f92672; font-weight: bold;">or</span>
        name_vect[0] == <span style="color: #e6db74;">'as'</span> <span style="color: #f92672; font-weight: bold;">or</span>
        name_vect[1] != <span style="color: #e6db74;">'as'</span> <span style="color: #f92672; font-weight: bold;">or</span>
        name_vect[2] == <span style="color: #e6db74;">'as'</span>):
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- (import) syntax error"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  syntax for (import as) should be :"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  (import &lt;module-name&gt; as &lt;name&gt;)"</span>)
        p_print(<span style="color: #e6db74;">"  import body : "</span>)
        sexp_list_print(body)
        newline()
        error()
    <span style="color: #fd971f;">name</span> = name_vect[0]
    <span style="color: #fd971f;">as_name</span> = name_vect[2]
    <span style="color: #fd971f;">imported_module</span> = importlib.import_module(name)
    jojo_define(module, as_name, imported_module)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8139019" class="outline-3">
<h3 id="org8139019">(from)</h3>
<div class="outline-text-3" id="text-org8139019">
</div><div id="outline-container-org6638cd7" class="outline-4">
<h4 id="org6638cd7">k_from</h4>
<div class="outline-text-4" id="text-org6638cd7">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">"from"</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_from</span>(module, body):
    <span style="color: #fd971f;">vect_body</span> = list_to_vect(body)
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #e6db74;">'as'</span> <span style="color: #f92672; font-weight: bold;">in</span> vect_body:
        k_from_as(module, body)
        <span style="color: #f92672; font-weight: bold;">return</span> []

    k_from_syntax_check(body)
    <span style="color: #fd971f;">module_name</span> = car(body)
    <span style="color: #fd971f;">name_vect</span> = list_to_vect(cdr(cdr(body)))
    <span style="color: #fd971f;">imported_module</span> = importlib.import_module(module_name)
    <span style="color: #f92672; font-weight: bold;">for</span> name <span style="color: #f92672; font-weight: bold;">in</span> name_vect:
        jojo_define(module, name, <span style="color: #a6e22e;">getattr</span>(imported_module, name))

    <span style="color: #f92672; font-weight: bold;">return</span> []
</pre>
</div>
</div>
</div>

<div id="outline-container-org23c033e" class="outline-4">
<h4 id="org23c033e">k_from_syntax_check</h4>
<div class="outline-text-4" id="text-org23c033e">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_from_syntax_check</span>(body):
    <span style="color: #fd971f;">vect_body</span> = list_to_vect(body)
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">len</span>(vect_body) &gt; 2:
        <span style="color: #f92672; font-weight: bold;">pass</span>
    <span style="color: #f92672; font-weight: bold;">if</span> vect_body[1] == <span style="color: #e6db74;">'import'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span>
    <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- (from) syntax error"</span>)
    <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  syntax for (from import) should be :"</span>)
    <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  (from &lt;module-name&gt; import &lt;name&gt; ...)"</span>)
    p_print(<span style="color: #e6db74;">"  import body : "</span>)
    sexp_list_print(body)
    newline()
    error()
</pre>
</div>
</div>
</div>

<div id="outline-container-org109eb89" class="outline-4">
<h4 id="org109eb89">k_from_as</h4>
<div class="outline-text-4" id="text-org109eb89">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_from_as</span>(module, body):
    k_from_as_syntax_check(body)
    <span style="color: #fd971f;">vect_body</span> = list_to_vect(body)
    <span style="color: #fd971f;">module_name</span> = vect_body[0]
    <span style="color: #fd971f;">name</span> = vect_body[2]
    <span style="color: #fd971f;">as_name</span> = vect_body[4]
    <span style="color: #fd971f;">imported_module</span> = importlib.import_module(module_name)
    jojo_define(module, as_name, <span style="color: #a6e22e;">getattr</span>(imported_module, name))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga1307dd" class="outline-4">
<h4 id="orga1307dd">k_from_as_syntax_check</h4>
<div class="outline-text-4" id="text-orga1307dd">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_from_as_syntax_check</span>(body):
    <span style="color: #fd971f;">vect_body</span> = list_to_vect(body)
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">len</span>(vect_body) == 5:
        <span style="color: #f92672; font-weight: bold;">pass</span>
    <span style="color: #f92672; font-weight: bold;">if</span> vect_body[1] == <span style="color: #e6db74;">'import'</span>:
        <span style="color: #f92672; font-weight: bold;">pass</span>
    <span style="color: #f92672; font-weight: bold;">if</span> vect_body[3] == <span style="color: #e6db74;">'as'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span>
    <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- (from) syntax error"</span>)
    <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  syntax for (from import as) should be :"</span>)
    <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  (from &lt;module-name&gt; import &lt;name&gt; as &lt;name&gt;)"</span>)
    p_print(<span style="color: #e6db74;">"  import body : "</span>)
    sexp_list_print(body)
    newline()
    error()
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgaf90d9f" class="outline-3">
<h3 id="orgaf90d9f">(+jojo)</h3>
<div class="outline-text-3" id="text-orgaf90d9f">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">"+jojo"</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">plus_jojo</span>(module, body):
    <span style="color: #f92672; font-weight: bold;">if</span> list_length(body) == 0:
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- (+jojo) syntax error"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  body of (+jojo) can not be empty"</span>)
        error()

    <span style="color: #fd971f;">jojo_name</span> = car(body)
    jojo_define(module, jojo_name,
                JOJO(sexp_list_emit(module, cdr(body))))

    <span style="color: #f92672; font-weight: bold;">return</span> []
</pre>
</div>
</div>
</div>
