jojo/jojo.org
***** plus_data

      #+begin_src python
      @keyword("+data")
      def plus_data(module, body):
          data_name = car(body)
          if not data_name_string_p(data_name):
              print("- (+data) syntax error")
              print("  data_name must be of form <...>")
              print("  data_name : {}".format(data_name))
              error()

          field_name_vect = body_to_field_name_vect(cdr(body))
          data_class = create_data_class(data_name, field_name_vect)
          data_class.__module__ = module
          jojo_define(module, data_name, data_class)
          # generate more bindings
          constructor_name = data_name[1:-1]
          jojo_define(module, constructor_name, JOJO([data_class, NEW]))
          predicate_name = "".join([constructor_name, "?"])
          jojo_define(module, predicate_name, DATA_PRED(data_class))
          return []
      #+end_src

***** body_to_field_name_vect

      #+begin_src python
      def body_to_field_name_vect(body):
          body_vect = list_to_vect(body)
          field_name_vect = []
          for sexp in body_vect:
              if string_p(sexp):
                  if message_string_p(sexp):
                      sexp = sexp[1:]
                      field_name_vect.append(sexp)
              elif cons_p(sexp):
                  if car(sexp) == '.':
                      vect1 = body_to_field_name_vect(cdr(sexp))
                      field_name_vect.extend(vect1)
          return field_name_vect
      #+end_src

***** data_name_string_p

      #+begin_src python
      def data_name_string_p(string):
          if not string_p(string):
              return False
          if len(string) < 3: # example : '<n>'
              return False
          elif string[0] != '<':
              return False
          elif string[-1] != '>':
              return False
          elif string.count('<') != 1:
              return False
          elif string.count('>') != 1:
              return False
          elif string.count('.') != 0:
              return False
          elif string.count(':') != 0:
              return False
          else:
              return True
      #+end_src

***** create_data_init

      #+begin_src python
      def create_data_init(field_name_vect):
          '''
          just like
          def __init__(self, x1, x2):
              self.__dict__['field-name-1'] = x1
              self.__dict__['field-name-2'] = x2
          '''
          if len(field_name_vect) == 0:
              code = "def init(self):pass"
              exec(code, globals())
              return init
          else:
              length = len(field_name_vect)
              pieces = []
              pieces.append("def init(self")
              for field_name, index in zip(field_name_vect, range(length)):
                  pieces.append(",{}".format('x'+str(index)))
              pieces.append("):")
              for field_name, index in zip(field_name_vect, range(length)):
                  pieces.append("self.__dict__['{}']={};".format(field_name,
                                                     ('x'+str(index))))
              code = ''.join(pieces)
              exec(code, globals())
              return init
      #+end_src

***** create_data_class

      - a data in jojo is simply a python class
        with the following special fields :
        - 'field_name_vect'
        - 'reversed_field_name_vect'

      #+begin_src python
      def create_data_class(data_name, field_name_vect):
          rev = vect_copy(field_name_vect)
          rev.reverse()
          def update_ns(ns):
              ns.update({
                  '__init__' : create_data_init(field_name_vect),
                  'field_name_vect': field_name_vect,
                  'reversed_field_name_vect': rev,
              })
          return types.new_class(
              data_name,
              kwds = None,
              exec_body = update_ns)
      #+end_src

*** (+union)

***** plus_union

      #+begin_src python
      @keyword("+union")
      def plus_union(module, body):
          name = car(body)
          rest = cdr(body)
          jo_vect = sexp_list_emit(module, rest)
          jojo = JOJO(jo_vect)
          jojo_define(module, name, UNION(jojo))
          return []
      #+end_src

