docs/jojo.html

<div id="outline-container-org34c6049" class="outline-3">
<h3 id="org34c6049">(+data)</h3>
<div class="outline-text-3" id="text-org34c6049">
</div><div id="outline-container-orgec4c9ea" class="outline-4">
<h4 id="orgec4c9ea">plus_data</h4>
<div class="outline-text-4" id="text-orgec4c9ea">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">"+data"</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">plus_data</span>(module, body):
    <span style="color: #fd971f;">data_name</span> = car(body)
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> data_name_string_p(data_name):
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- (+data) syntax error"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  data_name must be of form &lt;...&gt;"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  data_name : {}"</span>.<span style="color: #a6e22e;">format</span>(data_name))
        error()

    <span style="color: #fd971f;">field_name_vect</span> = body_to_field_name_vect(cdr(body))
    <span style="color: #fd971f;">data_class</span> = create_data_class(data_name, field_name_vect)
    <span style="color: #fd971f;">data_class.__module__</span> = module
    jojo_define(module, data_name, data_class)
    <span style="color: #FF8888;"># </span><span style="color: #FF8888;">generate more bindings</span>
    <span style="color: #fd971f;">constructor_name</span> = data_name[1:-1]
    jojo_define(module, constructor_name, JOJO([data_class, NEW]))
    <span style="color: #fd971f;">predicate_name</span> = <span style="color: #e6db74;">""</span>.join([constructor_name, <span style="color: #e6db74;">"?"</span>])
    jojo_define(module, predicate_name, DATA_PRED(data_class))
    <span style="color: #f92672; font-weight: bold;">return</span> []
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c844a7" class="outline-4">
<h4 id="org1c844a7">body_to_field_name_vect</h4>
<div class="outline-text-4" id="text-org1c844a7">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">body_to_field_name_vect</span>(body):
    <span style="color: #fd971f;">body_vect</span> = list_to_vect(body)
    <span style="color: #fd971f;">field_name_vect</span> = []
    <span style="color: #f92672; font-weight: bold;">for</span> sexp <span style="color: #f92672; font-weight: bold;">in</span> body_vect:
        <span style="color: #f92672; font-weight: bold;">if</span> string_p(sexp):
            <span style="color: #f92672; font-weight: bold;">if</span> message_string_p(sexp):
                <span style="color: #fd971f;">sexp</span> = sexp[1:]
                field_name_vect.append(sexp)
        <span style="color: #f92672; font-weight: bold;">elif</span> cons_p(sexp):
            <span style="color: #f92672; font-weight: bold;">if</span> car(sexp) == <span style="color: #e6db74;">'.'</span>:
                <span style="color: #fd971f;">vect1</span> = body_to_field_name_vect(cdr(sexp))
                field_name_vect.extend(vect1)
    <span style="color: #f92672; font-weight: bold;">return</span> field_name_vect
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd8d07fc" class="outline-4">
<h4 id="orgd8d07fc">data_name_string_p</h4>
<div class="outline-text-4" id="text-orgd8d07fc">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">data_name_string_p</span>(string):
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> string_p(string):
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">len</span>(string) &lt; 3: <span style="color: #FF8888;"># </span><span style="color: #FF8888;">example : '&lt;n&gt;'</span>
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string[0] != <span style="color: #e6db74;">'&lt;'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string[-1] != <span style="color: #e6db74;">'&gt;'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string.count(<span style="color: #e6db74;">'&lt;'</span>) != 1:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string.count(<span style="color: #e6db74;">'&gt;'</span>) != 1:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string.count(<span style="color: #e6db74;">'.'</span>) != 0:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">elif</span> string.count(<span style="color: #e6db74;">':'</span>) != 0:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">False</span>
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">True</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgccc1f52" class="outline-4">
<h4 id="orgccc1f52">create_data_init</h4>
<div class="outline-text-4" id="text-orgccc1f52">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">create_data_init</span>(field_name_vect):
    <span style="color: #e6db74;">'''</span>
<span style="color: #e6db74;">    just like</span>
<span style="color: #e6db74;">    def __init__(self, x1, x2):</span>
<span style="color: #e6db74;">        self.__dict__['field-name-1'] = x1</span>
<span style="color: #e6db74;">        self.__dict__['field-name-2'] = x2</span>
<span style="color: #e6db74;">    '''</span>
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">len</span>(field_name_vect) == 0:
        <span style="color: #fd971f;">code</span> = <span style="color: #e6db74;">"def init(self):pass"</span>
        <span style="color: #f92672; font-weight: bold;">exec</span>(code, <span style="color: #a6e22e;">globals</span>())
        <span style="color: #f92672; font-weight: bold;">return</span> init
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #fd971f;">length</span> = <span style="color: #a6e22e;">len</span>(field_name_vect)
        <span style="color: #fd971f;">pieces</span> = []
        pieces.append(<span style="color: #e6db74;">"def init(self"</span>)
        <span style="color: #f92672; font-weight: bold;">for</span> field_name, index <span style="color: #f92672; font-weight: bold;">in</span> <span style="color: #a6e22e;">zip</span>(field_name_vect, <span style="color: #a6e22e;">range</span>(length)):
            pieces.append(<span style="color: #e6db74;">",{}"</span>.<span style="color: #a6e22e;">format</span>(<span style="color: #e6db74;">'x'</span>+<span style="color: #a6e22e;">str</span>(index)))
        pieces.append(<span style="color: #e6db74;">"):"</span>)
        <span style="color: #f92672; font-weight: bold;">for</span> field_name, index <span style="color: #f92672; font-weight: bold;">in</span> <span style="color: #a6e22e;">zip</span>(field_name_vect, <span style="color: #a6e22e;">range</span>(length)):
            pieces.append(<span style="color: #e6db74;">"self.__dict__['{}']={};"</span>.<span style="color: #a6e22e;">format</span>(field_name,
                                               (<span style="color: #e6db74;">'x'</span>+<span style="color: #a6e22e;">str</span>(index))))
        <span style="color: #fd971f;">code</span> = <span style="color: #e6db74;">''</span>.join(pieces)
        <span style="color: #f92672; font-weight: bold;">exec</span>(code, <span style="color: #a6e22e;">globals</span>())
        <span style="color: #f92672; font-weight: bold;">return</span> init
</pre>
</div>
</div>
</div>

<div id="outline-container-org6d9a975" class="outline-4">
<h4 id="org6d9a975">create_data_class</h4>
<div class="outline-text-4" id="text-org6d9a975">
<ul class="org-ul">
<li><p>a data in jojo is simply a python class</p><p>with the following special fields :</p><p><ul class="org-ul"></p><p><li><p>'field_name_vect'</p></li></p><p><li><p>'reversed_field_name_vect'</p></li></ul></p></li></ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">create_data_class</span>(data_name, field_name_vect):
    <span style="color: #fd971f;">rev</span> = vect_copy(field_name_vect)
    rev.reverse()
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">update_ns</span>(ns):
        ns.update({
            <span style="color: #e6db74;">'__init__'</span> : create_data_init(field_name_vect),
            <span style="color: #e6db74;">'field_name_vect'</span>: field_name_vect,
            <span style="color: #e6db74;">'reversed_field_name_vect'</span>: rev,
        })
    <span style="color: #f92672; font-weight: bold;">return</span> types.new_class(
        data_name,
        kwds = <span style="color: #ae81ff;">None</span>,
        exec_body = update_ns)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org67bafa" class="outline-3">
<h3 id="org67bafa">(+union)</h3>
<div class="outline-text-3" id="text-org67bafa">
</div><div id="outline-container-orga12d365" class="outline-4">
<h4 id="orga12d365">plus_union</h4>
<div class="outline-text-4" id="text-orga12d365">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">"+union"</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">plus_union</span>(module, body):
    <span style="color: #fd971f;">name</span> = car(body)
    <span style="color: #fd971f;">rest</span> = cdr(body)
    <span style="color: #fd971f;">jo_vect</span> = sexp_list_emit(module, rest)
    <span style="color: #fd971f;">jojo</span> = JOJO(jo_vect)
    jojo_define(module, name, UNION(jojo))
    <span style="color: #f92672; font-weight: bold;">return</span> []
</pre>
</div>
</div>
</div>
