jojo/jojo.org
***** UNION

      #+begin_src python
      class UNION:
          def __init__(self, jojo):
              self.jojo = jojo

          def get_type_vect(self):
              vm = VM([], [RP(self.jojo)])
              vm.exe()
              return vm.ds
      #+end_src

*** [note] gene and disp

    - a gene in a module maintains a dict
      form tuple of type to disp

    - suppose

      in module m1 we have (+gene g1 ...)

      in module m2 we (import m1) and
      (+disp m1.g1 ...) for data in m2

      this means the the global state g1 of module m1
      can be changed by module m2

    - in such a hopelessly dynamic language,
      this is the only place we make use of the dynamic type.

*** (+gene)

***** plus_gene

      #+begin_src python
      @keyword("+gene")
      def plus_gene(module, body):
          name = car(body)
          rest = cdr(body)
          arrow = car(rest)
          arity = arrow_get_arity(arrow)
          if arity == 0:
              print("- (+gene) syntax error")
              print("  arity of arrow is zero")
              print("  gene dispatches on types of arguments")
              print("  can not define gene over nothing")
              print("  name : {}".format(name))
              p_print("  arrow : ")
              sexp_print(arrow)
              newline()
              error()

          default_jojo = JOJO(sexp_list_emit(module, rest))
          jojo_define(module, name, GENE(arity, default_jojo))
          return []
      #+end_src

***** arrow_get_arity

      #+begin_src python
      def arrow_get_arity(arrow):
          arity = 0
          sexp_vect = list_to_vect(cdr(arrow))
          for sexp in sexp_vect:
              if local_string_p(sexp):
                  arity = arity + 1
              elif sexp == '--':
                  break
              else:
                  pass

          return arity
      #+end_src

*** (+disp)

***** plus_disp

      #+begin_src python
      @keyword("+disp")
      def plus_disp(module, body):
          name = car(body)
          rest = cdr(body)
          arrow = car(rest)
          type_tuple_vect = arrow_get_type_tuple_vect(module, arrow)

          if not hasattr(module, name):
              print("- (+disp) syntax error")
              print("  name is undefined")
              print("  name : {}".format(name))
              error()

          gene = getattr(module, name)
          if type(gene) != GENE:
              print("- (+disp) syntax error")
              print("  type of name must be a gene")
              print("  name : {}".format(name))
              print("  type of name : {}".format(type(name)))
              error()

          jojo = JOJO(sexp_list_emit(module, rest))
          for type_tuple in type_tuple_vect:
              if type_tuple in gene.disp_dict:
                  print("- (+disp) fail")
                  print("  type_tuple for gene is already defined")
                  print("  type_tuple : {}".format(type_tuple))
                  print("  gene name : {}".format(name))
                  p_print("  arrow : ")
                  sexp_print(arrow)
                  newline()
                  error()
              else:
                  gene.disp_dict[type_tuple] = jojo

          return []
      #+end_src

***** arrow_get_type_vect

      #+begin_src python
      def arrow_get_type_vect(module, arrow):
          sexp_vect = list_to_vect(cdr(arrow))
          new_sexp_vect = []
          for sexp in sexp_vect:
              if local_string_p(sexp):
                  pass
              elif sexp == '--':
                  break
              else:
                  new_sexp_vect.append(sexp)

          new_sexp_list = vect_to_list(new_sexp_vect)
          jo_vect = sexp_list_emit(module, new_sexp_list)
          jojo = JOJO(jo_vect)
          vm = VM([], [RP(jojo)])
          vm.exe()

          return vm.ds
      #+end_src

***** type_vect_to_type_vect_vect

      #+begin_src python
      def type_vect_to_type_vect_vect(type_vect):
          type_vect_vect = []
          for t in type_vect:
              if type(t) == UNION:
                  type_vect_vect.append(t.get_type_vect())
              else:
                  type_vect_vect.append([t])

          return type_vect_vect
      #+end_src

