docs/jojo.html

<div id="outline-container-org89525ca" class="outline-4">
<h4 id="org89525ca">UNION</h4>
<div class="outline-text-4" id="text-org89525ca">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">UNION</span>:
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">__init__</span>(<span style="color: #f92672; font-weight: bold;">self</span>, jojo):
        <span style="color: #f92672; font-weight: bold;">self</span>.jojo = jojo

    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">get_type_vect</span>(<span style="color: #f92672; font-weight: bold;">self</span>):
        <span style="color: #fd971f;">vm</span> = VM([], [RP(<span style="color: #f92672; font-weight: bold;">self</span>.jojo)])
        vm.exe()
        <span style="color: #f92672; font-weight: bold;">return</span> vm.ds
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org38975ca" class="outline-3">
<h3 id="org38975ca"><span class="todo _note_">[note]</span> gene and disp</h3>
<div class="outline-text-3" id="text-org38975ca">
<ul class="org-ul">
<li><p>a gene in a module maintains a dict</p><p>form tuple of type to disp</p></li>

<li><p><p></p><p>suppose</p><p></p></p><p></p><p><p></p><p>in module m1 we have (+gene g1 &#x2026;)</p><p></p></p><p></p><p><p></p><p>in module m2 we (import m1) and</p><p>(+disp m1.g1 &#x2026;) for data in m2</p><p></p></p><p></p><p><p></p><p>this means the the global state g1 of module m1</p><p>can be changed by module m2</p><p></p></p></li>

<li><p>in such a hopelessly dynamic language,</p><p>this is the only place we make use of the dynamic type.</p></li></ul>
</div>
</div>

<div id="outline-container-orgb6dde6e" class="outline-3">
<h3 id="orgb6dde6e">(+gene)</h3>
<div class="outline-text-3" id="text-orgb6dde6e">
</div><div id="outline-container-orgaafd7b5" class="outline-4">
<h4 id="orgaafd7b5">plus_gene</h4>
<div class="outline-text-4" id="text-orgaafd7b5">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">"+gene"</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">plus_gene</span>(module, body):
    <span style="color: #fd971f;">name</span> = car(body)
    <span style="color: #fd971f;">rest</span> = cdr(body)
    <span style="color: #fd971f;">arrow</span> = car(rest)
    <span style="color: #fd971f;">arity</span> = arrow_get_arity(arrow)
    <span style="color: #f92672; font-weight: bold;">if</span> arity == 0:
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- (+gene) syntax error"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  arity of arrow is zero"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  gene dispatches on types of arguments"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  can not define gene over nothing"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  name : {}"</span>.<span style="color: #a6e22e;">format</span>(name))
        p_print(<span style="color: #e6db74;">"  arrow : "</span>)
        sexp_print(arrow)
        newline()
        error()

    <span style="color: #fd971f;">default_jojo</span> = JOJO(sexp_list_emit(module, rest))
    jojo_define(module, name, GENE(arity, default_jojo))
    <span style="color: #f92672; font-weight: bold;">return</span> []
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfed1bed" class="outline-4">
<h4 id="orgfed1bed">arrow_get_arity</h4>
<div class="outline-text-4" id="text-orgfed1bed">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">arrow_get_arity</span>(arrow):
    <span style="color: #fd971f;">arity</span> = 0
    <span style="color: #fd971f;">sexp_vect</span> = list_to_vect(cdr(arrow))
    <span style="color: #f92672; font-weight: bold;">for</span> sexp <span style="color: #f92672; font-weight: bold;">in</span> sexp_vect:
        <span style="color: #f92672; font-weight: bold;">if</span> local_string_p(sexp):
            <span style="color: #fd971f;">arity</span> = arity + 1
        <span style="color: #f92672; font-weight: bold;">elif</span> sexp == <span style="color: #e6db74;">'--'</span>:
            <span style="color: #f92672; font-weight: bold;">break</span>
        <span style="color: #f92672; font-weight: bold;">else</span>:
            <span style="color: #f92672; font-weight: bold;">pass</span>

    <span style="color: #f92672; font-weight: bold;">return</span> arity
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org73ddc8d" class="outline-3">
<h3 id="org73ddc8d">(+disp)</h3>
<div class="outline-text-3" id="text-org73ddc8d">
</div><div id="outline-container-org72d1633" class="outline-4">
<h4 id="org72d1633">plus_disp</h4>
<div class="outline-text-4" id="text-org72d1633">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@keyword</span>(<span style="color: #e6db74;">"+disp"</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">plus_disp</span>(module, body):
    <span style="color: #fd971f;">name</span> = car(body)
    <span style="color: #fd971f;">rest</span> = cdr(body)
    <span style="color: #fd971f;">arrow</span> = car(rest)
    <span style="color: #fd971f;">type_tuple_vect</span> = arrow_get_type_tuple_vect(module, arrow)

    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> <span style="color: #a6e22e;">hasattr</span>(module, name):
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- (+disp) syntax error"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  name is undefined"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  name : {}"</span>.<span style="color: #a6e22e;">format</span>(name))
        error()

    <span style="color: #fd971f;">gene</span> = <span style="color: #a6e22e;">getattr</span>(module, name)
    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">type</span>(gene) != GENE:
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- (+disp) syntax error"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  type of name must be a gene"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  name : {}"</span>.<span style="color: #a6e22e;">format</span>(name))
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  type of name : {}"</span>.<span style="color: #a6e22e;">format</span>(<span style="color: #a6e22e;">type</span>(name)))
        error()

    <span style="color: #fd971f;">jojo</span> = JOJO(sexp_list_emit(module, rest))
    <span style="color: #f92672; font-weight: bold;">for</span> type_tuple <span style="color: #f92672; font-weight: bold;">in</span> type_tuple_vect:
        <span style="color: #f92672; font-weight: bold;">if</span> type_tuple <span style="color: #f92672; font-weight: bold;">in</span> gene.disp_dict:
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- (+disp) fail"</span>)
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  type_tuple for gene is already defined"</span>)
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  type_tuple : {}"</span>.<span style="color: #a6e22e;">format</span>(type_tuple))
            <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  gene name : {}"</span>.<span style="color: #a6e22e;">format</span>(name))
            p_print(<span style="color: #e6db74;">"  arrow : "</span>)
            sexp_print(arrow)
            newline()
            error()
        <span style="color: #f92672; font-weight: bold;">else</span>:
            <span style="color: #fd971f;">gene.disp_dict</span>[type_tuple] = jojo

    <span style="color: #f92672; font-weight: bold;">return</span> []
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd58ce9f" class="outline-4">
<h4 id="orgd58ce9f">arrow_get_type_vect</h4>
<div class="outline-text-4" id="text-orgd58ce9f">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">arrow_get_type_vect</span>(module, arrow):
    <span style="color: #fd971f;">sexp_vect</span> = list_to_vect(cdr(arrow))
    <span style="color: #fd971f;">new_sexp_vect</span> = []
    <span style="color: #f92672; font-weight: bold;">for</span> sexp <span style="color: #f92672; font-weight: bold;">in</span> sexp_vect:
        <span style="color: #f92672; font-weight: bold;">if</span> local_string_p(sexp):
            <span style="color: #f92672; font-weight: bold;">pass</span>
        <span style="color: #f92672; font-weight: bold;">elif</span> sexp == <span style="color: #e6db74;">'--'</span>:
            <span style="color: #f92672; font-weight: bold;">break</span>
        <span style="color: #f92672; font-weight: bold;">else</span>:
            new_sexp_vect.append(sexp)

    <span style="color: #fd971f;">new_sexp_list</span> = vect_to_list(new_sexp_vect)
    <span style="color: #fd971f;">jo_vect</span> = sexp_list_emit(module, new_sexp_list)
    <span style="color: #fd971f;">jojo</span> = JOJO(jo_vect)
    <span style="color: #fd971f;">vm</span> = VM([], [RP(jojo)])
    vm.exe()

    <span style="color: #f92672; font-weight: bold;">return</span> vm.ds
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f0c599" class="outline-4">
<h4 id="org8f0c599">type_vect_to_type_vect_vect</h4>
<div class="outline-text-4" id="text-org8f0c599">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">type_vect_to_type_vect_vect</span>(type_vect):
    <span style="color: #fd971f;">type_vect_vect</span> = []
    <span style="color: #f92672; font-weight: bold;">for</span> t <span style="color: #f92672; font-weight: bold;">in</span> type_vect:
        <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">type</span>(t) == UNION:
            type_vect_vect.append(t.get_type_vect())
        <span style="color: #f92672; font-weight: bold;">else</span>:
            type_vect_vect.append([t])

    <span style="color: #f92672; font-weight: bold;">return</span> type_vect_vect
</pre>
</div>
</div>
</div>
