jojo/jojo.org
***** arrow_get_type_tuple_vect

      #+begin_src python
      def arrow_get_type_tuple_vect(module, arrow):
          type_vect = arrow_get_type_vect(module, arrow)
          type_vect_vect = type_vect_to_type_vect_vect(type_vect)
          return Vect(itertools.product(*type_vect_vect))
      #+end_src

* key_jo_dict

*** [note] type

    - keyword : (-> module -- jo vect)

*** key_jo_dict

    #+begin_src python
    key_jo_dict = {}
    #+end_src

*** key_jo

    #+begin_src python
    def key_jo(name, jo_vect):
        key_jo_dict[name] = jo_vect
    #+end_src

*** key_jo s

    #+begin_src python
    key_jo('apply', [APPLY])
    key_jo('ifte', [IFTE])
    key_jo('new', [NEW])
    key_jo(',', [])

    key_jo('mark', [MARK])
    key_jo('collect-vect', [COLLECT_VECT])
    key_jo('vect-spread', [VECT_SPREAD])
    key_jo('collect-list', [COLLECT_LIST])
    key_jo('list-spread', [LIST_SPREAD])

    key_jo('clear', [CLEAR])
    #+end_src

* macro_dict

*** [note] type

    - macro : (-> body -- sexp)
      where body is sexp_list

*** macro_dict

    #+begin_src python
    macro_dict = {}
    #+end_src

*** @macro

    #+begin_src python
    def macro(name):
        def decorator(fun):
            macro_dict[name] = fun
            return fun
        return decorator
    #+end_src

*** (cond)

    #+begin_src python
    @macro('cond')
    def k_cond(body):
        def recur(rest):
            if list_length(rest) == 2:
                q = list_ref(rest, 0)
                a = list_ref(rest, 1)
                if q == 'else':
                    return a
                else:
                    return vect_to_sexp(
                        ['begin',
                         q, ['clo', a],
                         ['clo',
                          ['quote', body],
                          'report-cond-mismatch'],
                         'ifte'])
            else:
                q = list_ref(rest, 0)
                a = list_ref(rest, 1)
                return vect_to_sexp(
                    ['begin',
                     q, ['clo', a],
                     ['clo', recur(cdr(cdr(rest)))],
                     'ifte'])
        return recur(body)

    @prim('report-cond-mismatch')
    def report_cond_mismatch(body):
        print("- cond mismatch")
        p_print("  body : ")
        sexp_print(body)
        newline()
        error()
    #+end_src

*** (if)

    #+begin_src python
    @macro('if')
    def k_if(body):
        length = list_length(body)
        if length != 3:
            print("- (if) syntax fail")
            print("  body of (if) must has 3 sexps")
            print("  body length : {}".format(length))
            p_print("  body : ")
            sexp_list_print(body)
            newline()
            error()

        return vect_to_sexp(
            ['begin',
             car(body),
             ['clo', car(cdr(body))],
             ['clo', car(cdr(cdr(body)))],
             'ifte'])
    #+end_src

*** (when)

    #+begin_src python
    @macro('when')
    def k_when(body):
        length = list_length(body)
        if length <= 1:
            print("- (when) syntax fail")
            print("  length of body of (when) must be greater then 1")
            print("  body length : {}".format(length))
            p_print("  body : ")
            sexp_list_print(body)
            newline()
            error()

        rest_list = cdr(body)
        rest_vect = ['begin']
        rest_vect.extend(list_to_vect(rest_list))

        return vect_to_sexp(
            ['begin',
             car(body),
             ['clo', rest_vect],
             ['clo'],
             'ifte'])
    #+end_src

