docs/jojo.html

<div id="outline-container-org1ec7f04" class="outline-4">
<h4 id="org1ec7f04">arrow_get_type_tuple_vect</h4>
<div class="outline-text-4" id="text-org1ec7f04">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">arrow_get_type_tuple_vect</span>(module, arrow):
    <span style="color: #fd971f;">type_vect</span> = arrow_get_type_vect(module, arrow)
    <span style="color: #fd971f;">type_vect_vect</span> = type_vect_to_type_vect_vect(type_vect)
    <span style="color: #f92672; font-weight: bold;">return</span> Vect(itertools.product(*type_vect_vect))
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc2fbef3" class="outline-2">
<h2 id="orgc2fbef3">key_jo_dict</h2>
<div class="outline-text-2" id="text-orgc2fbef3">
</div><div id="outline-container-org7fcbc04" class="outline-3">
<h3 id="org7fcbc04"><span class="todo _note_">[note]</span> type</h3>
<div class="outline-text-3" id="text-org7fcbc04">
<ul class="org-ul">
<li><p>keyword : (-&gt; module &#x2013; jo vect)</p></li></ul>
</div>
</div>

<div id="outline-container-orgfa14b9d" class="outline-3">
<h3 id="orgfa14b9d">key_jo_dict</h3>
<div class="outline-text-3" id="text-orgfa14b9d">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fd971f;">key_jo_dict</span> = {}
</pre>
</div>
</div>
</div>

<div id="outline-container-org377c6e1" class="outline-3">
<h3 id="org377c6e1">key_jo</h3>
<div class="outline-text-3" id="text-org377c6e1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">key_jo</span>(name, jo_vect):
    <span style="color: #fd971f;">key_jo_dict</span>[name] = jo_vect
</pre>
</div>
</div>
</div>

<div id="outline-container-org497ee7f" class="outline-3">
<h3 id="org497ee7f">key_jo s</h3>
<div class="outline-text-3" id="text-org497ee7f">
<div class="org-src-container">

<pre class="src src-python">key_jo(<span style="color: #e6db74;">'apply'</span>, [APPLY])
key_jo(<span style="color: #e6db74;">'ifte'</span>, [IFTE])
key_jo(<span style="color: #e6db74;">'new'</span>, [NEW])
key_jo(<span style="color: #e6db74;">','</span>, [])

key_jo(<span style="color: #e6db74;">'mark'</span>, [MARK])
key_jo(<span style="color: #e6db74;">'collect-vect'</span>, [COLLECT_VECT])
key_jo(<span style="color: #e6db74;">'vect-spread'</span>, [VECT_SPREAD])
key_jo(<span style="color: #e6db74;">'collect-list'</span>, [COLLECT_LIST])
key_jo(<span style="color: #e6db74;">'list-spread'</span>, [LIST_SPREAD])

key_jo(<span style="color: #e6db74;">'clear'</span>, [CLEAR])
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1baff66" class="outline-2">
<h2 id="org1baff66">macro_dict</h2>
<div class="outline-text-2" id="text-org1baff66">
</div><div id="outline-container-org477e2fd" class="outline-3">
<h3 id="org477e2fd"><span class="todo _note_">[note]</span> type</h3>
<div class="outline-text-3" id="text-org477e2fd">
<ul class="org-ul">
<li><p>macro : (-&gt; body &#x2013; sexp)</p><p>where body is sexp_list</p></li></ul>
</div>
</div>

<div id="outline-container-orga3b081b" class="outline-3">
<h3 id="orga3b081b">macro_dict</h3>
<div class="outline-text-3" id="text-orga3b081b">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fd971f;">macro_dict</span> = {}
</pre>
</div>
</div>
</div>

<div id="outline-container-org95b564d" class="outline-3">
<h3 id="org95b564d">@macro</h3>
<div class="outline-text-3" id="text-org95b564d">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">macro</span>(name):
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">decorator</span>(fun):
        <span style="color: #fd971f;">macro_dict</span>[name] = fun
        <span style="color: #f92672; font-weight: bold;">return</span> fun
    <span style="color: #f92672; font-weight: bold;">return</span> decorator
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d291c" class="outline-3">
<h3 id="org9d291c">(cond)</h3>
<div class="outline-text-3" id="text-org9d291c">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@macro</span>(<span style="color: #e6db74;">'cond'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_cond</span>(body):
    <span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">recur</span>(rest):
        <span style="color: #f92672; font-weight: bold;">if</span> list_length(rest) == 2:
            <span style="color: #fd971f;">q</span> = list_ref(rest, 0)
            <span style="color: #fd971f;">a</span> = list_ref(rest, 1)
            <span style="color: #f92672; font-weight: bold;">if</span> q == <span style="color: #e6db74;">'else'</span>:
                <span style="color: #f92672; font-weight: bold;">return</span> a
            <span style="color: #f92672; font-weight: bold;">else</span>:
                <span style="color: #f92672; font-weight: bold;">return</span> vect_to_sexp(
                    [<span style="color: #e6db74;">'begin'</span>,
                     q, [<span style="color: #e6db74;">'clo'</span>, a],
                     [<span style="color: #e6db74;">'clo'</span>,
                      [<span style="color: #e6db74;">'quote'</span>, body],
                      <span style="color: #e6db74;">'report-cond-mismatch'</span>],
                     <span style="color: #e6db74;">'ifte'</span>])
        <span style="color: #f92672; font-weight: bold;">else</span>:
            <span style="color: #fd971f;">q</span> = list_ref(rest, 0)
            <span style="color: #fd971f;">a</span> = list_ref(rest, 1)
            <span style="color: #f92672; font-weight: bold;">return</span> vect_to_sexp(
                [<span style="color: #e6db74;">'begin'</span>,
                 q, [<span style="color: #e6db74;">'clo'</span>, a],
                 [<span style="color: #e6db74;">'clo'</span>, recur(cdr(cdr(rest)))],
                 <span style="color: #e6db74;">'ifte'</span>])
    <span style="color: #f92672; font-weight: bold;">return</span> recur(body)

<span style="color: #66d9ef; font-weight: bold;">@prim</span>(<span style="color: #e6db74;">'report-cond-mismatch'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">report_cond_mismatch</span>(body):
    <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- cond mismatch"</span>)
    p_print(<span style="color: #e6db74;">"  body : "</span>)
    sexp_print(body)
    newline()
    error()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa42d61" class="outline-3">
<h3 id="orgaa42d61">(if)</h3>
<div class="outline-text-3" id="text-orgaa42d61">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@macro</span>(<span style="color: #e6db74;">'if'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_if</span>(body):
    <span style="color: #fd971f;">length</span> = list_length(body)
    <span style="color: #f92672; font-weight: bold;">if</span> length != 3:
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- (if) syntax fail"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  body of (if) must has 3 sexps"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  body length : {}"</span>.<span style="color: #a6e22e;">format</span>(length))
        p_print(<span style="color: #e6db74;">"  body : "</span>)
        sexp_list_print(body)
        newline()
        error()

    <span style="color: #f92672; font-weight: bold;">return</span> vect_to_sexp(
        [<span style="color: #e6db74;">'begin'</span>,
         car(body),
         [<span style="color: #e6db74;">'clo'</span>, car(cdr(body))],
         [<span style="color: #e6db74;">'clo'</span>, car(cdr(cdr(body)))],
         <span style="color: #e6db74;">'ifte'</span>])
</pre>
</div>
</div>
</div>

<div id="outline-container-org1936528" class="outline-3">
<h3 id="org1936528">(when)</h3>
<div class="outline-text-3" id="text-org1936528">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@macro</span>(<span style="color: #e6db74;">'when'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_when</span>(body):
    <span style="color: #fd971f;">length</span> = list_length(body)
    <span style="color: #f92672; font-weight: bold;">if</span> length &lt;= 1:
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- (when) syntax fail"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  length of body of (when) must be greater then 1"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  body length : {}"</span>.<span style="color: #a6e22e;">format</span>(length))
        p_print(<span style="color: #e6db74;">"  body : "</span>)
        sexp_list_print(body)
        newline()
        error()

    <span style="color: #fd971f;">rest_list</span> = cdr(body)
    <span style="color: #fd971f;">rest_vect</span> = [<span style="color: #e6db74;">'begin'</span>]
    rest_vect.extend(list_to_vect(rest_list))

    <span style="color: #f92672; font-weight: bold;">return</span> vect_to_sexp(
        [<span style="color: #e6db74;">'begin'</span>,
         car(body),
         [<span style="color: #e6db74;">'clo'</span>, rest_vect],
         [<span style="color: #e6db74;">'clo'</span>],
         <span style="color: #e6db74;">'ifte'</span>])
</pre>
</div>
</div>
</div>
