jojo/jojo.org
*** (call)

    - use 'prepare-default-arguments'
      to push default arguments to stack
      and call the function

    #+begin_src python
    @macro('call')
    def k_call(body):
        rest_vect = list_to_vect(cdr(body))
        name = car(body)
        fields = []
        new_body = ['begin']
        for sexp in rest_vect:
           if message_string_p(sexp):
               fields.append(sexp[1:])
           else:
               new_body.append(sexp)
        return vect_to_sexp(
            ['begin',
             ['quote', fields], 'list->vect',
             'mark', new_body, 'collect-vect',
             ['primitive', name],
             'prepare-default-arguments',
             name])
    #+end_src

*** (create)

***** k_create

      #+begin_src python
      @macro('create')
      def k_create(body):
          name = car(body)
          if not string_p(name):
              # the second place in (create)
              #   can returns a data
              return k_create_from_data(body)
          elif dot_data_name_string_p(name):
              return k_create_from_data(body)
          else:
              return k_create_from_class(body)
      #+end_src

***** dot_data_name_string_p

      #+begin_src python
      def dot_data_name_string_p(string):
          string_vect = string.split('.')
          return data_name_string_p(string_vect[-1])
      #+end_src

***** k_create_from_class

      #+begin_src python
      def k_create_from_class(body):
          rest_vect = list_to_vect(cdr(body))
          name = car(body)
          fields = []
          new_body = ['begin']
          for sexp in rest_vect:
              if message_string_p(sexp):
                  fields.append(sexp[1:])
              else:
                  new_body.append(sexp)
          return vect_to_sexp(
              ['begin',
               ['quote', fields], 'list->vect',
               'mark', new_body, 'collect-vect',
               ['primitive', name],
               'prepare-default-arguments',
               name,
               'new'])
      #+end_src

***** k_create_from_data

      #+begin_src python
      def k_create_from_data(body):
          rest_vect = list_to_vect(cdr(body))
          name = car(body)
          fields = []
          new_body = ['begin']
          for sexp in rest_vect:
              if message_string_p(sexp):
                  fields.append(sexp[1:])
              else:
                  new_body.append(sexp)
          return vect_to_sexp(
              ['begin',
               ['quote', fields], 'list->vect',
               'mark', new_body, 'collect-vect',
               name,
               'prepare-data-arguments',
               name,
               'new'])
      #+end_src

* epilog -- interface

*** maybe_drop_shebang

    #+begin_src python
    def maybe_drop_shebang(code):
        length = len(code)
        if length < 3:
            return code
        elif code[0:2] != '#!':
            return code
        else:
            end_of_first_line = code.find('\n')
            if end_of_first_line == -1:
                return ""
            else:
                return code[end_of_first_line:]
    #+end_src

*** load

    - path is used as module name

    #+begin_src python
    def load(name, path):
        current_module = sys.modules[inspect.stack()[1].frame.f_globals['__name__']]
        if ((current_module.__name__ == '__main__') or
            (not hasattr(current_module, '__file__'))):
            path = os.path.abspath(path)
        else:
            current_module_dir = os.path.dirname(current_module.__file__)
            path = "/".join([current_module_dir, path])

        if not os.path.exists(path):
            print("- load fail")
            print("  path does not exist")
            print("  path : {}".format(path))
            error()

        if not os.path.isfile(path):
            print("- load fail")
            print("  path is not file")
            print("  path : {}".format(path))
            error()

        with open(path, "r") as f:
            code = f.read()
            code = maybe_drop_shebang(code)
            sexp_vect = parse_sexp_vect(code_scan(code))
            module = compile_module(name, sexp_vect)

        module.__file__ = path

        return module
    #+end_src

*** run

    #+begin_src python
    def run(data_stack, jojo_vect):
        data_stack = vect_copy(data_stack)
        for jojo in jojo_vect:
            run_one(data_stack, jojo)
        return data_stack

    def run_one(data_stack, jojo):
        vm = VM(data_stack,
                [RP(jojo)])
        vm.exe()
    #+end_src

*** core_module

