docs/jojo.html

<div id="outline-container-org33c63e5" class="outline-3">
<h3 id="org33c63e5">(call)</h3>
<div class="outline-text-3" id="text-org33c63e5">
<ul class="org-ul">
<li><p>use 'prepare-default-arguments'</p><p>to push default arguments to stack</p><p>and call the function</p></li></ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@macro</span>(<span style="color: #e6db74;">'call'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_call</span>(body):
    <span style="color: #fd971f;">rest_vect</span> = list_to_vect(cdr(body))
    <span style="color: #fd971f;">name</span> = car(body)
    <span style="color: #fd971f;">fields</span> = []
    <span style="color: #fd971f;">new_body</span> = [<span style="color: #e6db74;">'begin'</span>]
    <span style="color: #f92672; font-weight: bold;">for</span> sexp <span style="color: #f92672; font-weight: bold;">in</span> rest_vect:
       <span style="color: #f92672; font-weight: bold;">if</span> message_string_p(sexp):
           fields.append(sexp[1:])
       <span style="color: #f92672; font-weight: bold;">else</span>:
           new_body.append(sexp)
    <span style="color: #f92672; font-weight: bold;">return</span> vect_to_sexp(
        [<span style="color: #e6db74;">'begin'</span>,
         [<span style="color: #e6db74;">'quote'</span>, fields], <span style="color: #e6db74;">'list-&gt;vect'</span>,
         <span style="color: #e6db74;">'mark'</span>, new_body, <span style="color: #e6db74;">'collect-vect'</span>,
         [<span style="color: #e6db74;">'primitive'</span>, name],
         <span style="color: #e6db74;">'keyword-apply'</span>])
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec8f860" class="outline-3">
<h3 id="orgec8f860">(create)</h3>
<div class="outline-text-3" id="text-orgec8f860">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #66d9ef; font-weight: bold;">@macro</span>(<span style="color: #e6db74;">'create'</span>)
<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">k_create</span>(body):
    <span style="color: #fd971f;">rest_vect</span> = list_to_vect(cdr(body))
    <span style="color: #fd971f;">name</span> = car(body)
    <span style="color: #fd971f;">fields</span> = []
    <span style="color: #fd971f;">new_body</span> = [<span style="color: #e6db74;">'begin'</span>]
    <span style="color: #f92672; font-weight: bold;">for</span> sexp <span style="color: #f92672; font-weight: bold;">in</span> rest_vect:
        <span style="color: #f92672; font-weight: bold;">if</span> message_string_p(sexp):
            fields.append(sexp[1:])
        <span style="color: #f92672; font-weight: bold;">else</span>:
            new_body.append(sexp)
    <span style="color: #f92672; font-weight: bold;">return</span> vect_to_sexp(
        [<span style="color: #e6db74;">'begin'</span>,
         [<span style="color: #e6db74;">'quote'</span>, fields], <span style="color: #e6db74;">'list-&gt;vect'</span>,
         <span style="color: #e6db74;">'mark'</span>, new_body, <span style="color: #e6db74;">'collect-vect'</span>,
         name,
         <span style="color: #e6db74;">'prepare-data-arguments'</span>,
         name,
         <span style="color: #e6db74;">'new'</span>])
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org891b9c2" class="outline-2">
<h2 id="org891b9c2">epilog &#x2013; interface</h2>
<div class="outline-text-2" id="text-org891b9c2">
</div><div id="outline-container-orged1b1da" class="outline-3">
<h3 id="orged1b1da">maybe_drop_shebang</h3>
<div class="outline-text-3" id="text-orged1b1da">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">maybe_drop_shebang</span>(code):
    <span style="color: #fd971f;">length</span> = <span style="color: #a6e22e;">len</span>(code)
    <span style="color: #f92672; font-weight: bold;">if</span> length &lt; 3:
        <span style="color: #f92672; font-weight: bold;">return</span> code
    <span style="color: #f92672; font-weight: bold;">elif</span> code[0:2] != <span style="color: #e6db74;">'#!'</span>:
        <span style="color: #f92672; font-weight: bold;">return</span> code
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #fd971f;">end_of_first_line</span> = code.find(<span style="color: #e6db74;">'\n'</span>)
        <span style="color: #f92672; font-weight: bold;">if</span> end_of_first_line == -1:
            <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #e6db74;">""</span>
        <span style="color: #f92672; font-weight: bold;">else</span>:
            <span style="color: #f92672; font-weight: bold;">return</span> code[end_of_first_line:]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5a18bd" class="outline-3">
<h3 id="orgc5a18bd">load</h3>
<div class="outline-text-3" id="text-orgc5a18bd">
<ul class="org-ul">
<li><p>path is used as module name</p></li></ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">load</span>(name, path):
    <span style="color: #fd971f;">current_module</span> = sys.modules[inspect.stack()[1].frame.f_globals[<span style="color: #e6db74;">'__name__'</span>]]
    <span style="color: #f92672; font-weight: bold;">if</span> ((current_module.<span style="color: #a6e22e;">__name__</span> == <span style="color: #e6db74;">'__main__'</span>) <span style="color: #f92672; font-weight: bold;">or</span>
        (<span style="color: #f92672; font-weight: bold;">not</span> <span style="color: #a6e22e;">hasattr</span>(current_module, <span style="color: #e6db74;">'__file__'</span>))):
        <span style="color: #fd971f;">path</span> = os.path.abspath(path)
    <span style="color: #f92672; font-weight: bold;">else</span>:
        <span style="color: #fd971f;">current_module_dir</span> = os.path.dirname(current_module.__file__)
        <span style="color: #fd971f;">path</span> = <span style="color: #e6db74;">"/"</span>.join([current_module_dir, path])

    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> os.path.exists(path):
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- load fail"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  path does not exist"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  path : {}"</span>.<span style="color: #a6e22e;">format</span>(path))
        error()

    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> os.path.isfile(path):
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- load fail"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  path is not file"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  path : {}"</span>.<span style="color: #a6e22e;">format</span>(path))
        error()

    <span style="color: #f92672; font-weight: bold;">with</span> <span style="color: #a6e22e;">open</span>(path, <span style="color: #e6db74;">"r"</span>) <span style="color: #f92672; font-weight: bold;">as</span> f:
        <span style="color: #fd971f;">code</span> = f.read()
        <span style="color: #fd971f;">code</span> = maybe_drop_shebang(code)
        <span style="color: #fd971f;">sexp_vect</span> = parse_sexp_vect(code_scan(code))
        <span style="color: #fd971f;">module</span> = compile_module(name, sexp_vect)

    <span style="color: #fd971f;">module.__file__</span> = path

    <span style="color: #f92672; font-weight: bold;">return</span> module
</pre>
</div>
</div>
</div>

<div id="outline-container-orga754c0" class="outline-3">
<h3 id="orga754c0">run</h3>
<div class="outline-text-3" id="text-orga754c0">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">run</span>(data_stack, jojo_vect):
    <span style="color: #fd971f;">data_stack</span> = vect_copy(data_stack)
    <span style="color: #f92672; font-weight: bold;">for</span> jojo <span style="color: #f92672; font-weight: bold;">in</span> jojo_vect:
        run_one(data_stack, jojo)
    <span style="color: #f92672; font-weight: bold;">return</span> data_stack

<span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">run_one</span>(data_stack, jojo):
    <span style="color: #fd971f;">vm</span> = VM(data_stack,
            [RP(jojo)])
    vm.exe()
</pre>
</div>
</div>
</div>
