jojo/jojo.org
***** load_core

      #+begin_src python
      def load_core(path):
          path = os.path.abspath(path)

          if not os.path.exists(path):
              print("- load_core fail")
              print("  path does not exist")
              print("  path : {}".format(path))
              error()

          if not os.path.isfile(path):
              print("- load_core fail")
              print("  path is not file")
              print("  path : {}".format(path))
              error()

          with open(path, "r") as f:
              code = f.read()
              sexp_vect = parse_sexp_vect(code_scan(code))
              module = compile_core_module(path, sexp_vect)

          module.__file__ = path

          return module
      #+end_src

***** core_module

      #+begin_src python
      current_module = sys.modules[__name__]
      current_module_dir = os.path.dirname(current_module.__file__)
      core_path = "/".join([current_module_dir, "core.jo"])
      core_module = load_core(core_path)
      #+end_src
