docs/jojo.html

<div id="outline-container-orge2daccd" class="outline-3">
<h3 id="orge2daccd">core_module</h3>
<div class="outline-text-3" id="text-orge2daccd">
</div><div id="outline-container-org35d9f9a" class="outline-4">
<h4 id="org35d9f9a">load_core</h4>
<div class="outline-text-4" id="text-org35d9f9a">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #f92672; font-weight: bold;">def</span> <span style="color: #a6e22e;">load_core</span>(path):
    <span style="color: #fd971f;">path</span> = os.path.abspath(path)

    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> os.path.exists(path):
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- load_core fail"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  path does not exist"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  path : {}"</span>.<span style="color: #a6e22e;">format</span>(path))
        error()

    <span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #f92672; font-weight: bold;">not</span> os.path.isfile(path):
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"- load_core fail"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  path is not file"</span>)
        <span style="color: #f92672; font-weight: bold;">print</span>(<span style="color: #e6db74;">"  path : {}"</span>.<span style="color: #a6e22e;">format</span>(path))
        error()

    <span style="color: #f92672; font-weight: bold;">with</span> <span style="color: #a6e22e;">open</span>(path, <span style="color: #e6db74;">"r"</span>) <span style="color: #f92672; font-weight: bold;">as</span> f:
        <span style="color: #fd971f;">code</span> = f.read()
        <span style="color: #fd971f;">sexp_vect</span> = parse_sexp_vect(code_scan(code))
        <span style="color: #fd971f;">module</span> = compile_core_module(path, sexp_vect)

    <span style="color: #fd971f;">module.__file__</span> = path

    <span style="color: #f92672; font-weight: bold;">return</span> module
</pre>
</div>
</div>
</div>

<div id="outline-container-org13ede74" class="outline-4">
<h4 id="org13ede74">core_module</h4>
<div class="outline-text-4" id="text-org13ede74">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fd971f;">current_module</span> = sys.modules[<span style="color: #a6e22e;">__name__</span>]
<span style="color: #fd971f;">current_module_dir</span> = os.path.dirname(current_module.__file__)
<span style="color: #fd971f;">core_path</span> = <span style="color: #e6db74;">"/"</span>.join([current_module_dir, <span style="color: #e6db74;">"core.jo"</span>])
<span style="color: #fd971f;">core_module</span> = load_core(core_path)
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: xieyuheng</p>
<p class="date">Created: 2017-11-28 Tue 00:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
